liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                                                                            **
**  Copyright (C) Infineon Technologies (2017)                                **
**                                                                            **
**  All rights reserved.                                                      **
**                                                                            **
**  This document contains proprietary information belonging to Infineon      **
**  Technologies. Passing on and copying of this document, and communication  **
**  of its contents is not permitted without prior written authorization.     **
**                                                                            **
********************************************************************************
**                                                                            **
**  FILENAME     : Can_17_McmCan.c                                            **
**                                                                            **
**  VERSION      : 15.0.0                                                     **
**                                                                            **
**  DATE         : 2018-09-26                                                 **
**                                                                            **
**  VARIANT      : Variant PB                                                 **
**                                                                            **
**  PLATFORM     : Infineon AURIX2G                                           **
**                                                                            **
**  AUTHOR       : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**  VENDOR       : Infineon Technologies                                      **
**                                                                            **
**  TRACEABILITY : [cover parentID={75972939-822C-41cc-8B6A-327F181E274A}]    **
**                 [cover parentID={72DABBEB-F27B-4677-B6B4-B53F634341BA}]    **
**                                                                            **
**  DESCRIPTION  : CAN Driver source file                                     **
**                                                                            **
**  SPECIFICATION(S) : Specification of CAN Driver, AUTOSAR Release 4.2.2     **
**                                                                            **
**  MAY BE CHANGED BY USER : no                                               **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
/* Include the declarations of Can functions and types */
#include "Can_17_McmCan.h"

/* [cover parentID={6CE56ADD-37B9-4c96-BC08-609A206511DC}]
[/cover] */
/* [cover parentID={C0E673D5-B80C-40f5-9944-70221E106146}]
[/cover] */
/* Register definition file for Aurix2G target */
#include "IfxSrc_reg.h"

/* MCAL header file containing global macros, type definitions and functions
needed by all MCAL drivers */
#include "McalLib.h"
#if(CAN_17_MCMCAN_INIT_DEINIT_API_MODE != CAN_17_MCMCAN_MCAL_SUPERVISOR)
#include "McalLib_OsStub.h"
#endif

/* Include the declarations of Can functions and types */
#include "SchM_Can_17_McmCan.h"

/* Include the declarations of CanIf callback functions and types */
#include "CanIf_Cbk.h"

#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/* Include default error detection header file if DET is Enabled */
#include "Det.h"
#endif

/*******************************************************************************
**                       Version check                                        **
*******************************************************************************/
/* [cover parentID={527E2B9D-7EFB-422d-A9BF-282FD3E78B84}]
  Version across the files
[/cover] */
/* Check if the correct version of Can_17_McmCan.h is included */
#ifndef CAN_17_MCMCAN_AR_RELEASE_MAJOR_VERSION
#error "CAN_17_MCMCAN_AR_RELEASE_MAJOR_VERSION is not defined. "
#endif

#ifndef CAN_17_MCMCAN_AR_RELEASE_MINOR_VERSION
#error "CAN_17_MCMCAN_AR_RELEASE_MINOR_VERSION is not defined. "
#endif

#ifndef CAN_17_MCMCAN_AR_RELEASE_REVISION_VERSION
#error "CAN_17_MCMCAN_AR_RELEASE_REVISION_VERSION is not defined. "
#endif

#if ( CAN_17_MCMCAN_AR_RELEASE_MAJOR_VERSION != 4U )
#error "CAN_17_MCMCAN_AR_RELEASE_MAJOR_VERSION does not match. "
#endif

#if ( CAN_17_MCMCAN_AR_RELEASE_MINOR_VERSION != 2U )
#error "CAN_17_MCMCAN_AR_RELEASE_MINOR_VERSION does not match. "
#endif

/* Check for definition of SW version Information */
#ifndef CAN_17_MCMCAN_SW_MAJOR_VERSION
#error "CAN_17_MCMCAN_SW_MAJOR_VERSION is not defined. "
#endif

#ifndef CAN_17_MCMCAN_SW_MINOR_VERSION
#error "CAN_17_MCMCAN_SW_MINOR_VERSION is not defined. "
#endif

#ifndef CAN_17_MCMCAN_SW_PATCH_VERSION
#error "CAN_17_MCMCAN_SW_PATCH_VERSION is not defined. "
#endif

/* Check for Correct inclusion of headers */
#if ( CAN_17_MCMCAN_SW_MAJOR_VERSION != 4U )
#error "CAN_17_MCMCAN_SW_MAJOR_VERSION does not match. "
#endif

#if ( CAN_17_MCMCAN_SW_MINOR_VERSION != 0U )
#error "CAN_17_MCMCAN_SW_MINOR_VERSION does not match. "
#endif

/* Inter Module Check */

/* [cover parentID={A3DC8FC4-FD65-43c0-A540-925A1AC9702B}]
  Version check for DET
[/cover] */
/*
  VERSION CHECK FOR DET MODULE INCLUSION
*/
#if ( CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)

#ifndef DET_AR_RELEASE_MAJOR_VERSION
#error "DET_AR_RELEASE_MAJOR_VERSION is not defined. "
#endif

#if ( DET_AR_RELEASE_MAJOR_VERSION != CAN_17_MCMCAN_AR_RELEASE_MAJOR_VERSION )
#error "DET_AR_RELEASE_MAJOR_VERSION does not match. "
#endif

#endif /* #if ( CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

