liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                       Private Macro Definitions                            **
*******************************************************************************/
/* Register write macros */
#define CAN_17_MCMCAN_REG_ONE                               (uint32)1

/* Values used by the CAN driver */
#define CAN_17_MCMCAN_ZERO                                  (uint8)0
#define CAN_17_MCMCAN_ONE                                   (uint8)1
#define CAN_17_MCMCAN_TWO                                   (uint8)2
#define CAN_17_MCMCAN_THREE                                 (uint8)3
#define CAN_17_MCMCAN_FOUR                                  (uint8)4
#define CAN_17_MCMCAN_FIVE                                  (uint8)5
#define CAN_17_MCMCAN_SIX                                   (uint8)6
#define CAN_17_MCMCAN_EIGHT                                 (uint8)8

#define CAN_17_MCMCAN_HUNDRED                               (uint8)100

#if ((CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) || \
  (CAN_17_MCMCAN_FD_ENABLE == STD_ON))
#define CAN_17_MCMCAN_SEVEN                                 (uint8)7
#endif

#define CAN_17_MCMCAN_SIXTEEN                               (uint8)16

#if ((CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_ON)|| \
  (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON))
#define CAN_17_MCMCAN_NO_HOH_VAL                            (uint8)255
#endif

#if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
#define CAN_17_MCMCAN_ELEVEN                                (uint8)11
#define CAN_17_MCMCAN_FIFTEEN                               (uint8)15
/* Shift operation values used by the CAN driver */
#define CAN_17_MCMCAN_SHIFT_TWENTYFOUR                      (uint8)24
/* Message RAM element size with FD support */
#define CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_FD               (uint32)72
#endif

/* RAM BYTE size */
#define CAN_17_MCMCAN_RAM_BYTES                             (uint32)4

/* Shift operation values used by the CAN driver */
#define CAN_17_MCMCAN_SHIFT_EIGHTEEN                        (uint8)18

/* Values for clear and Register data check */
#define CAN_17_MCMCAN_DATA_ZERO             (Ifx_UReg_32Bit) (0x00000000U)

/* Value for Address Check */
#define CAN_17_MCMCAN_ADDRESS_CHECK         (uint32) (0x00000000U)

/* Values for clear IR register */
#define CAN_17_MCMCAN_CLEAR_ALL_INTERRUPTS   (uint32)(0x3FCFFFFFU)

/* Values for Set Global register for reject RTR and Non Match Frames */
#define CAN_17_MCMCAN_GFC_REJT_RTR_NONMATCH   (uint32)(0x0000003FU)

/* Value for clear new data register */
#define CAN_17_MCMCAN_CLEAR_NEWDATA_REG       (uint32)(0xFFFFFFFFU)

/* Value for MASK the Message RAM Offset address */
#define CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK  (uint32) (0x0000FFFC)

/* value for Tx buffer Index */
#define CAN_17_MCMCAN_TX_BUFF_MASK            (uint32)(0x00000001U)
/* Set for identify the MsgID is extended */
#define CAN_17_MCMCAN_SET_XTD_BIT_MASK        (0x80000000U)

/* used for Mask value for identify the INIT */
#define CAN_17_MCMCAN_CCCR_INIT_SET_MASK      (uint32)(0x00000001U)

/* used for Mask value for identify the INIT */
#define CAN_17_MCMCAN_CCCR_CCE_SET_MASK      (uint32)(0x00000003U)

/* Value used for the CLK selection */
#define CAN_17_MCMCAN_MCR_CLKSEL_SET          (Ifx_UReg_32Bit)(0x00000003U)

/* Value used for enable the CLK configuration change */
#define CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE                   (0xC0000000U)

/* Value used for NDAT2 Register buffer Position access */
#define CAN_17_MCMCAN_THIRTY_TWO                            (uint8)32

/* Value used for check bit is set or not */
#define CAN_17_MCMCAN_BIT_CLEAR_VAL                         (Ifx_UReg_32Bit)0

/* Bit Set Value */
#define CAN_17_MCMCAN_BIT_SET_VAL                           (Ifx_UReg_32Bit)1

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* Message Id Mask Value */
#define CAN_17_MCMCAN_MSG_MASK_VAL                          (Can_IdType)0
#endif

#if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)
/* Clear DRX (dedicated buffer) flag in IR register */
#define CAN_17_MCMCAN_CLEAR_IE_DRX_BIT                  (uint32) (0x00080000U)
#endif /* #if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON) */

#if (CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)
/* Clear TEFN (Tx Event FIFO New Entry) flag in IR register */
#define CAN_17_MCMCAN_CLEAR_IE_TEFN_BIT                 (uint32) (0x00001000U)
#endif /* #if (CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON) */

#if(CAN_17_MCMCAN_BO_INTERRUPT_PROCESSING == STD_ON)
/* Clear BO (Bus_Off Status) flag in IR register */
#define CAN_17_MCMCAN_CLEAR_IE_BO_BIT                   (uint32) (0x02000000U)
#endif

#if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)
/* Clear RF1W (Rx FIFO 1 Watermark Reached) flag in IR register */
#define CAN_17_MCMCAN_CLEAR_IE_RF1W_BIT                 (uint32) (0x00000020U)

/* Clear RF1W (Rx FIFO 0 Watermark Reached) flag in IR register */
#define CAN_17_MCMCAN_CLEAR_IE_RF0W_BIT                 (uint32) (0x00000002U)
#endif /* #if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON) */

/* Macro to get the core ID */
#define CAN_17_MCMCAN_GETCOREID ((uint8)(Mcal_GetCpuIndex()))

#if (CAN_17_MCMCAN_DEINIT_API == STD_ON)
/* Status to indicate that CAN is initialized */
#define CAN_17_MCMCAN_DEINITPENDING              ((uint32)2)
/* Status to indicate that CAN is de-initailized */
#define CAN_17_MCMCAN_UNINIT                      ((uint32)0)
#endif /* #if(CAN_17_MCMCAN_DEINIT_API == STD_ON) */

/* Status to indicate that CAN is initialized */
#define CAN_17_MCMCAN_READY                       ((uint32)1)

/* SiZE of the variable to be read */
#define CAN_17_MCMCAN_INIT_STATUS_SIZE            2

/* Disable CAN clock */
#define CAN_17_MCMCAN_CLK_DISABLE                ((uint32)0)

/* Number of transmit hardware object buffers present */
#define CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE             ((uint32)32)

#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/* Number of transmit hardware object buffers present */
#define CAN_17_MCMCAN_MAX_SWOBJECT_INDEX                    ((uint16)384)
#endif

/* Values used for FD mask and Extended Id Mask */
#define CAN_17_MCMCAN_EXTENDED_ID_SET             (uint32)(0x80000000U)
#define CAN_17_MCMCAN_EXTENDED_ID_MASK            (uint32)(0x1FFFFFFFU)
#define CAN_17_MCMCAN_STANDARD_ID_MASK            (uint32)(0x000007FFU)
#if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
#define CAN_17_MCMCAN_ID_FD_ENABLE_SET            (uint32)(0x40000000U)
/* Value used for set the FD status for upper-layer */
#define CAN_17_MCMCAN_SET_FD_MASK                 (0x40000000U)
#endif

/* Message RAM element size with FD support */
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_NFD              (uint32)16

