liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/* CCR.INIT bit status check mask value */
#define CAN_17_MCMCAN_NODE_INIT_MODE              (0x00000001U)
#define CAN_17_MCMCAN_NODE_INIT_CCE_SET           (uint32)(0x00000001)
#define CAN_17_MCMCAN_CCCR_CSA_STATUS                        (0x00000008U)
#define CAN_17_MCMCAN_MODULE_DISABLE_STATUS                 (0x00000002U)
#define CAN_17_MCMCAN_MCR_RBUSY_STATUS                 (0x10000000U)
#define CAN_17_MCMCAN_NODE_PSR_MODE              (0x00000018U)

#if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
/* Value used for Max FD length operation */
#define CAN_17_MCMCAN_MAX_FD_LENGTH                (uint8)64
#define CAN_17_MCMCAN_CCCR_FDOE_STATUS             (uint32)(0x00000100U)
#define CAN_17_MCMCAN_CCCR_BRSE_STATUS             (uint32)(0x00000200U)
#endif

/* Normal DLC length */
#define CAN_17_MCMCAN_MAX_DATA_LENGTH                       (uint8) (8)

/* Maximum number of transmit message buffers available */
#define CAN_17_MCMCAN_MAX_TX_BUFFER_INDEX                   (uint8) (32)

/*******************************************************************************
**                         User Mode Macros                                   **
*******************************************************************************/

/* [cover parentID={1A65EADD-AFD0-4845-B2D2-8257E086DD67}]
[/cover] */
#if(CAN_17_MCMCAN_INIT_DEINIT_API_MODE == CAN_17_MCMCAN_MCAL_SUPERVISOR)
/* MISRA2012_RULE_4_9_JUSTIFICATION: Function like macro is defined for
   User mode support in code. No side effects foreseen by violating this MISRA
   rule. */
  #define CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG(RegAdd,Data)   \
    Mcal_WritePeripEndInitProtReg(RegAdd,Data)

#else

/* MISRA2012_RULE_4_9_JUSTIFICATION: Function like macro is defined for
   User mode support in code. No side effects foreseen by violating this MISRA
   rule. */
  #define CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG(RegAdd,Data)   \
    MCAL_LIB_WRITEPERIPENDINITPROTREG(RegAdd,Data)

#endif

/******************************************************************************
**                      Private Type Definitions                             **
******************************************************************************/
/* Data type used for core specific CAN driver global data storage */
typedef struct
{
  /* Can controller mode */
  CanIf_ControllerModeType* CanControllerModePtr;
  /* This variable stores status of whether interrupts are enabled for
   *  the controllers associated for the core */
  uint8* CanInterruptStatusPtr;
  /* This variable stores temperory status of whether interrupts are
   * enabled for the controller of the core*/
  uint8* CanInterruptTempStatusPtr;
  /* This variable stores count value of disable Interrupt called for the
  controller in the core */
  uint8* CanDisableIntrpCountPtr;

  /* Used to store swPduHandle passed by CanIf */
  PduIdType* CanSwObjectHandlePtr;

  #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  /* This variable stores the wake on bus off status on ICOM configuration */
  boolean* CanIcomConfgBOStatusPtr;
  /* This variable stores the Pretended network support status */
  boolean* CanIcomEnableStatusPtr;
  /* This variable used to stores the current ICOM Configuration ID */
  uint8* CanActiveIcomCfgIdPtr;
  /* ICOM Message counter counter value */
  uint16* CanIcomMsgCntrValPtr;
  #endif

#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
  /* Variable used to hold the order of transmit that have occured */
  uint16* CanTxSwObjPriorityPtr;
#endif

} Can_17_McmCan_CoreStatesType;

typedef enum
{
  CAN_17_MCMCAN_EQUAL = 0,
  CAN_17_MCMCAN_NOT_EQUAL = 1,
  CAN_17_MCMCAN_NAND = 2
}Can_17_McmCan_TimeoutCheckType;

/******************************************************************************
**                      Private Function Declarations                        **
******************************************************************************/
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_START_SEC_CODE_QM_GLOBAL
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"

/* Function to initialize CAN Module used global variables */
LOCAL_INLINE void Can_17_McmCan_lInitGlobalVar( \
   const Can_17_McmCan_CoreConfigType* const CanConfig, \
                 const Can_17_McmCan_CoreStatesType* const CanCoreState);

/* Function to initialize CAN Module clock/timing registers */
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lInitClkSetting( \
    const Can_17_McmCan_ConfigType* const Config, \
    const uint8 KernelIndx);

/* Function to initialize the global CAN Module */
static Std_ReturnType Can_17_McmCan_lGlobalInit( \
  const Can_17_McmCan_ConfigType* const Config);

/* Function to initialize the Core specific CAN Module */
static Std_ReturnType Can_17_McmCan_lCoreInit( \
    const Can_17_McmCan_CoreConfigType* const CanConfig, \
    const Can_17_McmCan_CoreStatesType* const CanCoreState);

/* Function to initialize CAN Module Node registers */
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lInitController( \
        const uint8 ControllerId, \
        const Can_17_McmCan_CoreConfigType* const CanConfig, \
        const Can_17_McmCan_CoreStatesType* const CanCoreState);

