liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/* Function to initialize Tx Hw message objects */
LOCAL_INLINE void Can_17_McmCan_lInitTxMsgObj(const uint8 Controller, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                const Can_17_McmCan_CoreConfigType* const CanConfig);
/* Function to cancel the pending Tx request */
static void Can_17_McmCan_lCancelPendingTx (const uint8 ControllerId, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig);
/* Internal function for Handling Tx write operation */
static Can_ReturnType Can_17_McmCan_lWriteMsgObj( \
                                    const Can_HwHandleType HthIndex, \
                                    const Can_PduType* const PduInfo, \
                    const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig);

#if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
/* Function to handle trigger transmit handle */
LOCAL_INLINE Can_ReturnType Can_17_McmCan_lUpdatePduInfo( \
  const Can_HwHandleType HthIndex, \
  Can_PduType* const TempPduInfo, const Can_PduType* const PduInfo, \
  const Can_17_McmCan_CoreConfigType* const CanConfig);
#endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */

#if((CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_OFF)))
/* Function for handling Tx confirmation operation */
static void Can_17_McmCan_lTxEventHandler (const uint8 HwControllerId, \
                const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                const Can_17_McmCan_CoreConfigType* const CanConfig);
#endif

#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON) && \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
static Std_ReturnType Can_17_McmCan_lPeriodCheckSwHandle( \
   const uint8 CtrlIndex, \
   const uint16 SwObjIndx, const uint8 HthRefPeriods, \
   const Can_17_McmCan_CoreConfigType* const CanConfig, \
   const Can_17_McmCan_CoreStatesType* const CanCoreState);
#endif

#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
/* Function to set the nominal baudrate */
static Std_ReturnType Can_17_McmCan_lSetBaudrate(const uint8 Controller, \
                          const uint16 BaudrateIndx, \
            const Can_17_McmCan_CoreConfigType* const CanConfig);
#endif /* #if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON) */

#if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)

/* Function to set the FD support baudrate */
static Std_ReturnType Can_17_McmCan_lFDSetBaudrate(const uint8 Controller, \
                                const uint16 FdIndex, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig);

#endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON) */

/* Function to disable the Hw support interrupts */
LOCAL_INLINE void Can_17_McmCan_lDisableInterrupts (const uint8 Controller, \
             const Can_17_McmCan_CoreConfigType* const CanConfig, \
             const Can_17_McmCan_CoreStatesType* const CanCoreState);

/* Function to enable the Hw support interrupts */
LOCAL_INLINE void Can_17_McmCan_lEnableInterrupts (const uint8 Controller, \
         const Can_17_McmCan_CoreConfigType* const CanConfig, \
         const Can_17_McmCan_CoreStatesType* const CanCoreState);

/* Function for state changes if wakeup is disabled */
static Can_ReturnType Can_17_McmCan_lSetModeWuSupportOff( \
  const uint8 Controller, \
  const Can_StateTransitionType Transition, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig);

/* Function to initialize Rx Hw message objects */
LOCAL_INLINE void Can_17_McmCan_lInitRxMsgObj(const uint8 Controller, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                const Can_17_McmCan_CoreConfigType* const CanConfig);
/* Function to clear all received messages to avoid unexpected reception
 condition */
static void  Can_17_McmCan_lClearReceivedMsg(const uint8 HwControllerId, \
                const Can_17_McmCan_CoreConfigType* const CanConfig);

/* Function to set the filter mask for standard messages */
LOCAL_INLINE void Can_17_McmCan_lSIDFilter_Config (const uint8 ControllerId, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig);
/* Function to set the filter mask for Extended messages */
LOCAL_INLINE void Can_17_McmCan_lXIDFilter_Config (const uint8 ControllerId, \
             const Can_17_McmCan_CoreConfigType* const CanConfig);

#if(((CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_OFF))|| \
  (CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)))
/* Function for Handling data reception */
static void Can_17_McmCan_lReceiveHandler(const uint8 HwControllerId, \
  const uint8 CheckBuffType, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig);
#endif
/* Function for Handling data retrieve for the message buffer */
static void Can_17_McmCan_lRxExtractData(const uint8 HwControllerId, \
                               const uint8 RxBuffIndex, \
                               const Can_17_McmCan_RxBufferType RxBuffer, \
                    const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig);


/* Handler for Bus-Off condition */
static void Can_17_McmCan_lBusOffHandler(const uint8 HwControllerId, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
               const Can_17_McmCan_CoreConfigType* const CanConfig);

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)

/* Function for Activate controller with Pretended mode */
LOCAL_INLINE void Can_17_McmCan_lActivateIcom (const uint8 Controller,\
  const IcomConfigIdType ConfigurationId, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig);

/* Function for De-activate controller with Pretended mode */
static void Can_17_McmCan_lDeactivateIcom (const uint8 Controller, \
  const IcomConfigIdType ConfigurationId, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig);

/* Function to do ICOM message validation for greater or smaller operation */
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lIcomCheckGreaterSmaller( \
  const uint8 ValData,const uint8 ConfigData, \
  uint8* const CheckVal, \
  const Can_17_McmCan_IcomSignalOperType SignalOperType);

/* Function for Validate signal conditions */
static Std_ReturnType Can_17_McmCan_lIcomValidateMsgSignal( \
                                    const uint16 MessageIndex, \
                                    const PduInfoType* const PduInfoPtr, \
                        const Can_17_McmCan_ConfigType* const CanConfig);

/* Function for Validate receive message conditions */
static void Can_17_McmCan_lIcomValidateMsg(Can_HwType* const Mailbox, \
                                    const PduInfoType* const PduInfoPtr, \
                      const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                      const Can_17_McmCan_CoreConfigType* const CanConfig);

