liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

/* Function for Hw failure time-out detection */
static Std_ReturnType Can_17_McmCan_lTimeOut ( \
                                const volatile uint32* const Can_RegAddress, \
                                    const uint32 Check_Val, \
                  const Can_17_McmCan_TimeoutCheckType CheckStatus);
#if(((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON))|| \
  (CAN_17_MCMCAN_BO_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/* Function for Driver state check */
static Std_ReturnType Can_17_McmCan_lMainDetUninitConfig( \
  const uint8 ServiceID, \
  const uint8 CoreIndex);
#endif

#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/* Function for validate the requested configuration */
static Std_ReturnType Can_17_McmCan_lInitDetCheck( \
    const Can_17_McmCan_ConfigType *const Config, \
    const uint8 CoreIndex);

/* Function to validate the Initialization status of the specific core */
static Std_ReturnType Can_17_McmCan_lDetUninitConfig( \
  const uint8 ServiceID, \
  const uint8 CoreIndex);
/* Function for mode change request validation */
static Std_ReturnType Can_17_McmCan_lModeDetCheck( \
                         const uint8 Controller, \
                         const Can_StateTransitionType Transition, \
                    const Can_17_McmCan_CoreStatesType* const CanCoreState);

/* Function for validate the requested controller id */
static Std_ReturnType Can_17_McmCan_lDetParamController( \
                                const uint8 CoreIndex, \
                                const uint8 Controller, \
                                const uint8 ServiceID);

/* Function for Write request validation */
static Std_ReturnType Can_17_McmCan_lWriteDetCheck( \
                                     const Can_HwHandleType Hth, \
                                      const Can_PduType* const PduInfo, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig);

/* Function to check validity of the Message ID passed for a write function */
static Std_ReturnType Can_17_McmCan_lWriteIdCheck( \
                                const Can_HwHandleType Hth, \
                                      const Can_PduType* const PduInfo, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig);

#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
#define CAN_17_MCMCAN_STOP_SEC_CODE_QM_GLOBAL
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"

/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/
#if (CAN_17_MCMCAN_CORE0_ACTIVATION == STD_ON)
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_START_SEC_VAR_CLEARED_QM_CORE0_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
/* Can controller mode */
static CanIf_ControllerModeType \
  CanControllerModeCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* This variable stores status of whether interrupts are enabled for
*  the controllers associated for the core */
static uint8 CanInterruptStatusCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* This variable stores temperory status of whether interrupts are
* enabled for the controller of the core*/
static uint8 CanInterruptTempStatusCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* This variable stores count value of disable Interrupt called for the
controller in the core */
static uint8 CanDisableIntrpCountCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* Used to store swPduHandle passed by CanIf */
static PduIdType CanSwObjectHandleCore0 [CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER * \
    CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE];
#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/* Variable used to hold the order of transmit that have occured */
static uint16 CanTxSwObjPriorityCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER * \
  CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE];
#endif

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* This variable stores the wake on bus off status on ICOM configuration */
static boolean CanIcomConfgBOStatusCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* This variable stores the Pretended network support status */
static boolean CanIcomEnableStatusCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* This variable used to stores the current ICOM Configuration ID */
static uint8 CanActiveIcomCfgIdCore0[CAN_17_MCMCAN_CORE0_NOOF_CONTROLLER];
/* ICOM Message counter counter value */
static uint16 CanIcomMsgCntrValCore0[CAN_17_MCMCAN_NOOF_ICOM_MSGCONFIGURATIONS];
#endif

