liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  ,
  /* This variable stores the wake on bus off status on ICOM configuration */
  &CanIcomConfgBOStatusCore3[0],
  /* This variable stores the Pretended network support status */
  &CanIcomEnableStatusCore3[0],
  /* This variable used to stores the current ICOM Configuration ID */
  &CanActiveIcomCfgIdCore3[0],
  /* ICOM Message counter counter value */
  &CanIcomMsgCntrValCore3[0]
  #endif

  #if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
  ,
  /* Variable used to hold the order of transmit that have occured */
  &CanTxSwObjPriorityCore3[0]
  #endif

};
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_STOP_SEC_CONST_QM_CORE3_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
#endif /* #if (CAN_17_MCMCAN_CORE3_ACTIVATION == STD_ON) */
#endif /* #if (MCAL_NO_OF_CORES > 3U) */

#if (MCAL_NO_OF_CORES > 4U)
#if (CAN_17_MCMCAN_CORE4_ACTIVATION == STD_ON)
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_START_SEC_VAR_CLEARED_QM_CORE4_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
/* Can controller mode */
static CanIf_ControllerModeType \
  CanControllerModeCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* This variable stores status of whether interrupts are enabled for
*  the controllers associated for the core */
static uint8 CanInterruptStatusCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* This variable stores temperory status of whether interrupts are
* enabled for the controller of the core*/
static uint8 CanInterruptTempStatusCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* This variable stores count value of disable Interrupt called for the
controller in the core */
static uint8 CanDisableIntrpCountCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* Used to store swPduHandle passed by CanIf */
static PduIdType CanSwObjectHandleCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER * \
     CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE];
#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/* Variable used to hold the order of transmit that have occured */
static uint16 CanTxSwObjPriorityCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER * \
  CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE];
#endif

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* This variable stores the wake on bus off status on ICOM configuration */
static boolean CanIcomConfgBOStatusCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* This variable stores the Pretended network support status */
static boolean CanIcomEnableStatusCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* This variable used to stores the current ICOM Configuration ID */
static uint8 CanActiveIcomCfgIdCore4[CAN_17_MCMCAN_CORE4_NOOF_CONTROLLER];
/* ICOM Message counter counter value */
static uint16 CanIcomMsgCntrValCore4[CAN_17_MCMCAN_NOOF_ICOM_MSGCONFIGURATIONS];
#endif

/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_STOP_SEC_VAR_CLEARED_QM_CORE4_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"

