liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_START_SEC_CONST_QM_CORE4_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
/* [cover parentID={1EF28616-1D93-4760-B9AB-5D9A34806B1C}]
[/cover] */
/* Structure holding core 0 specific CAN states */
static const Can_17_McmCan_CoreStatesType Can_17_McmCan_Core4State =
{
  /* Can controller mode */
  &CanControllerModeCore4[0],
  /* This variable stores status of whether interrupts are enabled for
   *  the controllers associated for the core */
  &CanInterruptStatusCore4[0],
  /* This variable stores temperory status of whether interrupts are
   * enabled for the controller of the core*/
  &CanInterruptTempStatusCore4[0],
  /* This variable stores count value of disable Interrupt called for the
  controller in the core */
  &CanDisableIntrpCountCore4[0],
  /* Used to store swPduHandle passed by CanIf */
  &CanSwObjectHandleCore4[0]

  #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  ,
  /* This variable stores the wake on bus off status on ICOM configuration */
  &CanIcomConfgBOStatusCore4[0],
  /* This variable stores the Pretended network support status */
  &CanIcomEnableStatusCore4[0],
  /* This variable used to stores the current ICOM Configuration ID */
  &CanActiveIcomCfgIdCore4[0],
  /* ICOM Message counter counter value */
  &CanIcomMsgCntrValCore4[0]
  #endif

  #if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
  ,
  /* Variable used to hold the order of transmit that have occured */
  &CanTxSwObjPriorityCore4[0]
  #endif

};
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_STOP_SEC_CONST_QM_CORE4_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
#endif /* #if (CAN_17_MCMCAN_CORE4_ACTIVATION == STD_ON) */
#endif /* #if (MCAL_NO_OF_CORE4 > 1U) */

#if (MCAL_NO_OF_CORES > 5U)
#if (CAN_17_MCMCAN_CORE5_ACTIVATION == STD_ON)
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_START_SEC_VAR_CLEARED_QM_CORE5_UNSPECIFIED
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
/* Can controller mode */
static CanIf_ControllerModeType \
  CanControllerModeCore5[CAN_17_MCMCAN_CORE5_NOOF_CONTROLLER];
/* This variable stores status of whether interrupts are enabled for
*  the controllers associated for the core */
static uint8 CanInterruptStatusCore5[CAN_17_MCMCAN_CORE5_NOOF_CONTROLLER];
/* This variable stores temperory status of whether interrupts are
* enabled for the controller of the core*/
static uint8 CanInterruptTempStatusCore5[CAN_17_MCMCAN_CORE5_NOOF_CONTROLLER];
/* This variable stores count value of disable Interrupt called for the
controller in the core */
static uint8 CanDisableIntrpCountCore5[CAN_17_MCMCAN_CORE5_NOOF_CONTROLLER];
/* Used to store swPduHandle passed by CanIf */
static PduIdType CanSwObjectHandleCore5[CAN_17_MCMCAN_CORE5_NOOF_CONTROLLER * \
     CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE];

