liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
#define CAN_17_MCMCAN_START_SEC_CODE_QM_GLOBAL
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
   guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
    without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"

/*******************************************************************************
** Traceability   : [cover parentID={1720B00B-1498-4297-8799-1D5E2027A61A}]   **
**                    [cover parentID={196A1432-EAB1-461a-BD6C-259784BF6397}] **
**                                                                            **
**  Syntax           : void Can_17_McmCan_Init                                **
**                    (                                                       **
**                      const Can_17_McmCan_ConfigType* const Config          **
**                    )                                                       **
**                                                                            **
**  Description      : Driver Module Initialization function                  **
**                    * This function initializes:                            **
**                    * Static variables, including flags                     **
**                    * CAN HW Unit global hardware settings                  **
**                    * Controller specific settings for each CAN Controller  **
**  All CAN Controllers will be in state CANIF_CS_STOPPED after initialization**
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x00                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters(in)   : Config - Pointer to all cores CAN driver configuration **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_Init(const Can_17_McmCan_ConfigType* const Config)
{
  uint8 CoreIndex;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;
  Std_ReturnType ApiStatus;

  #if ((CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_OFF)&& \
    (CAN_17_MCMCAN_MASTER_CORE_ALLOCATION == STD_ON))
  ApiStatus = E_OK;
  #endif

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={062510C8-FDBF-4251-9197-125FE758220C}]
  [/cover] */
  #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* [cover parentID={CF54DB20-E407-4ec6-863C-107A31F6E3FD}]
  [/cover] */
  /* Do the initialization DET checks */
  ApiStatus = Can_17_McmCan_lInitDetCheck(Config, CoreIndex);
  /* Check all DET is passed */
  /* [cover parentID={9438B1D7-5A49-4b5c-A516-070F22851D4E}]
  Check all DET is passed
  [/cover] */
  if (E_NOT_OK != ApiStatus)
  #endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
  /* [cover parentID={E9841F16-4DE5-48d3-8BA8-3DFEA3C6A1BC}]
  Is it Master Core
  [/cover] */
    if(MCAL_MASTER_COREID == CoreIndex)
    {
      /* Core copy of the master configuration structure */
      Can_17_McmCan_kGblConfigPtr = Config;
      /* Global Initialization Function */
      /* [cover parentID={365D29BD-D7A0-4171-A75D-98441782984B}]
     [/cover] */
      /* [cover parentID={70B9C2F0-4AE1-4940-B3BF-BDFA369B5330}]
      [/cover] */
      ApiStatus = Can_17_McmCan_lGlobalInit(Config);
    }
    #if (CAN_17_MCMCAN_MASTER_CORE_ALLOCATION == STD_OFF)
    else
    #else
  /* [cover parentID={385BB402-BB7C-4728-B54E-62D6C1ABB764}]
  CAN resources is allocated to the master core
  [/cover] */
    if(E_NOT_OK != ApiStatus)
    #endif
    {
      /* Extract the global core state variable */
      CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
      /* Core specific configuration structure extracted */
      CanConfig = Config->CanCoreConfigPtr[CoreIndex];
      /* [cover parentID={AA5CE85F-0158-4c85-80EB-B27C0E43E9D8}]
      [/cover] */
      /* Call core specific Initialization function */
      ApiStatus = Can_17_McmCan_lCoreInit(CanConfig,CanCoreState);
    }
  }
  /* [cover parentID= {42075D10-4075-4c99-BF15-2909396B7001}]
  If all the initial settings are done successfully
  [/cover] */
  /* Check all the initial settings are done successfully */
  if(E_NOT_OK != ApiStatus)
  {
    /* Set with Driver status as READY*/
    Mcal_SetBitAtomic( (sint32*)(void*)&Can_17_McmCan_InitStatus, \
      (sint32) (CoreIndex*CAN_17_MCMCAN_INIT_STATUS_SIZE), \
      CAN_17_MCMCAN_INIT_STATUS_SIZE,(uint32) (CAN_17_MCMCAN_READY) );
  }
  /* [cover parentID=  {58C2AD10-4E15-4607-B445-870A8E9B1F66}]
  [/cover] */
}
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
/******************************************************************************
** Traceability   : [cover parentID=]                                        **
**                                                                           **
** Syntax           : Std_ReturnType Can_17_McmCan_CheckBaudrate             **
**                    (                                                      **
**                      const uint8 Controller,                              **
**                      const uint16 Baudrate                                **
**                    )                                                      **
**                                                                           **
** Description      : Checks CAN Controller Baudrate                         **
** [/cover]                                                                  **
**                                                                           **
** Service ID       : 0x0e                                                   **
**                                                                           **
** Sync/Async       : Synchronous                                            **
**                                                                           **
** Reentrancy       : Reentrant                                              **
**                                                                           **
** Parameters (in)  : Controller - Associated CAN Controller                 **
**                    Baudrate -  Baudrate to be checked                     **
**                                                                           **
** Parameters (out) : none                                                   **
**                                                                           **
** Return value     : E_OK/E_NOT_OK                                          **
**                                                                           **
******************************************************************************/
Std_ReturnType Can_17_McmCan_CheckBaudrate( const uint8 Controller, \
                                                   const uint16 Baudrate )
{
  /* return value variable */
  Std_ReturnType ApiStatus;
  /* Offset for the end index of the baud rate configurations */
  uint16 EndBaudrateCfgIndx;
  /* start index of the baudrate configuration for this controller */
  uint16 StartBaudrateCfgIndx;
  /* Condition to break the while loop */
  uint8 LoopBreak;
  /* calling core index */
  uint8 CoreIndex;
  /* controller index counter */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;

  /* Set with Value ZERO */
  LoopBreak = CAN_17_MCMCAN_ZERO;
  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={D186055C-2A14-4cb0-807C-AD0F41D3B1C8}]
  [/cover] */
  /* [cover parentID={FD38CAC0-3C12-45c0-A196-36A9B59A36C9}]
  [/cover] */
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)

  /* [cover parentID={C7E22275-4959-4b97-829D-5989A492D844}]
  [/cover] */
  /* Check if status is initilaized */
  ApiStatus = Can_17_McmCan_lDetUninitConfig(CAN_17_MCMCAN_SID_CHECKBAUDRATE,\
  CoreIndex);
  /* [cover parentID={7EA31E31-610D-4c99-AE2E-C13DE62B0DD4}]
  Check if status is initilaized
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    /* Check the requested controllerId is Valid or not */
    /* [cover parentID={282ACAB9-14A6-4054-A4C4-6FD3A7576464}]
  [/cover] */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_CHECKBAUDRATE);
  }
  /* [cover parentID={5149A284-26BF-41e5-8066-942958454C43}]
    If status OK
    [/cover] */
  if(E_NOT_OK != ApiStatus)
  #else
  /* Initialize the local state variable */
  ApiStatus = E_OK;
  #endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Retrieve the kernel index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;

    /* Set Start index */
    StartBaudrateCfgIndx = \
      CanConfig->CanControllerConfigPtr[ContIndx].CanBaudrateCfgIndx;
    /* Set with Total no of baudrate index */
    EndBaudrateCfgIndx = \
      CanConfig->CanControllerConfigPtr[ContIndx].CanNoOfBaudrateCfg;
    while((EndBaudrateCfgIndx > CAN_17_MCMCAN_ZERO) &&(LoopBreak == \
    CAN_17_MCMCAN_ZERO))
    {
      /* Check if requested baudrate is supported by the controller*/
      /* [cover parentID={B0D9E5F9-6573-4ba7-91A6-8082521508A8}]
    Check if requested baudrate is supported by the controller
    [/cover] */
      if(Baudrate == \
          CanConfig->CanBaudrateConfigPtr[StartBaudrateCfgIndx].CanBaudrateCfg)
      {
        LoopBreak = CAN_17_MCMCAN_ONE;
      }
      else
      {
        /* point to next baud-rate configuration */
        StartBaudrateCfgIndx++;
      }
      /* Decrement the configuration count */
      EndBaudrateCfgIndx--;
    }
    /* [cover parentID={FA6C8D15-9905-411c-ACB5-6F788EA45462}]
       Check Loop break Status
      [/cover] */
    /* Check Loop break Status */
    if(LoopBreak == CAN_17_MCMCAN_ZERO)
    {
      #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)

      /* [cover parentID={A73459B0-A3CC-4fb0-8CF2-845E5128947F}]
      [/cover] */
      /* Report invalid baudrate to DET */
      /* [cover parentID={43C1F68D-897E-419a-9B82-CBCA7A45B834}]
      [/cover] */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
        CAN_17_MCMCAN_SID_CHECKBAUDRATE, CAN_17_MCMCAN_E_PARAM_BAUDRATE);
      #endif

      /* Set as not supported */
      /* [cover parentID={2CEB2679-6FEC-4607-B876-896572E1DAA0}]
      [/cover] */
      ApiStatus = E_NOT_OK;
    }
  }

  /* [cover parentID={F1C21B5D-12C0-4efc-8F2F-97530C6E7011}]
  [/cover] */
  return ApiStatus;
}

