liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
** Traceability   : [cover parentID={56D0417E-7E0D-4304-A6C8-90C6613023D9}]   **
**                    [cover parentID={F642EA72-9EA3-4c90-A08B-07B0477EF852}] **
**                                                                            **
**  Syntax           : Std_ReturnType Can_17_McmCan_SetBaudrate               **
**                    (                                                       **
**                     const uint8 Controller,                                **
**                     const uint16 BaudRateConfigID                          **
**                    )                                                       **
**                                                                            **
**  Description      : This service shall set the baud rate configuration of  **
**                    the CAN controller.                                     **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x0f                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                    BaudRateConfigID - References a baud rate configuration **
**                    by ID                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
Std_ReturnType Can_17_McmCan_SetBaudrate(const uint8 Controller, \
                                                const uint16 BaudRateConfigID)
{
  /* return value variable */
  Std_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* controller index counter */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* [cover parentID={F198BB9F-E919-417e-981B-AAC1306B8793}]
  DET is enabled
  [/cover] */

  /* [cover parentID={A38611DD-E2C1-4901-8712-9DE70BA7A92F}]
  [/cover] */
  ApiStatus = Can_17_McmCan_lDetUninitConfig(CAN_17_MCMCAN_SID_SETBAUDRATE,\
  CoreIndex);
  if(E_NOT_OK != ApiStatus)
  {

    /* [cover parentID={CB0C342F-BD1C-41da-80EB-BAD62381F003}]
    [/cover] */
    /* Check the requested controllerId is Valid or not */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_SETBAUDRATE);
  }
  /* [cover parentID={D9EA81AD-42D5-42f1-A3EC-3683071A1DBB}]
    CAN driver state validity return value
    [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    /* Retrieve the controller index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;
    /* Check if baudrate is supported/configured */
/* [cover parentID={832137E8-E200-46db-94F9-DA2575D59A18}]
    Baudrate config ID validity
    [/cover] */
    if(BaudRateConfigID >= Can_17_McmCan_kGblConfigPtr-> \
      CanCoreConfigPtr[CoreIndex]-> \
      CanControllerConfigPtr[ContIndx].CanNoOfBaudrateCfg)
    {
      /* [cover parentID={A62338AA-1D66-476f-974B-C7D1480CDC74}]
      Det error CAN_17_MCMCAN_E_PARAM_BAUDRATE
      [/cover] */

      /* Report invalid baudrate to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_SETBAUDRATE, CAN_17_MCMCAN_E_PARAM_BAUDRATE);
      /* Set return value with NOT_OK */
      ApiStatus = E_NOT_OK;
    }
  }
  if(E_NOT_OK != ApiStatus)
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Retrieve the controller index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;
    /* [cover parentID={1A0D993A-7642-4e1f-B5F4-B13077DC2131}]
    Check Can Controller Mode
    [/cover] */
    if(CANIF_CS_STOPPED != CanCoreState->CanControllerModePtr[ContIndx])
    {
      /* Set return value with NOT_OK */
      ApiStatus = E_NOT_OK;
    }
    else
    {
      /* [cover parentID={5315F5C7-9322-4d21-86F3-278A00D47848}]
      Set Baud rate of requested controller
      [/cover] */
      /* Set Baudrate of requested controller */
      ApiStatus = \
        Can_17_McmCan_lSetBaudrate(ContIndx,BaudRateConfigID,CanConfig);
    }
  }

  /* [cover parentID={CEB9BCDB-B4D6-4bbb-A342-B47322AC2373}]
  Merge
  [/cover] */
  /* [cover parentID={3D4BD778-D2BE-4a68-A93C-D09E2D8B991A}]
  Merge
  [/cover] */

  /* [cover parentID={BAFDCD11-604E-4f70-90CD-02973F4FF4A0}]
  Return E_NOT_OK
  [/cover] */
  return ApiStatus;
}
#endif

/*******************************************************************************
** Traceability   : [cover parentID={10315407-9F74-45ef-AC03-36E1505C5B44}]   **
**                                                                            **
**  Syntax           : Can_ReturnType Can_17_McmCan_SetControllerMode         **
**                    (                                                       **
**                      const uint8 Controller,                               **
**                      const Can_StateTransitionType Transition              **
**                    )                                                       **
**                                                                            **
**  Description      : Performs software triggered state transitions of the   **
**                    CAN Controller State machine                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x03                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                    Transition - Requested transition                       **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : CAN_OK/CAN_NOT_OK                                      **
**                                                                            **
*******************************************************************************/
Can_ReturnType Can_17_McmCan_SetControllerMode(const uint8 Controller, \
                                    const Can_StateTransitionType Transition)
{

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Det check status */
  Std_ReturnType DetStatus;
  #endif /*   #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

