liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* return value variable */
  Can_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={821ED450-4890-4928-9090-EFE686932D7E} ]
  [/cover] */
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Initialize the return value */
  ApiStatus = CAN_OK;
  /* Check if status is initilaized */
  /* [cover parentID={3FE88B0C-772C-46ee-87AC-94B85C095401}]
  If status is OK
  [/cover] */
  DetStatus = \
     Can_17_McmCan_lDetUninitConfig(CAN_17_MCMCAN_SID_SETCONTROLLERMODE,\
     CoreIndex);
  /* [cover parentID={F38CB961-6522-481d-A821-EB9EF81360FA}]
  If status is OK
  [/cover] */

  if(E_NOT_OK != DetStatus)
  {
    /* Check the requested controllerId is Valid or not */
    /* [cover parentID={803E0AD4-7434-4572-AF72-1CBACBD675CF}]
  If status is OK
  [/cover] */
    DetStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_SETCONTROLLERMODE);
  }
  /* [cover parentID={559A1581-72F9-42c0-BBDE-9E79B2B2AEB4}]
  If status is OK
  [/cover] */
  if(E_NOT_OK != DetStatus)
  {
    /* Check if requested state transition is valid */
    DetStatus = Can_17_McmCan_lModeDetCheck(Can_17_McmCan_kGblConfigPtr-> \
    CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex,Transition, \
                       Can_17_McmCan_GblCoreState[CoreIndex]);
  }
  /* [cover parentID={52252E66-3284-4924-84EA-F9DB982C1B71}]
  If status is OK
  [/cover] */

  if(E_OK != DetStatus)
  {
    ApiStatus = CAN_NOT_OK;
  }
  /* [cover parentID={259AD625-9E64-4406-BEE2-9AB9C820208E}]
  If status is OK
  [/cover] */
  if(CAN_NOT_OK != ApiStatus)
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Retrieve the controller index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;
    /* Perform state transition If Wakeup is Disabled */
    ApiStatus = Can_17_McmCan_lSetModeWuSupportOff(ContIndx,Transition,
                                              CanCoreState,CanConfig);
    /* Check The Hw Register is set properly with requested State */
    /* [cover parentID={902AB1F9-A872-4db0-8FA1-8B253B54061B}]
    If status is OK
    [/cover] */
    if( CAN_OK == ApiStatus)
    {
      /* Notify successful state transition to upper layer */
      CanIf_ControllerModeIndication(Controller,
              CanCoreState->CanControllerModePtr[ContIndx]);
    }
  }
  /* [cover parentID={4E86AD1C-4F26-4fd5-8EFA-ACBA57DF3C91}]
  Return
  [/cover] */
  /* return Api status */
  return ApiStatus;
}

/*******************************************************************************
** Traceability   : [cover parentID={88889393-8A52-4a81-98E6-A7FF930AC5F0}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_DisableControllerInterrupts         **
**                    (                                                       **
**                      const uint8 Controller                                **
**                    )                                                       **
**                                                                            **
**  Description      : Disables CAN Controller all Interrupts                 **
**                                                                            **
**  Service ID       : 0x04                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_DisableControllerInterrupts(const uint8 Controller)
{

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Det check status */
  Std_ReturnType ApiStatus;
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* [cover parentID={C8563E01-AACB-4ffe-B54C-110D5FD7D7FB}]
  DET is enabled
  [/cover] */
  /* Check if status is initilaized */
  ApiStatus = Can_17_McmCan_lDetUninitConfig( \
    CAN_17_MCMCAN_SID_DISABLECONTROLLERINTERRUPTS, CoreIndex);
     /* [cover parentID={A213EC1C-7237-4112-BB1C-11D56EF1C794}]
    if status ok
    [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    /* [cover parentID={C8BADA98-6FC9-49de-B61C-9EEF1AC324B6}]
    Check requested controller is valid
    [/cover] */
    /* Check if requested Controller is valid */
    /* [cover parentID={19E68920-CE83-4a93-B207-1C6CF6A7BEB5}]
    [/cover] */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_DISABLECONTROLLERINTERRUPTS);
  }
  /* [cover parentID={EDF457F7-0A35-4206-A16D-AB2EE6656214}]
  Controller validity return value
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Retrieve the controller index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;

    /* Disable controller interrupts */
    Can_17_McmCan_lDisableInterrupts(ContIndx, CanConfig, CanCoreState);
  }
  /* [cover parentID={FA8016DA-C19C-445d-AB73-2C5FBAD88044}]
  Merge
  [/cover] */
}

