liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
** Traceability   : [cover parentID={62DE3D9D-C847-4f77-B002-0EC887A129AB}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_EnableControllerInterrupts          **
**                    (                                                       **
**                      const uint8 Controller                                **
**                    )                                                       **
**                                                                            **
**  Description      : Enable CAN Controller all Interrupts                   **
**                                                                            **
**  Service ID       : 0x05                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_EnableControllerInterrupts(const uint8 Controller)
{

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Det check status */
  Std_ReturnType ApiStatus;
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={ADCCC99D-104C-413e-A4A7-F83EAD748A14}]
  [/cover] */
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* [cover parentID={BFAB4B15-FC23-4043-A1CC-3028D65120E4}]
  [/cover] */
  ApiStatus = Can_17_McmCan_lDetUninitConfig( \
    CAN_17_MCMCAN_SID_ENABLECONTROLLERINTERRUPTS, CoreIndex);
     /* [cover parentID={A69F5DC2-D3AF-4f9f-AD54-25854B5F177D}]
  if status ok
  [/cover] */

  if(E_NOT_OK != ApiStatus)
  {
    /* [cover parentID={920BFF81-A655-4e2d-ADF6-0223524D241A}]
    [/cover] */
    /* Check if requested Controller is valid */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_ENABLECONTROLLERINTERRUPTS);
  }
  /* [cover parentID={CBA1EB3E-CF16-4216-BFDD-E98DED68884F}]
  Controller validity return value
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Retrieve the controller index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;
    /* Enable Controller Interrupts */
    Can_17_McmCan_lEnableInterrupts(ContIndx, CanConfig, CanCoreState);
  }
  /* [cover parentID={1D8D8E21-E76D-43e6-95C5-6F15FA346884}]
  End
  [/cover] */
}

/*******************************************************************************
** Traceability   : [cover parentID={CFC67599-E6B0-4ecd-9618-5CF8729B0119}]   **
**                                                                            **
**  Syntax           : Can_ReturnType Can_17_McmCan_Write                     **
**                    (                                                       **
**                      const Can_HwHandleType Hth,                           **
**                      const Can_PduType* const PduInfo                      **
**                    )                                                       **
**                                                                            **
**  Description      : Service to transmit CAN frame                          **
**                                                                            **
**  Service ID       : 0x06                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant(thread-safe)                                 **
**                                                                            **
**  Parameters (in)  : Hth - Hardware Transmit Handler                        **
**                    PduInfo - Pointer to SDU user memory, DLC and           **
**                                                            Identifier      **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : CAN_OK/CAN_BUSY/CAN_NOT_OK                             **
**                                                                            **
*******************************************************************************/
Can_ReturnType Can_17_McmCan_Write(const Can_HwHandleType Hth,
                                        const Can_PduType* const PduInfo )
{

