liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  Can_HwHandleType HthIndex;
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Det check status */
  Std_ReturnType DetStatus;
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

  /* Return value */
  Can_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={669C3608-B3D7-46e4-B0CF-03172B27DBA2}]
  DET is enabled
  [/cover] */
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Check if status is initilaized */
/* [cover parentID={59F909E8-43A1-4e05-97B1-32292623FBB5}]
  [/cover] */
  DetStatus = Can_17_McmCan_lDetUninitConfig(CAN_17_MCMCAN_SID_WRITE,CoreIndex);
  /* [cover parentID= {21AC1D8B-EDDA-46a9-8274-57D84FB89D2B}]
  CAN driver state validity return value
  [/cover] */
  if(E_NOT_OK != DetStatus)
  {
    /* Check for DET */
    /* [cover parentID={0F940541-3270-469e-B139-296203E6E2DD}]
    [/cover] */
    /* [cover parentID={01C0A3ED-D171-4cb6-BC94-7C206F04B658}]
    [/cover] */
    DetStatus = Can_17_McmCan_lWriteDetCheck(Hth, PduInfo, \
                            Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr\
                            [CoreIndex]);
  }
  /* [cover parentID={A79E8D0E-23BE-4e0a-906F-1B1E71AF48EB}]
  Return value of CAN Pdu and Hth chack against CAN config
  [/cover] */
  if (E_OK != DetStatus)
  {
    /* Request with invalid input ,Set return value with E_NOT_OK */
    ApiStatus = CAN_NOT_OK;
  }
  else
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Extract HTH index for accessing corresponding configuration */
    HthIndex = Can_17_McmCan_kGblConfigPtr-> \
      CanHthIndexPtr[Hth - (Can_17_McmCan_kGblConfigPtr->CanNoOfHrh)].\
      CanHthCoreSpecIndex;
    /* Call function for write message into Tx buffer and request for
    Transmission */
    ApiStatus = Can_17_McmCan_lWriteMsgObj(HthIndex,PduInfo,CanCoreState,\
    CanConfig);
  }


  /* [cover parentID={B161C701-918C-4c4b-BF4C-3CC4AC6B175A}]
  Return
  [/cover] */
  return ApiStatus;
}

/*******************************************************************************
            Scheduled functions
*******************************************************************************/
/* [cover parentID={809BFB2C-E302-45b1-8B4A-881B00FC5C7E}]
[/cover] */
#if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_OFF)
/*******************************************************************************
** Traceability   : [cover parentID={0DFEBF6A-E273-4601-ABA3-0FD3C5635523}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_MainFunction_Write                  **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
**  Description      : This function performs the polling of TX confirmation  **
**                    when CAN_TX_PROCESSING is set to POLLING                **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x01                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_MainFunction_Write( void )
{
  /* [cover parentID={F9B21214-AA72-4f21-8B95-878CA54AFC31}]
  Tx Polling Process is Enabled
  [/cover] */
  #if(CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)

  /* Det check status */
  Std_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 CtrlIndex;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={9620144A-4BA4-458c-A9FD-09C720111CBA}]
  [/cover] */
  /* Check if status is initilaized */
  ApiStatus = \
    Can_17_McmCan_lMainDetUninitConfig(CAN_17_MCMCAN_SID_MAINFUNCTIONWRITE, \
    CoreIndex);
/* [cover parentID={B9CB4235-6229-4d60-B124-6703ABC6C513}]
  If status is Ok
  [/cover] */
  if(E_OK == ApiStatus)
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Call transmit handler function for each of the CAN controllers
    configured as POLLING mode for transmission successful event handling */
    for(CtrlIndex = CAN_17_MCMCAN_ZERO;CtrlIndex < CanConfig->CanCoreContCnt; \
    CtrlIndex++)
    {
      /* [cover parentID={64AC5815-F17B-4ca1-B5FD-E89F51EF99DF}]
      Requested controller transmit event handling is of polling type
      and the controller mode is STARTED
      [/cover] */
      /* Check the Tx processing is configured as POLLING */
      if((CAN_17_MCMCAN_POLLING == \
       CanConfig->CanEventHandlingConfigPtr[CtrlIndex].CanEventType \
       [CAN_17_MCMCAN_ZERO]) \
       && (CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CtrlIndex]))
      {
        /* [cover parentID={CAD339A2-658C-4155-96B9-AAB45420B169}]
        Invoke Transmit Handler
        [/cover] */
        /* [cover parentID={214D632C-55DF-4d73-9AC6-3350D140EEBB}]
        Invoke Transmit Handler
        [/cover] */

        if(NULL_PTR != CanConfig->CanTxHwObjectConfigPtr)
        {
          /* Invoke internal function to process transmit confirmation */
          Can_17_McmCan_lTxEventHandler(CtrlIndex,CanCoreState,CanConfig);
        }
      }
    }
  }
  #endif  /* #if(CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON) */

