liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
}
#endif /* #if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_OFF) */

/* [cover parentID={A2266E18-95A8-4ad5-9E3D-670D9F3BB95F}]
[/cover] */
#if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_OFF)
/*******************************************************************************
** Traceability   : [cover parentID={4DF70F32-AF8B-4771-8288-7B236390D1C3}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_MainFunction_Read                   **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
**  Description      : This function performs the polling of RX indication    **
**                    when CAN_RX_PROCESSING is set to POLLING                **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x08                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_MainFunction_Read( void )
{
/* [cover parentID={A74C3ECF-0359-4bc0-A66E-095DB8FF4570}]
Rx Polling Process is Enabled
[/cover] */
#if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)

  /* Det check status */
  Std_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 CtrlIndex;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* Check if status is initilaized */
  /* [cover parentID={400B50C4-D748-462a-AB38-3389AE8A0108}]
[/cover] */
  ApiStatus = Can_17_McmCan_lMainDetUninitConfig(  \
  CAN_17_MCMCAN_SID_MAINFUNCTIONREAD,CoreIndex);
    /* [cover parentID={59028030-EDEC-4e3f-A516-5BD3CB012AD0}]
        CAN driver state validity return value
        [/cover] */
  if(E_OK == ApiStatus)
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Call transmit handler function for each of the CAN controllers
     configured as POLLING mode for transmission successful event handling */
    for(CtrlIndex = CAN_17_MCMCAN_ZERO;CtrlIndex < CanConfig->CanCoreContCnt; \
        CtrlIndex++)
    {
        /* [cover parentID={D4F9DE02-7644-43b3-A022-B65E05081A04}]
        Requested controller receive event handling is of polling type and
        the controller mode is STARTED
        [/cover] */
        /* Check the Rx processing is configured as POLLING */
        if((CAN_17_MCMCAN_POLLING == \
        CanConfig->CanEventHandlingConfigPtr[CtrlIndex]. \
        CanEventType[CAN_17_MCMCAN_ONE]) \
        && (CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CtrlIndex]))
        {
          /* [cover parentID={B6EC69B6-2A59-4489-9B93-0EFEEE65D9C0}]
          Invoke Receive Handler
          [/cover] */
          /* Invoke internal function to process recieve confirmation */
          Can_17_McmCan_lReceiveHandler(CtrlIndex,CAN_17_MCMCAN_ZERO, \
          CanCoreState,CanConfig);
        }
    }
  }

#endif  /* #if(CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON) */
  /* [cover parentID={CE488F2F-F189-447d-9D1F-1C6737067BFA}]
  [/cover] */
 /* [cover parentID={3C597AFE-641B-4faf-9A93-B4FD81C2BF09}]
    [/cover] */
}
#endif /* #if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_OFF) */

/*******************************************************************************
**                                                                            **
** Traceability   : [cover parentID={6E7658DE-1E4B-4468-97D1-869C21AB0495}]   **
**  Syntax           : void Can_17_McmCan_MainFunction_BusOff                 **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
**  Description      : This function performs the polling of bus-off events   **
**                    that are configured statically as 'to be polled'        **
**                                                                            **
**  Service ID       : 0x09                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_MainFunction_BusOff(void)
{

