liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#if(CAN_17_MCMCAN_BO_POLLING_PROCESSING == STD_ON)

  /* Det check status */
  Std_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 CtrlIndex;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={EEDF2035-D93E-42e7-925F-8E326D2F5E1D}]
  [/cover] */
  /* Check if status is initilaized */
  ApiStatus = Can_17_McmCan_lMainDetUninitConfig( \
              CAN_17_MCMCAN_SID_MAINFUNCTIONBUSOFF, \
              CoreIndex);

  if(E_OK == ApiStatus)
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Call bus-off handler function for each of the CAN controllers
    configured as POLLING mode for bus-off event handling */
    for(CtrlIndex = CAN_17_MCMCAN_ZERO;CtrlIndex < CanConfig->CanCoreContCnt; \
            CtrlIndex++)
    {
      /* [cover parentID={B735E851-C542-4855-8618-2162C8222243}]
      Bus Off Polling Process is Enabled
      [/cover] */
      /* [cover parentID={9186D66E-F8BC-4552-8670-4CEC4AB50F09}]
      Requested controller bus off event handling is of polling type
      [/cover] */
      /* Check the BusOff processing mode as Polling */
      if(CAN_17_MCMCAN_POLLING == CanConfig-> \
        CanEventHandlingConfigPtr[CtrlIndex].CanEventType[CAN_17_MCMCAN_TWO])
      {
        #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
        if((TRUE != CanCoreState->CanIcomEnableStatusPtr[CtrlIndex])|| \
           (FALSE != CanCoreState->CanIcomConfgBOStatusPtr[CtrlIndex]))
        {
          /* [cover parentID={7C472617-CF79-4a95-AEB7-8ECD7E351F63}]
          CAN driver state validity return value
          [/cover] */
          /* Invoke Bus-Off Handler */
          Can_17_McmCan_lBusOffHandler(CtrlIndex,CanCoreState,CanConfig);
        }
        #else
        /* [cover parentID={7C472617-CF79-4a95-AEB7-8ECD7E351F63}]
        CAN driver state validity return value
        [/cover] */
        /* Invoke Bus-Off Handler */
        Can_17_McmCan_lBusOffHandler(CtrlIndex,CanCoreState,CanConfig);
        #endif
      }
    }
  }
/* [cover parentID={3780E7F2-F932-46a9-B40B-A12FA86C2673}]
[/cover] */
#endif /* #if(CAN_17_MCMCAN_BO_POLLING_PROCESSING == STD_ON) */

}

/*******************************************************************************
** Traceability   : [cover parentID={185859A3-F84D-408d-88DB-0D4A648E8849}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_MainFunction_Wakeup                 **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
**  Description      : This function performs the polling of wake-up events   **
**                    that are configured statically as 'to be polled'        **
**                                                                            **
**  Service ID       : 0x0A                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_MainFunction_Wakeup(void)
{
/* [cover parentID={2466E081-CEB3-4c01-B071-1D65E3DF9782}]
Wake Up Polling Process is Enabled
[/cover] */
#if((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON))

      /* Det check status */
  Std_ReturnType ApiStatus;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 CtrlIndex;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={6125D0DC-2FDD-4991-A2E4-12E731FFA668}]
  Check if status is initilaized
  [/cover] */
  ApiStatus = Can_17_McmCan_lMainDetUninitConfig( \
  CAN_17_MCMCAN_SID_MAINFUNCTIONWAKEUP,CoreIndex);
  /* [cover parentID={D819E02B-E79C-4576-B9D5-79398475ADE6}]
  CAN driver state validity return value
  [/cover] */
  if(E_OK == ApiStatus)
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Call wakeup handler function for each of the CAN controllers
    configured as POLLING mode for wakeup event handling */
    for(CtrlIndex = CAN_17_MCMCAN_ZERO;CtrlIndex < CanConfig->CanCoreContCnt; \
            CtrlIndex++)
    {
      /* [cover parentID={7A953952-FFF4-4ea7-8068-05D4964FF7B2}]
      [/cover] */
      /* Check if the controller is activated with PN mode */
      if((CAN_17_MCMCAN_POLLING == \
      CanConfig->CanEventHandlingConfigPtr[CtrlIndex].CanEventType \
      [CAN_17_MCMCAN_THREE]) \
      && (TRUE == CanCoreState->CanIcomEnableStatusPtr[CtrlIndex]))
      {
       /* Invoke function for check the receive message wakeup events */
       Can_17_McmCan_lReceiveHandler(CtrlIndex,CAN_17_MCMCAN_ZERO, \
        CanCoreState, CanConfig);
      }
    }
  }
#endif /* #if((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)) */

