liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
}

/*******************************************************************************
** Traceability   : [cover parentID={2A250146-E646-440d-868C-6AA4892FCD9E}]   **
**  Syntax           : void Can_17_McmCan_MainFunction_Mode                   **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
**  Description      : This function performs the polling of CAN Controller   **
**                    mode transitions                                        **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x0C                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_MainFunction_Mode(void)
{
  /* The mode indication */
}

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* [cover parentID={FC11D271-8E0A-4c0c-B069-BF3771D2B5E4}]
Can_17_McmCan_SetIcomConfiguration
[/cover] */
/*******************************************************************************
** Traceability   : [cover parentID={B6D12824-46DD-40e0-9479-46512A0EC7D1}]   **
**                                                                            **
**  Syntax           : Std_ReturnType Can_17_McmCan_SetIcomConfiguration      **
**                   (                                                        **
**                     const uint8 Controller,                                **
**                     const IcomConfigIdType ConfigurationId                 **
**                   )                                                        **
**                                                                            **
**  Description      : This service shall change the Icom Configuration of a  **
**                    CAN controller to the requested one.                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x10                                                   **
**                                                                            **
**  Sync/Async       : Asynchronous                                           **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                    ConfigurationId  - Requested Configuration              **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
Std_ReturnType Can_17_McmCan_SetIcomConfiguration (const uint8 Controller, \
                                    const IcomConfigIdType ConfigurationId)
{
  /* Det check status */
  Std_ReturnType ApiStatus;
  /* Icom error variable */
  IcomSwitch_ErrorType IcomError;
  /* calling core index */
  uint8 CoreIndex;
  /* Core specific controller index */
  uint8 ContIndx;
  /* core specifc configuration */
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* core specifc global variable structure */
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;

  /* [cover parentID={C449A2F4-7C94-4b2e-8139-812F8302A685}]
  [/cover] */
  #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Check if status is initilaized */
  ApiStatus = Can_17_McmCan_lDetUninitConfig( \
  CAN_17_MCMCAN_SID_SETICOMCONFIGURATION,CoreIndex);
  if(E_NOT_OK != ApiStatus)
  {
    /* Check the requested controllerId is Valid or not */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex,Controller, \
      CAN_17_MCMCAN_SID_SETICOMCONFIGURATION);
  }
  /* Check if configuration ID is valid */
  /* [cover parentID={BAF66F05-4975-445c-AD7C-10C5B469BACF}]
    Check if configuration ID is valid
    [/cover] */
  if((ConfigurationId > CAN_17_MCMCAN_NOOF_ICOM_CONFIGURATIONS)&& \
    (E_NOT_OK != ApiStatus))
  {
    /* [cover parentID={59065786-EA5E-4b5e-AD12-EC2B58EC2601}]
    Det error CAN_17_MCMCAN_E_ICOM_CONFIG_INVALID
    [/cover] */
    /* [cover parentID={AE8B3176-0F3B-4c32-9EF7-39AF041D75F5}]
    [/cover] */
    /* Report invalid  configuration ID to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
   CAN_17_MCMCAN_SID_SETICOMCONFIGURATION, CAN_17_MCMCAN_E_ICOM_CONFIG_INVALID);
    ApiStatus = E_NOT_OK;
  }
  if (E_OK == ApiStatus)
  #else
  /* Initializing ApiStatus */
  ApiStatus = E_OK;
  #endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Retrieve the kernel index offset for the core */
    ContIndx = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[Controller].CanLCoreSpecContIndex;
    /* Check the CAN controller status*/
     /* [cover parentID={3353F6BF-53BF-458b-B197-19076CAE705B}]
   Controller mode is STARTED and ICOM config pointer is not a NULL_PTR
    [/cover] */
    if ((CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[ContIndx])&& \
     (NULL_PTR != Can_17_McmCan_kGblConfigPtr->CanIcomConfigPtr))
    {
      /* [cover parentID={42EBE452-1686-4593-A7DB-DAF5AA9D9C97}]
      ICOM configuration ID passed is ZERO
      [/cover] */
      /* Check the configuration ID */
      if (CAN_17_MCMCAN_ZERO ==(uint8) ConfigurationId)
      {
        /* [cover parentID={FC1E24F4-75FC-45d9-83B5-934309C2B206}]
        Deactivate the ICOM settings
        [/cover] */
        /* De Activate ICOM settings*/
        Can_17_McmCan_lDeactivateIcom(ContIndx,ConfigurationId,CanCoreState, \
        CanConfig);
      }
      else
      {
        /* [cover parentID={CFCE76D6-AEB0-455c-AC11-70B8E42CF4F2}]
        Activate the ICOM settings
        [/cover] */
        /* Activate ICOM settings*/
        Can_17_McmCan_lActivateIcom(ContIndx,ConfigurationId,CanCoreState, \
        CanConfig);
      }
      /* [cover parentID={32A6F62D-2135-4f7c-9FB5-A200EB3C139D}]
      Set ICOM status to ICOM_SWITCH_E_OK
      [/cover] */
      /* Set IcomError as ICOM_SWITCH_E_OK */
      IcomError = ICOM_SWITCH_E_OK;
    }
    else
    {
      /* Set ApiStatus as E_NOT_OK */
      ApiStatus = E_NOT_OK;
      /* [cover parentID={67D050FB-2C63-4d4b-8E20-178756F7167C}]
      Set ICOM status as ICOM_SWITCH_E_FAILED
      [/cover] */
      /* Set IcomError as ICOM_SWITCH_E_FAILED */
      IcomError = ICOM_SWITCH_E_FAILED;
    }
    /* [cover parentID={6AF5732D-8D8D-485a-9AAC-BB4BD677B985}]
    Notify the upper layer
    [/cover] */
    /* Notify the upper layer */
    CanIf_CurrentIcomConfiguration(Controller, ConfigurationId, IcomError);
  }
  /* [cover parentID={9716C92B-C90D-4b57-908C-F6B9555BF4FA}]
  Return E_NOT_OK
  [/cover] */
  /* [cover parentID={331EE248-DACF-4c6f-9ED7-D36C4CD22D49}]
  Return
  [/cover] */
  return ApiStatus;
}
#endif

#if (CAN_17_MCMCAN_DEINIT_API == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : void Can_17_McmCan_DeInit                              **
**                    (                                                       **
**                     void                                                   **
**                    )                                                       **
**                                                                            **
**  Description      : This function for De-initializes the CAN Driver.       **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : 0x65                                                   **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : none                                                   **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_DeInit (void)
{
  Ifx_CAN *MCMBaseAddressPtr;
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_CLC DataAddress_CLC;
  /* Variable to scan across the configured kernel set  */
  uint8 KernelIndx;
  uint8 CoreIndex;
  #if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
  /* Expected Initialization variable status in master core */
  uint32 ExpInitStatus;
  #endif /* #if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;

  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  Std_ReturnType Status;
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
/* [cover parentID={3D624900-890B-4ed6-ACA8-836B7DFE335B}]
    [/cover] */
  #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
  /* Check if CAN driver is initialized */
/* [cover parentID={7ABFA6CF-0E88-4d8d-A9E9-CCF95AC2D148}]
    [/cover] */
  Status = Can_17_McmCan_lDetUninitConfig(CAN_17_MCMCAN_SID_DEINIT,CoreIndex);
  #if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
  /* Calculation for expected Initialization variable status in master core */
  ExpInitStatus = CAN_17_MCMCAN_REG_ONE<<((uint32)MCAL_MASTER_COREID * \
    (uint32)CAN_17_MCMCAN_INIT_STATUS_SIZE);
  /* Master core deinit called only after slave core deinit */
  /* [cover parentID={4AA986F4-1A5F-4e3d-8453-223BBD493C10}]
  if the CAN is configured in the core
    [/cover] */
  if((E_NOT_OK != Status) && (MCAL_MASTER_COREID == CoreIndex) && \
    (Can_17_McmCan_InitStatus != ExpInitStatus))
  {
    /* Transition error */
    /* [cover parentID={9D5E628C-2B95-45b1-9A6F-6CB7CD04563E}]
    [/cover] */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
      CAN_17_MCMCAN_SID_DEINIT, CAN_17_MCMCAN_E_SLAVE_CORE_INIT);
    /* return function call not sucessful*/
    Status = E_NOT_OK;
  }
  #endif /* #if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */
  /* [cover parentID={90C3F49A-0148-4af1-B324-51D70A20FF66}]
  if status is ok
    [/cover] */
  if (E_NOT_OK != Status)
  #endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Core specific configuration structure extracted */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Change the driver state from Initialized state */
    /* Set with Driver status as READY*/
    /* [cover parentID={2C4DC05A-1C14-4ca1-A2F1-30C5DC095E2C}]
    [/cover] */
    /* [cover parentID={813EB0F0-5F6A-4c98-AFB4-3AFA80A75353}]
    [/cover] */
    Mcal_SetBitAtomic( (sint32*)(void*)&Can_17_McmCan_InitStatus, \
      (sint32) (CoreIndex*CAN_17_MCMCAN_INIT_STATUS_SIZE), \
      CAN_17_MCMCAN_INIT_STATUS_SIZE,(uint32) (CAN_17_MCMCAN_DEINITPENDING) );
    /* Initialize all Global variable with default value */
    /* [cover parentID={367FFAD3-5C04-47d4-B9BA-52B096198AA9}]
    [/cover] */
    #if(CAN_17_MCMCAN_MASTER_CORE_ALLOCATION == STD_OFF)
    if(MCAL_MASTER_COREID != CoreIndex)
    #endif
    {
      Can_17_McmCan_lInitGlobalVar(CanConfig,CanCoreState);
    }
    /* [cover parentID={9B3923C6-8921-44f1-AE95-77B424EFA1E4}]
     If Master Core is selected
    [/cover] */
    if(MCAL_MASTER_COREID == CoreIndex)
    {
      /* [cover parentID={91B0921A-4464-40e5-9283-5F04A4B9B308}]
      [/cover] */
      for (KernelIndx = CAN_17_MCMCAN_ZERO;KernelIndx  \
       < Can_17_McmCan_kGblConfigPtr->CanNoOfKernel; \
        KernelIndx++)
      {
        /* Set with Kernel base address */
        MCMBaseAddressPtr = \
          Can_17_McmCan_kGblConfigPtr->CanMCMModuleConfigPtr[KernelIndx]. \
          CanBaseAddress;
        /* Take a copy of the resgiter values */
        DataAddress_CLC.U = MCMBaseAddressPtr->CLC.U;
        /* Set DISR bit in CLC register to Disable the CAN module  */
        DataAddress_CLC.B.DISR = CAN_17_MCMCAN_ONE;
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG( \
        (volatile void*)&(MCMBaseAddressPtr->KRSTCLR.U),CAN_17_MCMCAN_REG_ONE);
        /* [cover parentID={26139B1F-CBB2-4abb-B29F-8109B7D0CE3D}]
        [/cover] */
        /* [cover parentID={F9EBC60A-1176-42b3-BCBA-8FBF6667888D}]
        [/cover] */
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG( \
          (volatile void*)&(MCMBaseAddressPtr->KRST0.U), \
          CAN_17_MCMCAN_REG_ONE);
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG( \
          (volatile void*)&(MCMBaseAddressPtr->KRST1.U), \
          CAN_17_MCMCAN_REG_ONE);
        /* [cover parentID={E16E705C-8A0C-4f31-87B5-049A464BE0C9}]
        [/cover] */
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG( \
          (volatile void*)&(MCMBaseAddressPtr->CLC.U), \
         DataAddress_CLC.U);
      }
      Can_17_McmCan_kGblConfigPtr = NULL_PTR;
    }
    /* Set the status of the core status for CAN */
    Mcal_SetBitAtomic( (sint32*)(void*)&Can_17_McmCan_InitStatus, \
     (sint32) (CoreIndex*CAN_17_MCMCAN_INIT_STATUS_SIZE), \
     CAN_17_MCMCAN_INIT_STATUS_SIZE,(uint32) (CAN_17_MCMCAN_UNINIT) );
  }
  /* [cover parentID={FC76F5A5-D3DA-4fc3-8377-C79E8B289951}]
  [/cover] */
}
#endif

#if (CAN_17_MCMCAN_VERSION_INFO_API == STD_ON)
/* [cover parentID={7B39AE21-BE9D-41fb-8064-37A8164B1510}]
Can_17_McmCan_GetVersionInfo
[/cover] */
/*******************************************************************************
** Traceability   : [cover parentID={DFF7807D-69E0-42c4-AE95-F08E2299FC2D}]   **
**                                                                            **
** Syntax           : void Can_17_McmCan_GetVersionInfo                       **
**                    (                                                       **
**                      Std_VersionInfoType* const versioninfo                **
**                    )                                                       **
**                                                                            **
** Description      : - This function returns the version information of this **
**                      module.The version information include : Module ID,   **
**                      Vendor ID,Vendor specific version numbers             **
**                                                                            **
** Service ID       : 0x07                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (out) : versioninfo - Pointer to store the                      **
**                    version information of this module.                     **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_GetVersionInfo(Std_VersionInfoType* const versioninfo)
{

