liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON )
  /* [cover parentID={91C85D96-0FA9-4db2-99A7-1C27FD54723E}]
  DET is enabled
  [/cover] */
  /* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
  [/cover] */
  /* [cover parentID={CD74AE77-3AD8-48db-9884-410074732021}]
  [/cover] */
  if ((versioninfo) == NULL_PTR)
  {
    /* [cover parentID={07B8D0A0-8243-4145-8BBA-F3CDC1763AA6}]
    Det error CAN_17_MCMCAN_E_PARAM_POINTER
    [/cover] */
    Det_ReportError((uint16)CAN_17_MCMCAN_MODULE_ID,
                    CAN_17_MCMCAN_INSTANCE_ID,
                    CAN_17_MCMCAN_SID_GETVERSIONINFO,
                    CAN_17_MCMCAN_E_PARAM_POINTER
                   );
  }
  else
  #endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON )  */
  {

    ((Std_VersionInfoType*)(versioninfo))->moduleID = CAN_17_MCMCAN_MODULE_ID;
    ((Std_VersionInfoType*)(versioninfo))->vendorID = CAN_17_MCMCAN_VENDOR_ID;
    ((Std_VersionInfoType*)(versioninfo))->sw_major_version =
                                        (uint8)CAN_17_MCMCAN_SW_MAJOR_VERSION;
    ((Std_VersionInfoType*)(versioninfo))->sw_minor_version =
                                        (uint8)CAN_17_MCMCAN_SW_MINOR_VERSION;
    ((Std_VersionInfoType*)(versioninfo))->sw_patch_version =
                                        (uint8)CAN_17_MCMCAN_SW_PATCH_VERSION;
  }

  /* [cover parentID={CF6036C3-803C-466c-B52C-5F008AECD9F2}]
  End
  [/cover] */
}
#endif /* #if( (CAN_17_MCMCAN_VERSION_INFO_API == STD_ON) */
/*******************************************************************************
** Traceability     :                                                         **
**                                                                            **
**  Syntax           :static Std_ReturnType Can_17_McmCan_lGlobalInit         **
**                    (                                                       **
**                      const Can_17_McmCan_ConfigType* const Config          **
**                    )                                                       **
**                                                                            **
**  Description      : Master module Initialization function                  **
**                    * This function initializes:                            **
**                    * CAN HW Unit global hardware settings                  **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters(in)   : Config - Pointer to all cores CAN driver configuration **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lGlobalInit( \
  const Can_17_McmCan_ConfigType* const Config)
{
  Std_ReturnType ApiStatus;
  uint8 KerIndex;
  /* Set kernel index with zero */
  KerIndex = CAN_17_MCMCAN_ZERO;
  ApiStatus = E_NOT_OK;
  /* Initialize clock settings depends on the no of Kernels used */
  while(KerIndex < Config->CanNoOfKernel)
  {
    /* Invoke internal function for Clock Settings */
    /* [cover parentID={750CDB25-8A13-4692-BD6B-B409B5E35C25}]
  [/cover] */
    ApiStatus = Can_17_McmCan_lInitClkSetting(Config,KerIndex);
    /* [cover parentID={A5E529AC-F4BE-4ffe-BB32-A90F4DF64109}]
     Check for each kernels activation
  [/cover] */
    if(E_OK != ApiStatus)
    {
      /* Set condition for break loop */
      KerIndex = Config->CanNoOfKernel;
    }
    else
    {
      /* Increment with one */
      KerIndex = KerIndex + CAN_17_MCMCAN_ONE;
    }
  }
  return ApiStatus;
}
/*******************************************************************************
** Traceability     :                                                         **
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lCoreInit          **
**                    (                                                       **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig,  **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState      **
**                    )                                                       **
**                                                                            **
**  Description      : Configured core Initialization function                **
**                    * This function initializes:                            **
**                    * CAN core specific global variables                    **
**                    * CAN core specific controller settings                 **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters(in)   :CanConfig- Pointer to core specific CAN driver          **
**                    configuration                                           **
**                    CanCoreState - Pointer to states of respective core     **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lCoreInit( \
    const Can_17_McmCan_CoreConfigType* const CanConfig, \
    const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  Std_ReturnType ApiStatus;
  uint8 CtrlIndex;

  /* Initialize the error variable */
  ApiStatus = E_OK;

  /* Initialize all the Global variables */
  Can_17_McmCan_lInitGlobalVar(CanConfig,CanCoreState);

  /* Set controller index with zero */
  CtrlIndex = CAN_17_MCMCAN_ZERO;
  /* [cover parentID={F5B648CD-B829-4140-AFDA-9A809BA76E50}]
  [/cover] */
  /* Initialize the CAN controller */
  while((CtrlIndex < CanConfig->CanCoreContCnt)&&(E_OK == ApiStatus))
  {
    /* Invoke internal function for the CAN Controller Initialization */
    ApiStatus = Can_17_McmCan_lInitController(CtrlIndex,CanConfig,CanCoreState);
    /* Increment with one */
    CtrlIndex = CtrlIndex + CAN_17_MCMCAN_ONE;
  }
  return ApiStatus;
}
/*******************************************************************************
** Traceability   : [cover parentID={C4964D9F-B613-4e31-BA02-D38ACFE184B8}]   **
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lInitGlobalVar         **
**                    (                                                       **
**                     Can_17_McmCan_CoreStatesType* const CanCoreState       **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes global variables of CAN driver             **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : CanConfig - core specific config root structure        **
**                     CanCoreState - Pointer to global structure             **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : none                                                **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lInitGlobalVar( \
   const Can_17_McmCan_CoreConfigType* const CanConfig, \
                 const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  /* controller index count */
  uint8 CntrlIndx;
  /* SIze of the transmit message buffer */
  uint16 TxHwIndex;
  uint16 SwObjIndx;

  /* Clear interrupt status and disable count */
  for(CntrlIndx = CAN_17_MCMCAN_ZERO; CntrlIndx < CanConfig->CanCoreContCnt; \
    CntrlIndx++)
  {
    CanCoreState->CanDisableIntrpCountPtr[CntrlIndx] = CAN_17_MCMCAN_ZERO;
    CanCoreState->CanInterruptStatusPtr[CntrlIndx] = CAN_17_MCMCAN_ZERO;
    CanCoreState->CanInterruptTempStatusPtr[CntrlIndx] = CAN_17_MCMCAN_ZERO;
    CanCoreState->CanControllerModePtr[CntrlIndx] = CANIF_CS_UNINIT;
    /* Clear software PDU handle array */
    for (TxHwIndex = CAN_17_MCMCAN_ZERO; TxHwIndex < \
     CAN_17_MCMCAN_MAX_TX_BUFFER_INDEX; \
       TxHwIndex++)
    {
      /* Calculate Sw Obj Handle index */
      SwObjIndx = (uint16)((CntrlIndx * \
        CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ TxHwIndex);
      CanCoreState->CanSwObjectHandlePtr[SwObjIndx] = CAN_17_MCMCAN_ZERO;
#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
     CanCoreState->CanTxSwObjPriorityPtr[SwObjIndx] = \
        CAN_17_MCMCAN_MAX_SWOBJECT_INDEX;
#endif
    }
  }
}
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE Std_ReturnType                            **
**                             Can_17_McmCan_lInitClkSetting                  **
**                    (                                                       **
**                      const Can_17_McmCan_ConfigType* const Config,         **
**                      const uint8 KernelIndx                                **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes clock control register, fractional divider **
**                    register and module control register                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : KernelIndx: Logical core specific kernel indexing      **
**                     Config: - Pointer to CAN driver configuration          **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lInitClkSetting( \
    const Can_17_McmCan_ConfigType* const Config, \
    const uint8 KernelIndx)
{
  volatile Ifx_CAN* MCMBaseAddressPtr;
  uint32 ClockSelConfigValue;
  volatile uint32 MCRValueTemp;
  uint8 ActNodeCount;
  Std_ReturnType ApiStatus;

  /* Copy the MCMCAN module base address */
  MCMBaseAddressPtr = \
          Config-> CanMCMModuleConfigPtr[KernelIndx].CanBaseAddress;

