liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* Disable CAN kernel clock via CLC */
  /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
  pointer is used.No side effect has been seen. */
  CAN_17_MCMCAN_INIT_DEINIT_WRITE_PERIP_ENDINIT_PROTREG( \
   (volatile void*)&(MCMBaseAddressPtr->CLC), CAN_17_MCMCAN_CLK_DISABLE);

  /* check disable bit is set or not */
  /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
  pointer is used.No side effect has been seen. */
  ApiStatus = Can_17_McmCan_lTimeOut( \
     (const volatile uint32*)(&(MCMBaseAddressPtr->CLC.U)), \
     (uint32)CAN_17_MCMCAN_MODULE_DISABLE_STATUS, CAN_17_MCMCAN_NOT_EQUAL);

  /* Check Hw is set properly or not within the Time-out */
  /* [cover parentID={6AF3C846-1225-4ae9-99A8-8CB04FB865CD}]
     Hw is set properly or not within the Time-out
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    MCRValueTemp = MCMBaseAddressPtr->MCR.U;
    /* Set CLK selection value with no CLK supply */
    ClockSelConfigValue = (uint32) CAN_17_MCMCAN_ZERO;
    /* Read all the active node and set clock settings */
    for(ActNodeCount = CAN_17_MCMCAN_ZERO; ActNodeCount < \
      CAN_17_MCMCAN_NOOF_NODES_PER_KERNEL; ActNodeCount++)
    {
      /* Set with CAN node Hw index for clock set */
      if(FALSE != \
       Config->CanMCMModuleConfigPtr[KernelIndx].CanUsedHwCfgIndx[ActNodeCount])
      {
        /* Set configured module with clock selection as enable */
        ClockSelConfigValue |= CAN_17_MCMCAN_MCR_CLKSEL_SET << \
        (ActNodeCount * CAN_17_MCMCAN_TWO);
      }
    }
    MCRValueTemp |= (CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE|ClockSelConfigValue);

    /* Set MCR.CI and MCR.CCCE to enable clock selection register write
    Set Clock selection for both Sync and Sync of selected Nodes in the
    SubSystem.
    */
    MCMBaseAddressPtr->MCR.U = (Ifx_UReg_32Bit)MCRValueTemp;
    MCRValueTemp &= ~(CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE);
    /* Reset MCR.CI and MCR.CCCE to Clock Change disabled  */
    MCMBaseAddressPtr->MCR.U = MCRValueTemp;

    MCRValueTemp = MCMBaseAddressPtr->MCR.U;
    /* start RAM Initialization */
    MCMBaseAddressPtr->MCR.U |= CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE;
    /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
    pointer is used.No side effect has been seen. */
    ApiStatus = Can_17_McmCan_lTimeOut( \
      (const volatile uint32*)(&(MCMBaseAddressPtr->MCR.U)), \
      (uint32)CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE, CAN_17_MCMCAN_EQUAL);
    /*[cover parentID={6C0257D9-6084-4f36-AB46-9C10CE6E79B2}]
       Wait until CANn_MCR.RBUSY is 0b
       [/cover] */
    if(E_NOT_OK != ApiStatus)
    {
      /* Wait until CANn_MCR.RBUSY is 0b */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      ApiStatus = Can_17_McmCan_lTimeOut( \
        (const volatile uint32*)(&(MCMBaseAddressPtr->MCR.U)), \
        (uint32)CAN_17_MCMCAN_MCR_RBUSY_STATUS, CAN_17_MCMCAN_NOT_EQUAL);
      /*[cover parentID={433C9993-75E6-4c64-BE04-495AD92329A2}]
       If Status is E_OK
       [/cover] */
      if(E_NOT_OK != ApiStatus)
      {
        /* Initialize the RAM */
        MCMBaseAddressPtr->MCR.B.RINIT = CAN_17_MCMCAN_ZERO;
        MCMBaseAddressPtr->MCR.B.RINIT = CAN_17_MCMCAN_ONE;
        MCRValueTemp = MCMBaseAddressPtr->MCR.U;
        /* Wait until CANn_MCR.RBUSY is 0b */
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        ApiStatus = Can_17_McmCan_lTimeOut( \
          (const volatile uint32*)(&(MCMBaseAddressPtr->MCR.U)), \
          (uint32)CAN_17_MCMCAN_MCR_RBUSY_STATUS, CAN_17_MCMCAN_NOT_EQUAL);
        MCMBaseAddressPtr->MCR.B.RINIT = CAN_17_MCMCAN_ZERO;
        /* Finish RAM Initialization */
        MCMBaseAddressPtr->MCR.U &= ~CAN_17_MCMCAN_CLKSEL_WRITE_ENABLE;
      }
    }
  }
  return ApiStatus;
}

/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE Std_ReturnType                            **
**                     Can_17_McmCan_lInitController                          **
**                    (                                                       **
**                      const uint8 ControllerId,                             **
**                     const Can_17_McmCan_CoreConfigType* const CanConfig,   **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState      **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes CAN Controller Registers and Enables CAN   **
**                    Controller Interrupts                                   **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId: Index of core specific Controller        **
**                     CanConfig - Pointer to CAN driver configuration        **
**                     CanCoreState - Pointer to global structure             **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : none                                                **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lInitController( \
                                  const uint8 ControllerId, \
        const Can_17_McmCan_CoreConfigType* const CanConfig, \
        const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  const Can_17_McmCan_ControllerBaudrateConfigType *CanBaudratePtr;
  const volatile uint32* RegAddressPtr;
  uint16 BaudRateDefaultCfg;
  Std_ReturnType ApiStatus;
  uint8 IntLineOffset;

  IntLineOffset = CAN_17_MCMCAN_FOUR * \
       CanConfig->CanControllerConfigPtr[ControllerId].CanControllerHwId;
  ApiStatus = E_OK;
  /* Set actual Controller configuration index */
  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
          CanConfig->CanControllerConfigPtr[ControllerId].CanNodeAddress;
  /* Interrupt Line assignment for BUSOFF */
  NodeRegAddressPtr->GRINT1.B.BOFF = CAN_17_MCMCAN_TWO + IntLineOffset;
  /* Interrupt Line assignment for TxEventFIFO */
  NodeRegAddressPtr->GRINT1.B.TEFIFO = CAN_17_MCMCAN_ONE + IntLineOffset;
  /* Interrupt Line assignment for RxFIFO buffer watermark level */
  NodeRegAddressPtr->GRINT1.B.WATI = CAN_17_MCMCAN_THREE + IntLineOffset;
  /* Interrupt Line assignment for dedicated receive buffer */
  NodeRegAddressPtr->GRINT2.B.REINT = CAN_17_MCMCAN_ZERO + IntLineOffset;
  /* Check Controller in Software Initialization mode with Configuration
  Change Enable. */
  /* [cover parentID={7DC66300-8269-47a7-9F98-6A1790EEF225}]
  Check Controller in Software Initialization mode with Configuration
  Change Enable.
  [/cover] */
  if(CAN_17_MCMCAN_BIT_CLEAR_VAL == NodeRegAddressPtr->CCCR.B.INIT)
  {
    /* Set with Initialization mode */
    NodeRegAddressPtr->CCCR.B.INIT = CAN_17_MCMCAN_ONE;

