liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /* Set with Register Address */
    /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
     pointer is used.No side effect has been seen. */
    RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
    /* Wait until the INIT bits become set */
    ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*)RegAddressPtr, \
      CAN_17_MCMCAN_NODE_INIT_CCE_SET,CAN_17_MCMCAN_EQUAL);
  }
  /* Check Hw is set properly or not within the Time-out */
  /* [cover parentID={95D450C7-4431-41d6-B854-FFFF7E96C5B6}]
  Check Hw is set properly or not within the Time-out
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    /* Set Configuration Change Enable bit */
    NodeRegAddressPtr->CCCR.B.CCE = CAN_17_MCMCAN_ONE;

    /* Set with Register Address */
    /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
     pointer is used.No side effect has been seen. */
    RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
    /* Wait until the Configuration Change Enable bits become set */
    ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*)RegAddressPtr, \
      CAN_17_MCMCAN_CCCR_CCE_SET_MASK,CAN_17_MCMCAN_EQUAL);
     /*[cover parentID={76016B53-1F74-438e-9A08-6AF916FC5C18}]
         Check Hw is set properly or not within the Time-out
        [/cover] */
    if(E_NOT_OK != ApiStatus)
    {
    /* Set NPCR with the Rxinput/Loopback functionality */
    NodeRegAddressPtr->NPCR.U    = CanConfig-> \
              CanControllerConfigPtr[ControllerId].CanNPCRValue;
    /* Read Baud rate configuration Index */
    CanBaudratePtr = CanConfig->CanBaudrateConfigPtr;
    /* Select default baud rate configuration of the controller */
    BaudRateDefaultCfg = CanConfig-> \
              CanControllerConfigPtr[ControllerId].CanDefaultBRCfgIndx;
    /* Set NBTP with Nominal baud-rate */
    NodeRegAddressPtr->NBTP.U =
      CanBaudratePtr[BaudRateDefaultCfg].CanControllerBaudrate;

    #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* [cover parentID={56D0C81C-41E5-4c75-AEE1-176B5352FF46}]
    Check if the FD configuration is
    [/cover] */
    if(TRUE == CanBaudratePtr[BaudRateDefaultCfg].CanFdConfigEnabled)
    {
      /* Invoke internal function for set FD baud-rate */
      ApiStatus = Can_17_McmCan_lFDSetBaudrate(ControllerId,
               CanBaudratePtr[BaudRateDefaultCfg].CanFDIndex,CanConfig);
    }
    /* [cover parentID={E2D9AA37-4D28-46a6-9DA1-9203C2BAA72D}]
    If Status is E_OK
    [/cover] */
    if(E_NOT_OK != ApiStatus)
    #endif
    {
    /* Clear All pending Interrupts */
    NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_ALL_INTERRUPTS;
    /* [cover parentID={769C6736-DB97-4e11-B7D2-0BD181691F57}]
    Is SID Valid
    [/cover] */
    if(NULL_PTR != CanConfig->CanSIDFilterConfigPtr)
    {
      /* Invoke function to Set standard ID filter setting */
      Can_17_McmCan_lSIDFilter_Config(ControllerId,CanConfig);
    }
    /* [cover parentID={1209C71F-83EF-46e2-9D8E-CAE8D2292585}]
    Is XID Valid
    [/cover] */
    if(NULL_PTR != CanConfig->CanXIDFilterConfigPtr)
    {
      /* Invoke function to Set Extended ID filter setting */
      Can_17_McmCan_lXIDFilter_Config(ControllerId,CanConfig);
    }
    /* Receive Message RAM settings*/
    Can_17_McmCan_lInitRxMsgObj(ControllerId,CanCoreState,CanConfig);
    if(NULL_PTR != CanConfig->CanTxHwObjectConfigPtr)
    {
      /* Transmit MSG RAM Settings */
      Can_17_McmCan_lInitTxMsgObj(ControllerId,CanCoreState,CanConfig);
    }

    /* Check the BusOff processing mode and Enable BO Interrupt accordingly */
    if (CAN_17_MCMCAN_INTERRUPT == \
      CanConfig->CanEventHandlingConfigPtr[ControllerId].  \
      CanEventType[CAN_17_MCMCAN_TWO])
    {
      /* Enable BO Interrupt(Bus_Off Status Interrupt Enable)of requested
      controller */
      CanCoreState->CanInterruptStatusPtr[ControllerId] |= CAN_17_MCMCAN_ONE;
    }
   /* [cover parentID={7A66CD62-B930-477a-BC98-B30C55192E29}]
    [/cover] */
    /* Set Controller with STOP mode */
    CanCoreState->CanControllerModePtr[ControllerId] = CANIF_CS_STOPPED;

    #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)

    /* Deactivate Pretended Networking after initialization */

    /* [cover parentID={068C379F-B8E3-41aa-817F-07F3658B0148}]
    [/cover] */
    CanCoreState->CanIcomEnableStatusPtr[ControllerId] = FALSE;
    #endif

    CanCoreState->CanInterruptTempStatusPtr[ControllerId] =
            CanCoreState->CanInterruptStatusPtr[ControllerId];
  }
    }
  }
  return ApiStatus;
}
#if (CAN_17_MCMCAN_SET_BAUDRATE_API == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lSetBaudrate                 **
**                    (                                                       **
**                       const uint8 Controller,                              **
**                       const uint16 BaudrateIndx,                           **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes the Node Bit Timing Register               **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : ControllerId - CAN Controller Id                       **
**                    ControllerBaudrate - Register setting corresponding     **
**                                         to the baud-rate                   **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK/E_NOT_OK                                          **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lSetBaudrate(const uint8 Controller, \
                          const uint16 BaudrateIndx, \
            const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  uint16 StartBaudrateCfgIndx;
  uint16 ActualBaudrateIndx;
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  const Can_17_McmCan_ControllerBaudrateConfigType *CanBaudratePtr;
  Std_ReturnType ApiStatus;

  CanBaudratePtr = CanConfig->CanBaudrateConfigPtr;

  /* Get Node Register address */
  NodeRegAddressPtr = \
          CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* Set with Start index of Baudrate configuration */
  StartBaudrateCfgIndx = \
            CanConfig->CanControllerConfigPtr[Controller].CanBaudrateCfgIndx;
  /* Set with exact Baudrate config index   */
  ActualBaudrateIndx  = BaudrateIndx + StartBaudrateCfgIndx;
  /* Set NBTP with Nominal baud-rate */
  NodeRegAddressPtr->NBTP.U =
                   CanBaudratePtr[ActualBaudrateIndx].CanControllerBaudrate;

  #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* Check if the FD configuration is */
/* [cover parentID={FC860130-C9DA-430d-9630-1358E0FD206A}]
    CAN FD config Enabled
    [/cover] */
  if(TRUE == CanBaudratePtr[ActualBaudrateIndx].CanFdConfigEnabled)
  {
    /* Invoke internal function for set FD baud-rate */
    ApiStatus = Can_17_McmCan_lFDSetBaudrate(Controller, \
             CanBaudratePtr[ActualBaudrateIndx].CanFDIndex,CanConfig);
  }
  else
  {
    /* Disable FD Operation mode */
    NodeRegAddressPtr->CCCR.B.FDOE = CAN_17_MCMCAN_ZERO;

    /* Wait until the INIT bits become set */
    /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
    pointer is used.No side effect has been seen. */
    ApiStatus = Can_17_McmCan_lTimeOut( \
      (const volatile uint32*)&NodeRegAddressPtr->CCCR.U, \
      CAN_17_MCMCAN_CCCR_FDOE_STATUS,CAN_17_MCMCAN_NOT_EQUAL);
  }
  #else
  ApiStatus = E_OK;
  #endif
  return(ApiStatus);
}
#endif

#if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lFDSetBaudrate               **
**                    (                                                       **
**                       const uint8 Controller,                              **
**                       const uint16 FdIndex,                                **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes the Data Bit Timing Register               **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - CAN Controller Id                         **
**                    FdIndex - FD budrate corresponding array index          **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lFDSetBaudrate(const uint8 Controller, \
                                const uint16 FdIndex, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  Std_ReturnType ApiStatus;
  /* Get Node Register address */
  NodeRegAddressPtr = \
            CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* [cover parentID={78934EF7-E52F-4bb9-8ACA-836B12590D20}]
  [/cover] */
  /* Set DBTP with FD configuration set */
  NodeRegAddressPtr->DBTP.U = \
            CanConfig->CanFDConfigParamPtr[FdIndex].CanControllerFDBaudrate;
  /* [cover parentID={2544BBA5-38CE-4f6b-8639-9636525AD94E}]
  [/cover] */
  /*Set Transmitter Delay Compensation Register with value */
  NodeRegAddressPtr->TDCR.U =
            CanConfig->CanFDConfigParamPtr[FdIndex].CanTrcvDelyComp;
  /* [cover parentID={32EC2721-B304-407d-AFF7-447D2762F472}]
  [/cover] */
  /* Set FD Operation mode as Enabled */
  NodeRegAddressPtr->CCCR.B.FDOE = CAN_17_MCMCAN_ONE;

  /* Wait until the INIT bits become set */
  /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
  pointer is used.No side effect has been seen. */
  ApiStatus = Can_17_McmCan_lTimeOut( \
    (const volatile uint32*)&NodeRegAddressPtr->CCCR.U, \
    CAN_17_MCMCAN_CCCR_FDOE_STATUS,CAN_17_MCMCAN_EQUAL);
    /* [cover parentID={D02A3411-8ADB-4e7b-9210-F89C3F1F303F}]
      if Status is E_OK
    [/cover] */
  if(E_OK == ApiStatus)
  {
    /* if BRS is enabled */
    /* [cover parentID={35B6C3D4-FB01-4a5d-8A4E-389FF9CE03B4}]
      if BRS is enabled
    [/cover] */
    if(TRUE == CanConfig->CanFDConfigParamPtr[FdIndex].CanTxBRSEnable)
    {
      /* [cover parentID={748FD593-B97F-48e6-93BE-94D5E6BD774E}]
      Enable Bit rate switching for transmission
      [/cover] */
      NodeRegAddressPtr->CCCR.B.BRSE = CAN_17_MCMCAN_ONE;
      /* Wait until the INIT bits become set */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      ApiStatus = Can_17_McmCan_lTimeOut( \
        (const volatile uint32*)&NodeRegAddressPtr->CCCR.U, \
        CAN_17_MCMCAN_CCCR_BRSE_STATUS,CAN_17_MCMCAN_EQUAL);
    }
    else
    {
      /* [cover parentID={C7BC8E2F-B84F-4d73-94A3-C67A4663276C}]
         Disable Bit rate switching for transmission
      [/cover] */
      NodeRegAddressPtr->CCCR.B.BRSE = CAN_17_MCMCAN_ZERO;
      /* Wait until the INIT bits become set */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      ApiStatus = Can_17_McmCan_lTimeOut( \
        (const volatile uint32*)&NodeRegAddressPtr->CCCR.U, \
        CAN_17_MCMCAN_CCCR_BRSE_STATUS,CAN_17_MCMCAN_NOT_EQUAL);
    }
  }
  return(ApiStatus);
}
#endif
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lInitTxMsgObj          **
**                    (                                                       **
**                     const uint8 Controller                                 **
**                     Can_17_McmCan_CoreStatesType* const CanCoreState       **
**                     const Can_17_McmCan_CoreConfigType* const CanConfig    **
**                    )                                                       **
**                                                                            **
**  Description    : Initializes transmit message objects                     **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId: Index of core specific Controller        **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lInitTxMsgObj(const uint8 Controller, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint32 CanTxBufferStartAddress;
  uint32 CanTxEventStartAddress;
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_TX_EFC  TxTempEvntReg;
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_TX_BC  TxTempbuffReg;
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_TX_ESC  TxTempbuffSizeReg;
  /* Get Node Register address */
  NodeRegAddressPtr = \
            CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* Set with MessageRAM Tx buffer section start address */
  CanTxBufferStartAddress = CanConfig-> \
      CanControllerMsgRAMMapConfigPtr[Controller]. \
      CanControllerMsgRAMMap[CAN_17_MCMCAN_SIX];
  /* Set with value Zero */
  TxTempEvntReg.U = CAN_17_MCMCAN_DATA_ZERO;
  /* Set with value Zero */
  TxTempbuffReg.U = CAN_17_MCMCAN_DATA_ZERO;
  /* Set with value Zero */
  TxTempbuffSizeReg.U = CAN_17_MCMCAN_DATA_ZERO;

  /* Check Tx Event buffer is allocated or not */
  /* [cover parentID={1691C839-6EFD-4be0-A0A0-37513FAA4220}]
    Tx Event buffer is allocated or not
    [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanTxBufferStartAddress)
  {
    /* Set with MessageRAM Tx Event buffer section start address */
    CanTxEventStartAddress = CanConfig->
    CanControllerMsgRAMMapConfigPtr[Controller]. \
    CanControllerMsgRAMMap[CAN_17_MCMCAN_FIVE];
    /* Set TX Event FIFO Size */
    TxTempEvntReg.B.EFS = \
      CanConfig->CanControllerMsgRAMMapConfigPtr[Controller].CanTxEvntFIFOSize;
    /* Set Tx Event FIFO Configuration register with Event FIFO Start Address*/
    TxTempEvntReg.B.EFSA = (uint16) ((CanTxEventStartAddress & \
      CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO);
    /* Set Offset for the TBSA */
    TxTempbuffReg.B.TBSA = (uint16) ((CanTxBufferStartAddress & \
       CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK) >> CAN_17_MCMCAN_TWO);


    #if (CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
    /*  Check if Queue is Enabled */
/* [cover parentID={F464C10C-74ED-4a8e-9EED-A7E335710EC6}]
    Check if Queue is Enabled
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerMsgRAMMapConfigPtr[Controller].CanTxQueueStatus)
    {
      /* Set for Tx Queue operation */
      TxTempbuffReg.B.TFQM = CAN_17_MCMCAN_ONE;
      /* Set Tx Queue size */
      TxTempbuffReg.B.TFQS  = CanConfig->
        CanControllerMsgRAMMapConfigPtr[Controller].CanTxQueueSize;
      /* Set No of used TX dedicated buffer */
      TxTempbuffReg.B.NDTB = CanConfig->
        CanControllerMsgRAMMapConfigPtr[Controller].CanTxDedBuffCount;
    }
    else
    #endif

    {
      /* Set No of used TX dedicated buffer */
      TxTempbuffReg.B.NDTB = CanConfig->
        CanControllerMsgRAMMapConfigPtr[Controller].CanTxDedBuffCount;

