liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    }

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* Load Tx Buffer Configuration register with configuration settings */
/* [cover parentID={F511F855-98DE-41dd-9F34-8747C9ACF684}]
    FD Support Status
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[Controller].CanFDSupport)
    {
      /* Set Tx Buffer Data Field Size for FD support */
      TxTempbuffSizeReg.B.TBDS = CAN_17_MCMCAN_SEVEN;
    }
    #endif

    /* [cover parentID={16222DC0-2394-4b68-9201-9C7A680C3E06}]
    Tx processing for current controller is Interrupt mode
    [/cover] */
    /* Check Tx processing mode and Enable Tx Interrupt accordingly */
    if (CAN_17_MCMCAN_INTERRUPT == \
        CanConfig->CanEventHandlingConfigPtr[Controller]. \
        CanEventType[CAN_17_MCMCAN_ZERO])
    {
      /* Enable TxFIFO event Interrupt(Tx Event FIFO New Entry Interrupt
       Enable)of requested controller */
      CanCoreState->CanInterruptStatusPtr[Controller] |= CAN_17_MCMCAN_TWO;
    }
    /* Set Event FIFO configuration Register */
    NodeRegAddressPtr->TX.EFC.U = TxTempEvntReg.U;
    /* Set Tx message buffer configuration Register */
    NodeRegAddressPtr->TX.BC.U = TxTempbuffReg.U;
    /* Set Tx message buffer size configuration Register */
    NodeRegAddressPtr->TX.ESC.U = TxTempbuffSizeReg.U;
  }
}

/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lInitRxMsgObj          **
**                    (                                                       **
**                     const uint8 Controller                                 **
**                     Can_17_McmCan_CoreStatesType* const CanCoreState       **
**                     const Can_17_McmCan_CoreConfigType* const CanConfig    **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes receive message objects                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId: Index of core specific Controller        **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lInitRxMsgObj(const uint8 Controller,
              const Can_17_McmCan_CoreStatesType* const CanCoreState,
                const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_RX_ESC RxTempBuffSizeConfig;
  #endif
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_RX_F0C RxTempFIFO0Config;
  /* MISRA2012_RULE_19_2_JUSTIFICATION:Union is used to access the register
  contents directly without shift and OR operation. */
  Ifx_CAN_N_RX_F1C RxTempFIFO1Config;
  uint32 CanRxBufferCfgData;

  RxTempFIFO0Config.U = CAN_17_MCMCAN_DATA_ZERO;
  RxTempFIFO1Config.U = CAN_17_MCMCAN_DATA_ZERO;

  #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  RxTempBuffSizeConfig.U = CAN_17_MCMCAN_DATA_ZERO;
  #endif
  /* Get Node Register address */
  NodeRegAddressPtr = \
            CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* [cover parentID={FAED0B2A-27ED-4114-9D61-85227F5AC06F}]
  Set Filter for reject non matching and RTR message
  [/cover] */
  /* Set Filter for reject non matching and RTR message */
  NodeRegAddressPtr->GFC.U = CAN_17_MCMCAN_GFC_REJT_RTR_NONMATCH;
  /* Copy Rx buffer start address */
  CanRxBufferCfgData = CanConfig-> \
     CanControllerMsgRAMMapConfigPtr[Controller]. \
     CanControllerMsgRAMMap[CAN_17_MCMCAN_FOUR];
     /* [cover parentID={24CF46B0-4388-48e8-A3DF-4EAB7C2649A8}]
     If Address is not NULL
    [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanRxBufferCfgData)
  {
    /* Set Offset for the RBSA */
    NodeRegAddressPtr->RX.BC.B.RBSA = (uint16) \
                 ((CanRxBufferCfgData & \
                 CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO);


    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* [cover parentID={773BB5A2-4B6D-4945-A657-FCB9DABE9754}]
     FD Support is Enable
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[Controller].CanFDSupport)
    {
      /* Set RX Buffer Data Field Size for FD support */
      RxTempBuffSizeConfig.B.RBDS = CAN_17_MCMCAN_SEVEN;
    }
    #endif
    /* [cover parentID={B31A738C-6FF6-43f1-802D-1DDD6173C19F}]
    If Rx processing mode is Interrupt
    [/cover] */
    /* Check Rx processing mode and Enable Rx Interrupt accordingly */
    if (CAN_17_MCMCAN_INTERRUPT == \
        CanConfig->CanEventHandlingConfigPtr[Controller]. \
        CanEventType[CAN_17_MCMCAN_ONE])
    {
      /* Enable Receive interrupts of dedicated buffer */
      CanCoreState->CanInterruptStatusPtr[Controller] |= CAN_17_MCMCAN_FOUR;
    }
  }

  /* [cover parentID={2730AFD7-3DB0-4dfe-A836-221A50446664}]
  [/cover] */
  /* Read FIFO0 Start Address of requested controller */
  CanRxBufferCfgData = CanConfig-> \
     CanControllerMsgRAMMapConfigPtr[Controller]. \
     CanControllerMsgRAMMap[CAN_17_MCMCAN_TWO];
     /* [cover parentID={17B4C526-82D0-41d5-814C-378AB49306EC}]
    If Address is NULL
    [/cover] */
  if( CAN_17_MCMCAN_ADDRESS_CHECK != CanRxBufferCfgData)
  {
    /* Set Offset for the F0SA */
    RxTempFIFO0Config.B.F0SA =(uint16) \
      ((CanRxBufferCfgData & \
      CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO);
    /* Set with the Rx FIFO0 Size*/
    RxTempFIFO0Config.B.F0S = CanConfig->
      CanControllerMsgRAMMapConfigPtr[Controller].CanRxFIFO0Size;
    /* Set with the Rx FIFO0 Threshold (WatermarkLevel)*/
    RxTempFIFO0Config.B.F0WM = CanConfig->
      CanControllerMsgRAMMapConfigPtr[Controller].CanRxFIFO0Threshold;

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* [cover parentID={6EDC40D7-1228-4615-9868-158852979B27}]
     FD Support is Enable
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[Controller].CanFDSupport)
    {
      /* Set RX Buffer Data Field Size for FD support */
      RxTempBuffSizeConfig.B.F0DS = CAN_17_MCMCAN_SEVEN;
    }
    #endif

    /* [cover parentID={9F75E497-E68C-4e86-A00E-3C3095C51297}]
    Is Rx processing mode is Interrupt
    [/cover] */
    /* Check Rx processing mode and Enable Rx Interrupt accordingly */
    if (CAN_17_MCMCAN_INTERRUPT == \
      CanConfig->CanEventHandlingConfigPtr[Controller]. \
      CanEventType[CAN_17_MCMCAN_ONE])
    {
      /* Enable Receive interrupts depends on the buffer Type used */
      CanCoreState->CanInterruptStatusPtr[Controller] |= CAN_17_MCMCAN_EIGHT;
    }
    /* Set the configuration */
    NodeRegAddressPtr->RX.F0C.U = RxTempFIFO0Config.U;
  }

  /* [cover parentID={970F31A6-FE62-4deb-A70E-4BE2BDE16C3B}]
  [/cover] */
  /* Read FIFO1 Start Address of requested controller */
  CanRxBufferCfgData = CanConfig-> \
    CanControllerMsgRAMMapConfigPtr[Controller]. \
    CanControllerMsgRAMMap[CAN_17_MCMCAN_THREE];
     /* [cover parentID={E7206761-88E7-4868-A4F0-12DBC6BEC78C}]
    If Address is NULL
    [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanRxBufferCfgData)
  {
    /* Set Offset for the RXFIFO1 */
    RxTempFIFO1Config.B.F1SA  = \
        (uint16)((CanRxBufferCfgData & \
        CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO);
    /* Set with Rx FIFO 1 Size*/
    RxTempFIFO1Config.B.F1S = \
      CanConfig->CanControllerMsgRAMMapConfigPtr[Controller].CanRxFIFO1Size;
    /* Set with the Rx FIFO0 Threshold (WatermarkLevel)*/
    RxTempFIFO1Config.B.F1WM = \
     CanConfig->CanControllerMsgRAMMapConfigPtr[Controller].CanRxFIFO1Threshold;

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
        /* [cover parentID={32E8045B-8F18-4e47-9AF5-11FA949AEEF5}]
     FD Support is Enable
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[Controller].CanFDSupport)
    {
      /* Set RX Buffer Data Field Size for FD support */
      RxTempBuffSizeConfig.B.F1DS = CAN_17_MCMCAN_SEVEN;
    }
    #endif

