liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /* [cover parentID={C3A2A141-A862-4ee7-8237-19C733ACAF5C}]
    Is Rx processing mode is Interrupt
    [/cover] */
    /* Check Rx processing mode and Enable Rx Interrupt accordingly */
    if (CAN_17_MCMCAN_INTERRUPT == \
        CanConfig->CanEventHandlingConfigPtr[Controller]. \
        CanEventType[CAN_17_MCMCAN_ONE])
    {
      /* Enable Receive interrupts depends on the buffer Type used */
      CanCoreState->CanInterruptStatusPtr[Controller] |= CAN_17_MCMCAN_SIXTEEN;
    }
    /* Set the configuration */
    NodeRegAddressPtr->RX.F1C.U = RxTempFIFO1Config.U;
  }

  #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* Set Rx Message RAM data Size */
  NodeRegAddressPtr->RX.ESC.U = RxTempBuffSizeConfig.U;
  #endif
}

/*******************************************************************************
**                                                                            **
**  Syntax           : static Can_ReturnType                                  **
**                             Can_17_McmCan_lSetModeWuSupportOff             **
**                     (                                                      **
**                        const uint8 Controller,                             **
**                        const Can_StateTransitionType Transition,           **
**                        Can_17_McmCan_CoreStatesType* const CanCoreState,   **
**                        const Can_17_McmCan_CoreConfigType* const CanConfig **
**                      )                                                     **
**                                                                            **
**  Description      : Performs software triggered state transitions of the   **
**                    CAN Controller State machine when wakeup support is     **
**                    Disabled                                                **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller Configuration Id**
**                    Transition - Requested transition                       **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : CAN_OK : The HW state has been changed with requested  **
**                                 Transition                                 **
**                    CAN_NOT_OK : The HW status has not been changed with    **
**                                 requested Transition                       **
**                                                                            **
*******************************************************************************/
static Can_ReturnType Can_17_McmCan_lSetModeWuSupportOff( \
  const uint8 Controller, \
  const Can_StateTransitionType Transition, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  /* Pointer to CAN node register type */
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  /* register address to be checked for timeout */
  const volatile uint32* RegAddressPtr;
  /* Api return value */
  Can_ReturnType RetVal;
  /* return value for timeout check */
  Std_ReturnType ApiStatus;

  /* Set Value with E_NOT_OK */
  RetVal = CAN_NOT_OK;
  /* Get Node Register address */
  NodeRegAddressPtr = \
            CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;

  switch (Transition)
  {
    case CAN_T_START :
    {
      /* [cover parentID={A28D888E-5AA2-4e5f-A538-D800260574F9}]
      Check for all Transition Value-1
      [/cover] */
      /* Clear receive message object to avoid older notification */
      Can_17_McmCan_lClearReceivedMsg(Controller,CanConfig);
      /* Set CAN controller with normal operation mode */
      NodeRegAddressPtr->CCCR.B.INIT = CAN_17_MCMCAN_ZERO;
      /* Set with Register Address */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
      /* Check the Hw status update */
      ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*)RegAddressPtr,\
        (uint32) CAN_17_MCMCAN_NODE_INIT_MODE,CAN_17_MCMCAN_NOT_EQUAL);
      /* [cover parentID={40ECCD6D-8DFF-4211-BBC1-FC1C33947E85}]
      Check the Hw status update
      [/cover] */
      /* Hw state changes successfully then set Sw flag */
      if(E_OK == ApiStatus)
      {
        /* [cover parentID={33C1F910-85B0-4430-AA7E-2AD19123F015}]
        Enable all configured interrupts
        [/cover] */
        /* Enable all interrupts */
        CanCoreState->CanInterruptTempStatusPtr[Controller] = \
          CanCoreState->CanInterruptStatusPtr[Controller];

        #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
        if(CAN_17_MCMCAN_ZERO != \
          CanCoreState->CanActiveIcomCfgIdPtr[Controller])
        {
          /* [cover parentID={0271DE7F-C0FA-4e76-BF51-E34E19D59472}]
          Deactivate ICOM
          [/cover] */
          Can_17_McmCan_lDeactivateIcom(Controller, CAN_17_MCMCAN_ZERO, \
          CanCoreState,CanConfig);
        }
        #endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

        /* Set current mode to STARTED */
        CanCoreState->CanControllerModePtr[Controller] = CANIF_CS_STARTED;
        /* Set with Register Address */
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->PSR.U));
        /* Check the Hw status update */
        ApiStatus = Can_17_McmCan_lTimeOut( \
          (const volatile uint32*)RegAddressPtr,\
          (uint32) CAN_17_MCMCAN_NODE_PSR_MODE,CAN_17_MCMCAN_NAND);
        /* [cover parentID={1DB473CB-1506-4429-99E3-99F351D2BDB5}]
        If status is not E_OK
        [/cover] */
        if(E_OK != ApiStatus)
        {
          /* Set return value with CAN_NOT_OK */
          RetVal = CAN_NOT_OK;
        }
        else
        {
          /* Set return value with CAN_OK */
          RetVal = CAN_OK;
        }
      }
    }
    break;
    case CAN_T_SLEEP :
    {
    /* [cover parentID={0FB0FFE1-A9BF-4625-AEEE-0C91556E298D}]
      Check for all Transition Value-2
      [/cover] */
      /* Set CCR with Clock Stop request */
      NodeRegAddressPtr->CCCR.B.CSR = CAN_17_MCMCAN_ONE;
      /* Set with Register Address */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
      /* [cover parentID={D339BFC0-01C9-4a6f-95A7-B19279F7CBCC}]
      Wait for the Clock Stop Acknowledge
      [/cover] */
      /* Wait for the Clock Stop Acknowledge */
      ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*)RegAddressPtr,\
         (uint32)CAN_17_MCMCAN_CCCR_CSA_STATUS,CAN_17_MCMCAN_EQUAL);

      /* [cover parentID={686F4572-03A0-4340-98CD-2B2E96515727}]
      Is Hw is set properly
      [/cover] */
      /* Check Hw is set properly or not within the Time-out */
      if(E_OK == ApiStatus)
      {
        /* [cover parentID={9CBD591A-C3D3-42ca-BD0B-0BF5B2C0D76D}]
        Disable all configured interrupts
        [/cover] */
        /* Disable all interrupts */
        CanCoreState->CanInterruptTempStatusPtr[Controller] = \
          CAN_17_MCMCAN_ZERO;
        /* Set current mode to SLEEP */
        CanCoreState->CanControllerModePtr[Controller] = CANIF_CS_SLEEP;
        /* Set return value with E_OK */
        RetVal = CAN_OK;
      }
    }
    break;
    case CAN_T_STOP :
    {
      /* [cover parentID={F74C1850-5FB1-4334-8198-FF0DD6F6C600}]
      Check for all Transition Value-3
      [/cover] */
      /* [cover parentID={23230BFC-4DD0-4a70-AE2E-378CE22AA0E4}]
      Request for cancel pending request
      [/cover] */
      /* Request for cancel pending request */
      Can_17_McmCan_lCancelPendingTx(Controller,CanCoreState,CanConfig);
      /* Set CAN controller with INIT mode */
      NodeRegAddressPtr->CCCR.B.INIT = CAN_17_MCMCAN_ONE;
      /* Set with Register Address */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
      /* [cover parentID={D3BFCEAA-D8DA-4a9f-9AD6-500C52B176FB}]
      Wait for the Clock Stop Acknowledge
      [/cover] */
      /* Wait for the Clock Stop Acknowledge */
      ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*) \
        RegAddressPtr, CAN_17_MCMCAN_CCCR_INIT_SET_MASK,CAN_17_MCMCAN_EQUAL);
      /* [cover parentID={AF7A0560-C039-4dec-B95A-25D6CFB11C21}]
      If Hw state changes successfully
      [/cover] */
      /* [cover parentID={588152E2-95A3-490b-BF97-9B677117466F}]
      [/cover] */
      /* Hw state changes successfully then set SW flag */
      if(E_OK == ApiStatus)
      {
        /* Disable all interrupts */
        CanCoreState->CanInterruptTempStatusPtr[Controller] = \
          CAN_17_MCMCAN_ZERO;
        /* Set Configuration Change Enable bit */
        NodeRegAddressPtr->CCCR.B.CCE = CAN_17_MCMCAN_ONE;
        /* Set with Register Address */
        /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
        pointer is used.No side effect has been seen. */
        RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
        /* [cover parentID={D3BFCEAA-D8DA-4a9f-9AD6-500C52B176FB}]
        Wait for the Clock Stop Acknowledge
        [/cover] */
        /* Wait for the Clock Stop Acknowledge */
        ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*) \
          RegAddressPtr, CAN_17_MCMCAN_CCCR_CCE_SET_MASK,CAN_17_MCMCAN_EQUAL);
        if(E_OK == ApiStatus)
        {
          #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
          if(CAN_17_MCMCAN_ZERO != \
            CanCoreState->CanActiveIcomCfgIdPtr[Controller])
          {
            /* [cover parentID={9FE15F43-E706-4954-BFAF-C39BF2422CF8}]
            Deactivate ICOM
            [/cover] */
            Can_17_McmCan_lDeactivateIcom(Controller, CAN_17_MCMCAN_ZERO, \
              CanCoreState,CanConfig);
          }
          #endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */
          /* Set current mode to STOPPED */
          CanCoreState->CanControllerModePtr[Controller] = CANIF_CS_STOPPED;
          /* Set return value with E_OK */
          RetVal = CAN_OK;
        }
      }
    }
    break;
    default:  /* case CAN_T_WAKEUP */
    {
      /* Reset the Clock Stop Request */
      NodeRegAddressPtr->CCCR.B.CSR = CAN_17_MCMCAN_ZERO;
      /* Set with Register Address */
      /* MISRA2012_RULE_11_3_JUSTIFICATION:casting apointer to object into a
      pointer is used.No side effect has been seen. */
      RegAddressPtr = (const volatile uint32*) (&(NodeRegAddressPtr->CCCR.U));
      /* [cover parentID={02A3871B-D153-441e-AD56-F549AC7900AC}]
      Wait for the Clock Stop Acknowledge
      [/cover] */
      /* Wait for the No clock stop acknowledge */
      ApiStatus = Can_17_McmCan_lTimeOut((const volatile uint32*) \
        RegAddressPtr, (uint32)CAN_17_MCMCAN_CCCR_CSA_STATUS, \
        CAN_17_MCMCAN_NOT_EQUAL);
      /* [cover parentID={DE6B7946-02F3-4382-A40F-D11B98A2416C}]
      if Hw state changes successfully
      [/cover] */
      /* Check Hw is set properly or not within the Time-out If yes then set Sw
      flag */
      if(E_OK == ApiStatus)
      {
        /* Disable all interrupts */
        CanCoreState->CanInterruptTempStatusPtr[Controller] = \
          CAN_17_MCMCAN_ZERO;
        /* Set current mode to STOPPED */
        CanCoreState->CanControllerModePtr[Controller] = CANIF_CS_STOPPED;
        /* Set return value with E_OK */
        RetVal = CAN_OK;
      }
    }
    break;
  }
  SchM_Enter_Can_17_McmCan_CanIntCtrl();
  /* [cover parentID={F3871B24-CD29-460b-9309-C5CCE4A6B431}]
  If disable Interrupt count is ZERO
  [/cover] */
  if (CAN_17_MCMCAN_ZERO == CanCoreState->CanDisableIntrpCountPtr[Controller])
  {
    /* Enable/Disable BO Interrupt(Bus_Off Status Interrupt Enable)of requested
    controller */
    NodeRegAddressPtr->IE.B.BOE = \
       CanCoreState->CanInterruptTempStatusPtr[Controller] & CAN_17_MCMCAN_ONE;
    /* Enable/Disable TxFIFO event Interrupt(Tx Event FIFO New Entry Interrupt
    Enable)of requested controller */
    NodeRegAddressPtr->IE.B.TEFNE = \
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_ONE) & CAN_17_MCMCAN_ONE);
    /* Enable/Disable Receive interrupts of dedicated buffer */
    NodeRegAddressPtr->IE.B.DRXE = \
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_TWO) & CAN_17_MCMCAN_ONE);
    /* Enable/Disable Receive interrupts depends on the buffer Type used */
    NodeRegAddressPtr->IE.B.RF0WE = \
    ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
    CAN_17_MCMCAN_THREE) & CAN_17_MCMCAN_ONE);
     /* Enable/Disable Receive interrupts depends on the buffer Type used */
    NodeRegAddressPtr->IE.B.RF1WE = \
    ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
    CAN_17_MCMCAN_FOUR) & CAN_17_MCMCAN_ONE);
  }
  SchM_Exit_Can_17_McmCan_CanIntCtrl();
  return RetVal;
}

