liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
** Traceability   : [cover parentID={A92A9706-2381-4fd3-A925-36AFF492CB8E}]   **
**                                                                            **
**  Syntax           :LOCAL_INLINE void Can_17_McmCan_lDisableInterrupts      **
**                   (                                                        **
**                      const uint8 Controller,                               **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig,  **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState      **
**                   )                                                        **
**                                                                            **
**  Description      : Disables CAN Controller Interrupts                     **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lDisableInterrupts (const uint8 Controller,
             const Can_17_McmCan_CoreConfigType* const CanConfig,
             const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;

  /* Get Node Register address */
  NodeRegAddressPtr = \
            CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* [cover parentID={921F2114-3F35-4619-BF18-625800CD8F21}]
  [/cover] */
  /* [cover parentID={10696534-AB0B-466e-907E-01ECE53F050D}]
  Enter Critical Section call
  [/cover] */
  /* Enter Critical Section */
  SchM_Enter_Can_17_McmCan_CanIntCtrl();
  /* [cover parentID={A709A9A8-6D79-45a6-A189-F5F0FD6C1B45}]
  Check Disable interrupt count is at reset value
  [/cover] */
  if (CAN_17_MCMCAN_ZERO == CanCoreState->CanDisableIntrpCountPtr[Controller])
  {
    /* [cover parentID={BC56B154-2603-4bf8-BD0A-3E3D15801929}]
    Check Tx interrupt is enabled
    [/cover] */
    /* Check Tx interrupt is enabled */
    if(CAN_17_MCMCAN_ONE == \
     ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
     CAN_17_MCMCAN_ONE) & CAN_17_MCMCAN_ONE))
    {
      /* Disable Tx interrupt */
      NodeRegAddressPtr->IE.B.TEFNE = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={EC0C0BDC-5DD4-48ad-ABFE-71A2771FEE23}]
    Check dedicated Rx interrupt is enabled
    [/cover] */
    /* Check dedicated Rx interrupt is enabled */
    if(CAN_17_MCMCAN_ONE == \
     ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
     CAN_17_MCMCAN_TWO) & CAN_17_MCMCAN_ONE))
    {
      /* Disable Rx interrupt */
      NodeRegAddressPtr->IE.B.DRXE = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={84C21DAB-78CD-4bed-AFD3-7C1DCE6609D0}]
    Check Bus-off interrupt is enabled
    [/cover] */
    /* Check Bus-off interrupt is enabled */
    if(CAN_17_MCMCAN_ONE == (CanCoreState-> \
      CanInterruptTempStatusPtr[Controller] & CAN_17_MCMCAN_ONE))
    {
      /* Disable Bus-off interrupt */
      NodeRegAddressPtr->IE.B.BOE = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={7C3FFC76-F532-4150-96FF-52C017910FE0}]
    Check Rx FIFO0 interrupt is enabled
    [/cover] */
    /* Check Rx FIFO0 interrupt is enabled */
    if(CAN_17_MCMCAN_ONE == ((CanCoreState-> \
        CanInterruptTempStatusPtr[Controller] >> \
         CAN_17_MCMCAN_THREE) & CAN_17_MCMCAN_ONE))
    {
      /* Disable FIFO0 interrupt */
      NodeRegAddressPtr->IE.B.RF0WE = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={4ED4D4EF-A14E-4a77-BEDB-2B2265D2F85C}]
    Check Rx FIFO1 interrupt is enabled
    [/cover] */
    /* Check Rx FIFO1 interrupt is enabled */
    if(CAN_17_MCMCAN_ONE == ((CanCoreState-> \
        CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_FOUR) & CAN_17_MCMCAN_ONE))
    {
      /* Disable FIFO1 interrupt */
      NodeRegAddressPtr->IE.B.RF1WE = CAN_17_MCMCAN_ZERO;
    }
  }
  /* Count the number of times Can_17_McmCan_DiableControllerInterrupts API
  is called */
  CanCoreState->CanDisableIntrpCountPtr[Controller] = \
    CanCoreState->CanDisableIntrpCountPtr[Controller] + CAN_17_MCMCAN_ONE;
  /* [cover parentID={921F2114-3F35-4619-BF18-625800CD8F21}]
  [/cover] */
  /* Exit Critical Section */
  SchM_Exit_Can_17_McmCan_CanIntCtrl();
}

/*******************************************************************************
** Traceability   : [cover parentID={02E9A839-B32F-4bd8-8C8A-E98E11A06D5E}]   **
**                                                                            **
**  Syntax           :LOCAL_INLINE void Can_17_McmCan_lEnableInterrupts       **
**                   (                                                        **
**                      const uint8 Controller,                               **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig,  **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState      **
**                   )                                                        **
**                                                                            **
**  Description      : Enable CAN Controller Interrupts                       **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lEnableInterrupts (const uint8 Controller,
         const Can_17_McmCan_CoreConfigType* const CanConfig,
         const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;

  /* Get Node Register address */
  NodeRegAddressPtr = \
              CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* [cover parentID={BA1DDBF8-9AEC-4e76-B6FF-B9B3597CAFF2}]
  Enter Critical Section call
  [/cover] */
  /* [cover parentID={B3999980-346F-4b50-A961-D4F071098113}]
  [/cover] */
  /* Enter Critical Section */
  SchM_Enter_Can_17_McmCan_CanIntCtrl();
  /* [cover parentID={A61F9762-6392-4d5d-9F01-F19D77EA175B}]
  Check disable interrupt count is greater than zero.
  [/cover] */
  /* Check Can_17_McmCan_DisableControllerInterrupts has been called before,If
   no then don't perform any action. */
  if (CanCoreState->CanDisableIntrpCountPtr[Controller] > CAN_17_MCMCAN_ZERO)
  {
    /* Incremental interrupt disable/enable count */
    CanCoreState->CanDisableIntrpCountPtr[Controller] = \
     CanCoreState->CanDisableIntrpCountPtr[Controller] - CAN_17_MCMCAN_ONE;
    /* Check if disable count is zero or not */
    /* [cover parentID={FC7AA1C8-179D-4388-BDCE-972A6D27F4AB}]
       Check if disable count is zero or not
    [/cover] */
    if (CAN_17_MCMCAN_ZERO == CanCoreState->CanDisableIntrpCountPtr[Controller])
    {
      /* Re enable the status of Interrupt */
      /* Enable BO Interrupt(Bus_Off Status Interrupt Enable)of requested
      controller */
      NodeRegAddressPtr->IE.B.BOE = \
        CanCoreState->CanInterruptTempStatusPtr[Controller] & CAN_17_MCMCAN_ONE;
      /* Enable TxFIFO event Interrupt(Tx Event FIFO New Entry Interrupt
      Enable)of requested controller */
      NodeRegAddressPtr->IE.B.TEFNE = \
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_ONE) & CAN_17_MCMCAN_ONE);
      /* Enable Receive interrupts of dedicated buffer */
      NodeRegAddressPtr->IE.B.DRXE = \
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_TWO) & CAN_17_MCMCAN_ONE);
      /* Enable Receive interrupts depends on the buffer Type used */
      NodeRegAddressPtr->IE.B.RF0WE = \
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
      CAN_17_MCMCAN_THREE) & CAN_17_MCMCAN_ONE);
      /* Enable Receive interrupts depends on the buffer Type used */
      NodeRegAddressPtr->IE.B.RF1WE =
      ((CanCoreState->CanInterruptTempStatusPtr[Controller] >> \
       CAN_17_MCMCAN_FOUR) &  CAN_17_MCMCAN_ONE);
    }
  }
  /* [cover parentID={B3999980-346F-4b50-A961-D4F071098113}]
  [/cover] */
  /* Exit Critical Section */
  SchM_Exit_Can_17_McmCan_CanIntCtrl();
}
#if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
/*******************************************************************************
** Traceability   : [cover parentID={24A1ABDD-424C-4af5-8711-FB56D2461FCF}]   **
**                                                                            **
**  Syntax        : LOCAL_INLINE Can_ReturnType Can_17_McmCan_lUpdatePduInfo  **
**                    (                                                       **
**                       const Can_HwHandleType HthIndex,                     **
**                       Can_PduType* TempPduInfo,                            **
**                       const Can_PduType* const PduInfo,                    **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                     )                                                      **
**                                                                            **
**  Description    : Programs Message Object for transmission                 **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HthIndex - HTH index in the configuration structure    **
**                    PduInfo - Pointer to SDU user memory, DLC and           **
**                              Identifier                                    **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : CAN_OK - Write command has been accepted               **
**                   CAN_BUSY - No message object available or pre-emptive    **
**                              call of Can_17_McmCan_Write that can't be     **
**                              implemented re-entrant                        **
**                   CAN_NOT_OK - development error occurred                  **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE Can_ReturnType Can_17_McmCan_lUpdatePduInfo( \
  const Can_HwHandleType HthIndex, \
  Can_PduType* const TempPduInfo, const Can_PduType* const PduInfo, \
  const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  /* PduInfoType structure variable */
  PduInfoType PduInfoTrigger;
  PduInfoType *WritePduInfoPtr;
  const Can_17_McmCan_TxHwObjectConfigType *TxObjPtr;
  Std_ReturnType TriggerStatus;
  Can_ReturnType ApiStatus;

  /* Set value with OK */
  ApiStatus = CAN_OK;
  /* Set with TX object configuration start index */
  TxObjPtr = CanConfig->CanTxHwObjectConfigPtr;
  /* initialize Pointers PduInfoPtr and TempPduInfo */
  /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
  is agreed as we refer to this address while passing the pointer and usage
  of this variable is limited only to this call*/
  WritePduInfoPtr = &PduInfoTrigger;
  /* Check Trigger Transmit is Enabled */
  /* [cover parentID={04AC4257-F643-43e8-99D3-EBC156D07C6E}]
    Check Trigger Transmit is Enabled
    [/cover] */
  if(TRUE == TxObjPtr[HthIndex].CanTrigTxStatus)
  {

