liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /*Store Data pointer and Data length*/
    WritePduInfoPtr->SduDataPtr = PduInfo->sdu;
    WritePduInfoPtr->SduLength =  (uint8)(PduInfo->length);
    /* [cover parentID={F0374D8B-60E3-4ab4-8FE3-7603DB0449AE}]
    [/cover] */
    /* CanIf_TriggerTransmit() to acquire the PDUs data */
    TriggerStatus = CanIf_TriggerTransmit(PduInfo->swPduHandle,WritePduInfoPtr);
    /* [cover parentID={FD2C996D-7554-4999-B056-773E081E56BC}]
    Check Trigger Status
    [/cover] */
    if(E_NOT_OK != TriggerStatus)
    {
      /*Store the updated Data pointer and Data length*/
      TempPduInfo->sdu = WritePduInfoPtr->SduDataPtr;
      TempPduInfo->length = (uint8)(WritePduInfoPtr->SduLength);
    }
    else
    {
     #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
      /* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_POINTER);
      #endif
      /* Set value with OK */
      ApiStatus = CAN_NOT_OK;
    }
  }
  else
  {
    /*Store the Data pointer and Data length*/
    TempPduInfo->sdu = PduInfo->sdu;
    TempPduInfo->length = PduInfo->length;
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */

/*CYCLOMATIC_Can_17_McmCan_lWriteMsgObj_JUSTIFICATION: This Function has
cyclomatic Complexity of 16 if breaking it into two functions will impact the
readability and performance.
*/
/*******************************************************************************
** Traceability   : [cover parentID={24A1ABDD-424C-4af5-8711-FB56D2461FCF}]   **
**                                                                            **
**  Syntax           : static Can_ReturnType Can_17_McmCan_lWriteMsgObj       **
**                    (                                                       **
**                       const Can_HwHandleType HthIndex,                     **
**                       const Can_PduType* const PduInfo,                    **
**                       Can_17_McmCan_CoreStatesType* const CanCoreState,    **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                     )                                                      **
**                                                                            **
**  Description    : Programs Message Object for transmission                 **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HthIndex - HTH index in the configuration structure    **
**                    PduInfo - Pointer to SDU user memory, DLC and           **
**                              Identifier                                    **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : CAN_OK - Write command has been accepted               **
**                   CAN_BUSY - No message object available or pre-emptive    **
**                              call of Can_17_McmCan_Write that can't be     **
**                              implemented re-entrant                        **
**                   CAN_NOT_OK - development error occurred                  **
**                                                                            **
*******************************************************************************/
static Can_ReturnType Can_17_McmCan_lWriteMsgObj(  \
                    const Can_HwHandleType HthIndex, \
                    const Can_PduType* const PduInfo, \
                    const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  volatile Ifx_CAN_TXMSG* TxMsgBufferPtr;
  const Can_17_McmCan_TxHwObjectConfigType *TxObjPtr;
  const Can_17_McmCan_ControllerMsgRAMConfigType *MsgRamCfgPtr;
  Can_PduType *TempPduInfo;
  Can_PduType PduTemp;
  uint32 TxWriteStartAddr;
  uint32 BuffIndex;
  uint8 BuffElementIndex;
  Can_ReturnType ApiStatus;
  #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
  Can_ReturnType RetVal;
  #endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */

  uint8 TxMsgDLC;
  uint8 DataBytePos;
  uint8 ControllerId;
  uint16 SwObjIndx;

#if (CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  Can_17_McmCan_TxBufferType TxBuffType;
#endif

  /* Set Message RAM configuration pointer with configuration address */
  MsgRamCfgPtr = CanConfig->CanControllerMsgRAMMapConfigPtr;
  /* Set with TX object configuration start index */
  TxObjPtr = CanConfig->CanTxHwObjectConfigPtr;
  /* [cover parentID={083BC331-9160-4caf-8113-27A6FC5E1098}]
  Multiplexed transimssion is enabled
  [/cover] */
#if (CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  /* Copy the buffer Type of requested HTH */
  TxBuffType = TxObjPtr[HthIndex].CanTxBufferType;
#endif
  /* Set with the associated controller of requested HTH */
  ControllerId = Can_17_McmCan_kGblConfigPtr->CanLogicalControllerIndexPtr \
    [TxObjPtr[HthIndex].HwControllerId].CanLCoreSpecContIndex;
  /* Get Node Register address */
  NodeRegAddressPtr = CanConfig-> \
                      CanControllerConfigPtr[ControllerId].CanNodeAddress;
  /* Set with Message RAM start address of Tx buffer */
  TxWriteStartAddr = MsgRamCfgPtr[ControllerId]. \
    CanControllerMsgRAMMap[CAN_17_MCMCAN_SIX];
  /* Set value with OK */
  ApiStatus = CAN_OK;

  /* Copy the buffer Index for Mask */
  BuffIndex = (uint32)(CAN_17_MCMCAN_TX_BUFF_MASK << (TxObjPtr[HthIndex]. \
    CanTxBuffIndx));

  /* [cover parentID={EC87F7B9-D77C-4a3f-9F3E-D94C2E054494}]
  Enter Critical Section call
  [/cover] */
  /* [cover parentID={6E1CBB09-0089-421f-AFD2-C08A9E6EAEB6}]
  [/cover] */
  /* Enter Critical Section */
  SchM_Enter_Can_17_McmCan_CanWrMO();

