liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#if (CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_OFF)
  /* check if buffer is free or not */
  if(CAN_17_MCMCAN_DATA_ZERO != (NodeRegAddressPtr->TX.BRP.U & BuffIndex))
  {
    /* [cover parentID={9A15F3CC-7C7F-45ba-BFF6-175F4FDC04C5}]
    Set return value as Busy
    [/cover] */
    ApiStatus = CAN_BUSY;
    BuffElementIndex = (uint8)CAN_17_MCMCAN_ZERO;
  }
  else
  {
    /* Copy the exact buffer element offset */
    BuffElementIndex = TxObjPtr[HthIndex].CanTxBuffIndx;
  }
#else
  /* Check Tx buffer Type for Start address calculation and buffer status */
  /* [cover parentID={173F25BC-AF6C-48b3-B55B-05EEAE85E097}]
  [/cover] */
  /* Dedicated buffer type */
  if(CAN_17_MCMCAN_TX_DED_BUFFER == TxBuffType)
  {
    /* [cover parentID={D4AE8421-4CF4-4d62-9E9F-7A1DD412975E}]
    [/cover] */
      /* [cover parentID={58143A88-35A7-4220-95E2-5634FFA8CA5D}]
      Is buffer Free
  [/cover] */
    if(CAN_17_MCMCAN_DATA_ZERO != (NodeRegAddressPtr->TX.BRP.U & BuffIndex))
    {
      /* [cover parentID={6CFB6E77-7FEB-49f7-AB24-C25B021E7CC5}]
      Set return value as Busy
      [/cover] */
      ApiStatus = CAN_BUSY;
      BuffElementIndex = (uint8)CAN_17_MCMCAN_ZERO;
    }
    else
    {
      /* Copy the exact buffer element offset */
      BuffElementIndex = TxObjPtr[HthIndex].CanTxBuffIndx;
    }
  }
  /* [cover parentID={4B7CC083-04A5-46ab-AE13-7E997C720E65}]
  [/cover] */
  /* [cover parentID={D6BD0187-F5E2-4475-8B50-B8E1FE595217}]
  CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION is enabled
  [/cover] */
  else
  {
    /* [cover parentID={D2536F08-9EC3-43be-B165-98C3D0AB16ED}]
    [/cover] */
    /* [cover parentID={65F98883-86B6-4258-A828-57110E43C470}]
    Set Retuen value to BUSY
    [/cover] */
    /* Check TXQUEUE is Free or not */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->TX.FQS.B.TFQF)
    {
      /* [cover parentID={01A8A051-9F22-4523-B752-240B11476297}]
      Return BUSY
      [/cover] */
      ApiStatus = CAN_BUSY;
      BuffElementIndex = (uint8)CAN_17_MCMCAN_ZERO;
    }
    else
    {
      /* Read put Index value from status register */
      BuffElementIndex = NodeRegAddressPtr->TX.FQS.B.TFQPI;
      /* [cover parentID={1716BABC-B97B-415f-B1C2-DB0AEBA80690}]
      Store the Transmission Request which shall be set in ISR
      [/cover] */
      /* Copy the buffer Index for Mask */
      BuffIndex = (uint32)(CAN_17_MCMCAN_TX_BUFF_MASK << BuffElementIndex);
    }
  }
  #endif /* #if (CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_OFF) */

  /* [cover parentID={6E1CBB09-0089-421f-AFD2-C08A9E6EAEB6}]
  [/cover] */
  /* Exit Critical Section */
  SchM_Exit_Can_17_McmCan_CanWrMO();

  #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  /* [cover parentID={AD06B201-F7D9-4675-9F13-6D85FAFCA119}]
  Public ICOM is enabled
  [/cover] */
  /* [cover parentID={1D8F3616-5772-4d56-8ED1-88E3DD52331C}]
  Check controller is enabled for pretended networking
  [/cover] */
  if(TRUE == CanCoreState->CanIcomEnableStatusPtr[ControllerId])
  {
    /* [cover parentID={65F98883-86B6-4258-A828-57110E43C470}]
    Return BUSY
    [/cover] */
    /* Set return value as Busy */
    ApiStatus = CAN_BUSY;
  }
  #endif

  /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
  is agreed as we refer to this address while passing the pointer and usage
  of this variable is limited only to this call*/
  TempPduInfo = &PduTemp;
  #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
  /* [cover parentID={2048703A-0E1A-4692-8533-D2CD73C8672E}]
  [/cover] */
  /* Call for trigger transmit status operations */
  RetVal = Can_17_McmCan_lUpdatePduInfo(HthIndex,TempPduInfo,PduInfo,CanConfig);
  if(CAN_OK != RetVal)
  {
    ApiStatus =  CAN_NOT_OK;
  }
  #else
  /*Store the Data pointer and Data length*/
  TempPduInfo->sdu = PduInfo->sdu;
  TempPduInfo->length = PduInfo->length;
  #endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */

  if(CAN_OK == ApiStatus)
  {
    /* [cover parentID={3795DCA6-43ED-407b-9DF3-D0624631B262}]
    Enter Critical Section call
    [/cover] */
    /* [cover parentID={6E1CBB09-0089-421f-AFD2-C08A9E6EAEB6}]
    Enter Critical Section
    [/cover] */
    SchM_Enter_Can_17_McmCan_CanWrMO();

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* [cover parentID={A66B9A3D-FE07-43dc-A9DD-DC2BF806916B}]
    [/cover] */
    /* Check if FD support is enabled for the controller*/
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[ControllerId].CanFDSupport)
    {

      /* Set buffer size with FD support */
      TxWriteStartAddr = (TxWriteStartAddr + (  \
      CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_FD * BuffElementIndex));
    }
    else
    #endif

    {
      /* Set buffer size with normal buffer */
      TxWriteStartAddr = TxWriteStartAddr + (  \
      CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_NFD * BuffElementIndex);
    }
    /* Set with Transmit message buffer0 pointer */
    /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
    cast the address of Dedicated Tx buffer Type to the Tx buffer elements
    structure type */
    /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
    integer type. Permitted for special function registers.*/
    /* Set with Transmit message buffer0 pointer */
    TxMsgBufferPtr = (volatile Ifx_CAN_TXMSG*) TxWriteStartAddr ;
    /* Reset the T0 Msg buffer being accessed */
    TxMsgBufferPtr->T0.U = (uint32)CAN_17_MCMCAN_ZERO;
    /* Reset the RTR bit to avoid transmit messages triggered by
    remote transmission requests */
    TxMsgBufferPtr->T0.B.RTR = CAN_17_MCMCAN_ZERO;

    /* Check if the requested Id is extended or standard */
    /* [cover parentID={55A345E3-2E98-4e91-89C7-E3037EDD0F70}]
    [/cover] */
    /* [cover parentID={F5C8C104-A834-4ec7-AE45-811E40AC6921}]
    [/cover] */
    if(CAN_17_MCMCAN_EXTENDED_ID_SET == \
      (PduInfo->id & CAN_17_MCMCAN_EXTENDED_ID_SET))
    {
      /* [cover parentID={2009DBAB-A5F6-4e87-BE49-6C1912F107ED}]
      Store extended Id and set XTD bit
      [/cover] */
      /* Store extended Id and set XTD bit */
      TxMsgBufferPtr->T0.B.XTD = CAN_17_MCMCAN_ONE;
      TxMsgBufferPtr->T0.B.ID  = \
        ((PduInfo->id) & CAN_17_MCMCAN_EXTENDED_ID_MASK);
    }
    else
    {
      /* shift Standard Identifier to position 28..18 */
      TxMsgBufferPtr->T0.B.ID = (PduInfo->id & CAN_17_MCMCAN_STANDARD_ID_MASK) \
                                               << CAN_17_MCMCAN_SHIFT_EIGHTEEN;
      /* Set Id Type as Standard */
      TxMsgBufferPtr->T0.B.XTD = CAN_17_MCMCAN_ZERO;
    }

    /* Set DLC with requested value */
    TxMsgDLC = TempPduInfo->length;
    TxMsgBufferPtr->T1.U = (uint32)CAN_17_MCMCAN_ZERO;

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* [cover parentID={6D99BD79-EB4F-4680-9BB1-231FF17DD5C8}]
    Check FD frame needs to be transmit
    [/cover] */
    /* Check FD frame need to be transmit */
    if(CAN_17_MCMCAN_ID_FD_ENABLE_SET == \
       (PduInfo->id & CAN_17_MCMCAN_ID_FD_ENABLE_SET))
    {
      /* Set Tx message with FD */
      TxMsgBufferPtr->T1.B.FDF = CAN_17_MCMCAN_ONE;
    }
    else
    {
      /* Set Tx message with Normal */
      TxMsgBufferPtr->T1.B.FDF = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={01141D65-83F6-4991-8F29-69D10AB63A94}]
    [/cover] */
    /* [cover parentID={54997C5D-274B-4e87-B39F-AE4FE0DACEF7}]
    Check CAN FD frames transmitted with bit rate switching
    [/cover] */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->CCCR.B.BRSE)
    {
      /* Enable BRS */
      TxMsgBufferPtr->T1.B.BRS = CAN_17_MCMCAN_ONE;
    }
    else
    {
      /* Disable BRS */
      TxMsgBufferPtr->T1.B.BRS = CAN_17_MCMCAN_ZERO;
    }
    /* [cover parentID={D012BE97-F2DB-4de9-9D92-0151C2C196F5}]
    Check DLC is greater than maximum FD number of bytes
    [/cover] */
    /* Check DLC length and calculate the Hw support value if DLC > 24 */
    if (TempPduInfo->length > CAN_17_MCMCAN_SHIFT_TWENTYFOUR)
    {
      /* Set DLC length with Hw Supported value */
        TxMsgDLC = (((TempPduInfo->length+CAN_17_MCMCAN_FIFTEEN) >> \
          CAN_17_MCMCAN_FOUR)+ CAN_17_MCMCAN_ELEVEN);
    }
    /* [cover parentID={12A3AA1C-59FB-40de-B1B7-08B7FDF9B20C}]
    Check DLC is greater than normal message
    [/cover] */
    /* Check DLC length and calculate the Hw support value if DLC > 8 */
    else if (TempPduInfo->length > CAN_17_MCMCAN_EIGHT)
    {
        /* Set DLC length with Hw Supported value */
        TxMsgDLC = (((TempPduInfo->length+CAN_17_MCMCAN_THREE) >> \
          CAN_17_MCMCAN_TWO) + CAN_17_MCMCAN_SIX);
    }
    else
    {
      /* Do Nothing */
    }
    #endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON) */

    /* Write DLC value to the T1 buffer */
    TxMsgBufferPtr->T1.B.DLC = TxMsgDLC;

    /* Write Event FIFO */
    TxMsgBufferPtr->T1.B.EFC = CAN_17_MCMCAN_ONE;

    /* Calculate Sw Obj Handle index */
    SwObjIndx = (uint16)((ControllerId * \
        CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ BuffElementIndex);
    /* [cover parentID={E8DDD82E-BA0D-4872-84C4-0F67E7522B18}]
    [/cover] */
    /* Store sPduHandle Id for Tx confirmation process */
    CanCoreState->CanSwObjectHandlePtr[SwObjIndx] = PduInfo->swPduHandle;

    /* Write Message Marker with SwHandle Index (HTH Indx - Controller StartHTH
    Index) Index for the Tx confirmation process */
    TxMsgBufferPtr->T1.B.MM = BuffElementIndex;

