liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /* Set data byte position with zero index */
    DataBytePos = CAN_17_MCMCAN_ZERO;

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* Convert DLC length to Number of Data Bytes supported by Hw */
    TxMsgDLC = Can_17_McmCan_GblFdDlcConvDB[TxMsgDLC];
    #endif

    /* Set loop for write with Number of Data Byte */
    while(TxMsgDLC > DataBytePos)
    {

      #if (CAN_17_MCMCAN_FD_ENABLE == STD_OFF)
      /* Store the data to the Tx Buffer */
      TxMsgBufferPtr->DB[DataBytePos].U = TempPduInfo->sdu[DataBytePos];
      #else
      /* [cover parentID={54997C5D-274B-4e87-B39F-AE4FE0DACEF7}]
      Check byte position is with in the DLC
     [/cover] */
      if(DataBytePos < TempPduInfo->length)
      {
        /* [cover parentID={773E49C8-EEB4-4732-B164-BFEF1F4B02AB}]
        Store the data to the Tx Buffer
        [/cover] */
        /* Copy Message data to the Tx Buffer */
        TxMsgBufferPtr->DB[DataBytePos].U = TempPduInfo->sdu[DataBytePos];
      }
      else
      {
        /* Store with padding values to the Tx buffer */
        TxMsgBufferPtr->DB[DataBytePos].U = TxObjPtr[HthIndex].CanFdPaddValue;
      }
      #endif    /* (CAN_17_MCMCAN_FD_ENABLE == STD_OFF) */

        /* Set for next data byte */
        DataBytePos++;
    }
    /* [cover parentID={83E2512D-CB7A-4a18-9AEA-2FC0DCD6A5C7}]
    Request for the Transmission
    [/cover] */
    NodeRegAddressPtr->TX.BAR.U |= (Ifx_UReg_32Bit)BuffIndex;
    /* [cover parentID={5925E0A4-AEC9-4be4-9FEB-26D1EFF6EC91}]
    [/cover] */
    /* Set the write operation status as successful */
    ApiStatus = CAN_OK;
    /* [cover parentID={85BA8CAE-3074-406e-B64D-361C3FAA9D22}]
    [/cover] */
    /* [cover parentID={6E1CBB09-0089-421f-AFD2-C08A9E6EAEB6}]
    [/cover] */
    /* Exit Critical Section */
    SchM_Exit_Can_17_McmCan_CanWrMO();
  }
  return ApiStatus;
}
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lRxExtractData               **
**                    (                                                       **
**                      const uint8 HwControllerId,                           **
**                      const uint8 RxBuffIndex,                              **
**                      const Can_17_McmCan_RxBufferType RxBuffer,            **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState,     **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : This function extracts data from the message object    **
**                    and notifies upper layer                                **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HwControllerId - Associated CAN Controller             **
**                     RxBuffIndex - Bit Position within MSPND Register       **
**                     RxBuffer - receive buffer type used which can be       **
**                                       Dedicated RX/FIFO0/FIFO1             **
**                     CanConfig - Pointer to CAN driver configuration        **
**                     CanCoreState - Pointer to global structure             **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : none                                                **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lRxExtractData(const uint8 HwControllerId, \
                               const uint8 RxBuffIndex, \
                               const Can_17_McmCan_RxBufferType RxBuffer, \
                        const Can_17_McmCan_CoreStatesType* const CanCoreState,
                        const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  const Can_17_McmCan_ControllerMsgRAMConfigType *MsgRamCfgPtr;
  volatile const Ifx_CAN_RXMSG *RxMsgRAMPtr;
  Can_HwType RxMailBoxInfo;
  PduInfoType RxPduInfo;
  const Can_17_McmCan_SIDFilterConfigType *CanSIDFilterPtr;
  const Can_17_McmCan_XIDFilterConfigType *CanXIDFilterPtr;
  uint32 RxReadStartAddr;
  uint32 RxReadOffsetAddr;
  uint16 FiltrStartIndx;
  uint8  RxMsgDLC;
  uint8  RxMsgFilterIndx;
  uint8  RxMsgCnt;
  Can_IdType RxMsgId;
  #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  uint8 CanRxMessageData[CAN_17_MCMCAN_NOOF_CONTROLLER] \
  [CAN_17_MCMCAN_MAX_FD_LENGTH];
  #else
  uint8 CanRxMessageData[CAN_17_MCMCAN_NOOF_CONTROLLER] \
  [CAN_17_MCMCAN_MAX_DATA_LENGTH];
  #endif

  /* Set Message RAM configuration pointer with configuration address */
  MsgRamCfgPtr = CanConfig->CanControllerMsgRAMMapConfigPtr;
  /* Check requested buffer type */
  /* [cover parentID={CC1A3A21-1E66-4fa4-9FCB-BD30E3B458C4}]
  Requested Buffer type
  [/cover] */
  if(CAN_17_MCMCAN_RX_FIFO0 == RxBuffer)
  {
    /* Read Rx Message RAM start address of RXFIFO0 */
    RxReadStartAddr = MsgRamCfgPtr[HwControllerId]. \
    CanControllerMsgRAMMap[CAN_17_MCMCAN_TWO];
  }
  else if(CAN_17_MCMCAN_RX_FIFO1 == RxBuffer)
  {
    /* Read Rx Message RAM start address of RXFIFO1 */
    RxReadStartAddr = \
                    MsgRamCfgPtr[HwControllerId]. \
                    CanControllerMsgRAMMap[CAN_17_MCMCAN_THREE];
  }
  else
  {
    /* Read Rx Message RAM start address of dedicated buffer */
    RxReadStartAddr = \
                     MsgRamCfgPtr[HwControllerId]. \
                     CanControllerMsgRAMMap[CAN_17_MCMCAN_FOUR];
  }
  /* Set OFFSET address with  buffer position */
  RxReadOffsetAddr = RxBuffIndex;
  if(CAN_17_MCMCAN_ADDRESS_CHECK != RxReadStartAddr)
  {
    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* Check if FD support is enabled for the controller*/
    /* [cover parentID={0ABD541D-73FA-404a-9AD7-1AFE9DE0D81C}]
    IS CAN FD support Enable
    [/cover] */
    if(TRUE == \
      CanConfig->CanControllerConfigPtr[HwControllerId].CanFDSupport)
    {
      /* Load the data receive message buffer address */
      /*IFX_MISRA_RULE_11_03_STATUS=The pointer cast is used to
      cast the address of Dedicated Rx buffer Type to the Rx buffer elements
      structure type  */
       RxReadStartAddr = RxReadStartAddr + (RxReadOffsetAddr
                          * CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_FD);
    }
    else
    #endif

    {

      /* Load the data receive message buffer address */
      RxReadStartAddr = RxReadStartAddr + (RxReadOffsetAddr \
          * CAN_17_MCMCAN_MSG_RAM_ELEMENT_SIZE_NFD);
    }

    /* Load the data receive message buffer address */
    /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to cast the
    address of Dedicated Rx buffer Type to the Rx buffer elements structure
    type */
    /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and integer
    type. Permitted for special function registers.*/
    RxMsgRAMPtr = (volatile Ifx_CAN_RXMSG*) RxReadStartAddr;
    /* Extract DLC information */
    RxMsgDLC = RxMsgRAMPtr->R1.B.DLC;
    /* Read Filter Index */
    RxMsgFilterIndx = RxMsgRAMPtr->R1.B.FIDX;

    /* Extract receive Msg.ID  and ID Type */
    /* [cover parentID={E48CA5D5-56B5-4124-87E7-E4FC09F758C9}]
      Message Id not configured
      [/cover] */
    if (CAN_17_MCMCAN_BIT_CLEAR_VAL == RxMsgRAMPtr->R0.B.XTD)
    {
      /* Read received message Id and Message type */
      RxMsgId = RxMsgRAMPtr->R0.B.ID>>CAN_17_MCMCAN_SHIFT_EIGHTEEN;
      /* First index value of standard filter set */
      FiltrStartIndx = CanConfig-> \
        CanControllerConfigPtr[HwControllerId]. \
        CanControllerMOMap[CAN_17_MCMCAN_TWO];
      /* Set SID filter list Address */
      CanSIDFilterPtr = CanConfig->CanSIDFilterConfigPtr;
      /* Read and store the HOH Id*/
      RxMailBoxInfo.Hoh = \
          CanSIDFilterPtr[FiltrStartIndx+RxMsgFilterIndx].CanSidHwObjId;
    }
    else
    {
      /* [cover parentID={F220106E-922D-4368-9EBD-0C83BDB56ABB}]
      Set message ID type as extended and extract the message ID
      [/cover] */
      /* Set message ID type as Extended */
      RxMsgId = CAN_17_MCMCAN_SET_XTD_BIT_MASK;
      /* Copy message ID  */
      RxMsgId |= (Can_IdType)RxMsgRAMPtr->R0.B.ID;
      /* First index value of Extended filter set */
      FiltrStartIndx = CanConfig-> \
        CanControllerConfigPtr[HwControllerId]. \
        CanControllerMOMap[CAN_17_MCMCAN_FOUR];
      /* Set XID filter list Address */
      CanXIDFilterPtr = CanConfig->CanXIDFilterConfigPtr;
      /* Read and store the HOH Id*/
      RxMailBoxInfo.Hoh = \
        CanXIDFilterPtr[FiltrStartIndx+RxMsgFilterIndx].CanXidHwObjId;
    }
    /* Read receive data information from R1 RAM element */
    /* Read FD status of received Message */
    /* [cover parentID={4A6EFA0F-F343-460b-B81F-8C7F73B53812}]
      Set FD status of MsgId
      [/cover] */
    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    if( CAN_17_MCMCAN_BIT_SET_VAL == RxMsgRAMPtr->R1.B.FDF)
    {
      /* [cover parentID={3CBFC192-2B42-491a-95FA-C9EBE7401C43}]
      Set FD bit of MsgId
      [/cover] */
      /* Set FD bit of MsgId */
      RxMsgId |= (Can_IdType)CAN_17_MCMCAN_SET_FD_MASK;
    }
    #endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON) */
    /* Clear to read from Byte0 */
    RxMsgCnt = CAN_17_MCMCAN_ZERO;

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
    /* Convert DLC length to Number of Data Bytes supported by Hw */
    RxMsgDLC = Can_17_McmCan_GblFdDlcConvDB[RxMsgDLC];
    #endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON) */

