liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /* Copy Message from RAM section to local data buffer */
    while(RxMsgCnt < RxMsgDLC)
    {
      /* copy data from byte0 to n the buffer */
      CanRxMessageData[HwControllerId][RxMsgCnt] = RxMsgRAMPtr->DB[RxMsgCnt].U;
      /* Increment to point next byte */
      RxMsgCnt++;
    }
    /* Call CanIf_RxIndication function with receive message information */
    RxMailBoxInfo.CanId = RxMsgId;
    RxMailBoxInfo.ControllerId = HwControllerId;
    RxPduInfo.SduLength = RxMsgDLC;
    /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
    is agreed as we refer to this address while passing the pointer and usage
    of this variable is limited only to this call*/
    RxPduInfo.SduDataPtr = \
                      &CanRxMessageData[HwControllerId][CAN_17_MCMCAN_ZERO];

    /* [cover parentID={2BCD3D07-EC74-4f1b-AAD8-90099FBCD5FE}]
    CAN public ICOM support is enabled
    [/cover] */
    #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
    /* [cover parentID={F4D157C9-719B-425f-B679-E0410C730006}]
    Check ICOM is enabled for current controller
    [/cover] */
    /* Check ICOM enabled */
    if(TRUE == CanCoreState->CanIcomEnableStatusPtr[HwControllerId])
    {
      /* Call Message validate function */
      /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
      is agreed as we refer to this address while passing to the called function
      as a parameter (pass by value).Making this global limits the requirement
      of reentrancy in this function.*/
      Can_17_McmCan_lIcomValidateMsg(&RxMailBoxInfo,&RxPduInfo, \
        CanCoreState, CanConfig);
    }
    else
    #else
    UNUSED_PARAMETER(CanCoreState);
    #endif /* #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

    {
      /* get logical Id to be passed to upper layer */
      RxMailBoxInfo.ControllerId = \
       CanConfig->CanControllerIndexingPtr[HwControllerId];

      /* [cover parentID={F495F68A-E87C-4161-BBF1-02187F5BF35D}]
      Notify to reception of message to CAN IF layer
      [/cover] */
      /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
      is agreed as we refer to this address while passing to the called function
      as a parameter (pass by value).Making this global limits the requirement
      of reentrancy in this function.*/
      CanIf_RxIndication(&RxMailBoxInfo,&RxPduInfo);
    }
  }
}
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lSIDFilter_Config      **
**                    (                                                       **
**                      const uint8 ControllerId,                             **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes receive message objects                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId - Indexing of core specific CAN Controller**
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lSIDFilter_Config (const uint8 ControllerId,
                    const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  volatile Ifx_CAN_STDMSG *SIDFilterDataPtr;
  const Can_17_McmCan_SIDFilterConfigType *CanSIDPtr;
  uint32 SIDFilterStartAddr;
  uint32 SIDFilterRealAddr;
  uint32 SIDFiltrOffset;
  uint16 SIDFiltrIndx;
  uint16 SIDFiltrStartIndx;
  uint16 SIDFiltrEndIndx;

  /* Read the exact Node Start address */
  NodeRegAddressPtr = CanConfig-> \
                      CanControllerConfigPtr[ControllerId].CanNodeAddress;
  /* Set SID filter list Address */
  CanSIDPtr = CanConfig->CanSIDFilterConfigPtr;
  /* Set with first SID filter Index */
  SIDFiltrStartIndx = \
       CanConfig->CanControllerConfigPtr[ControllerId]. \
       CanControllerMOMap[CAN_17_MCMCAN_TWO];
  /* Set with End SID filter Index */
  SIDFiltrEndIndx = \
     CanConfig->CanControllerConfigPtr[ControllerId]. \
     CanControllerMOMap[CAN_17_MCMCAN_THREE];
  /* Read Standard Identifier filter Start address */
  SIDFilterStartAddr = CanConfig-> \
    CanControllerMsgRAMMapConfigPtr[ControllerId]. \
    CanControllerMsgRAMMap[CAN_17_MCMCAN_ZERO];
  /* Load with Start address offset */
  NodeRegAddressPtr->SIDFC.B.FLSSA = \
        ((uint16)((SIDFilterStartAddr & \
        CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO));
  /* Set with Standard section RAM size */
  NodeRegAddressPtr->SIDFC.B.LSS = (uint8) SIDFiltrEndIndx;
  /* Set Offset with First element */
  SIDFiltrOffset = CAN_17_MCMCAN_ZERO;
  /* Set with all standard filter configuration */
  for(SIDFiltrIndx = SIDFiltrStartIndx; SIDFiltrIndx < \
                        (SIDFiltrEndIndx+SIDFiltrStartIndx); SIDFiltrIndx++)
  {
    /* Set with SID element address */
    SIDFilterRealAddr = SIDFilterStartAddr + (CAN_17_MCMCAN_RAM_BYTES * \
    SIDFiltrOffset);
    /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
    cast the address of Standard filter Type to the Standard filter elements
    structure type */
    /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
    integer type. Permitted for special function registers.*/
    SIDFilterDataPtr = (volatile Ifx_CAN_STDMSG*)SIDFilterRealAddr;
    /* Set Filter Data to the Filter element */
    SIDFilterDataPtr->S0.U = CanSIDPtr[SIDFiltrIndx].CanSIDFiltEleS0;
    /* Increment for access next element */
    SIDFiltrOffset++;
  }
}

