liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lXIDFilter_Config      **
**                    (                                                       **
**                      const uint8 ControllerId,                             **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : Initializes receive message objects                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId - Indexing of core specific CAN Controller**
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lXIDFilter_Config (const uint8 ControllerId,
             const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  volatile Ifx_CAN_EXTMSG *XIDFilterPtr;
  const Can_17_McmCan_XIDFilterConfigType *CanXIDPtr;
  uint32 XIDFilterStartAddr;
  uint32 XIDFilterRealAddr;
  uint32 XIDFilterData;
  uint16 XIDFiltrIndx;
  uint16 XIDFiltrStartIndx;
  uint16 XIDFiltrEndIndx;
  uint8 XIDOffsetIndx;

  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
                 CanConfig->CanControllerConfigPtr[ControllerId].CanNodeAddress;
  /* Set with start Index */
  XIDFiltrStartIndx = \
    CanConfig->CanControllerConfigPtr[ControllerId]. \
    CanControllerMOMap[CAN_17_MCMCAN_FOUR];
  /* Set with end Index */
  XIDFiltrEndIndx = \
    CanConfig->CanControllerConfigPtr[ControllerId]. \
    CanControllerMOMap[CAN_17_MCMCAN_FIVE];
  /* Set XID filter list Address */
  CanXIDPtr = CanConfig->CanXIDFilterConfigPtr;
  /* Read Extended Identifier filter Start address */
  XIDFilterStartAddr = CanConfig-> \
     CanControllerMsgRAMMapConfigPtr[ControllerId]. \
     CanControllerMsgRAMMap[CAN_17_MCMCAN_ONE];
  /* Load with Start address offset */
  NodeRegAddressPtr->XIDFC.B.FLESA = \
        ((uint16)((XIDFilterStartAddr & \
        CAN_17_MCMCAN_RAM_ADDRESS_OFFSET_MASK)>>CAN_17_MCMCAN_TWO));
  /* Set with Extended section RAM size */
  NodeRegAddressPtr->XIDFC.B.LSE = (uint8)XIDFiltrEndIndx;
  /* Set with first Filter Index */
  XIDOffsetIndx = CAN_17_MCMCAN_ZERO;
  /* Set with all Extended filter configuration */
  for(XIDFiltrIndx = XIDFiltrStartIndx; XIDFiltrIndx <
                            (XIDFiltrStartIndx+XIDFiltrEndIndx); XIDFiltrIndx++)
  {
    /* Set element offset address F0 */
    XIDFilterRealAddr = XIDFilterStartAddr + (XIDOffsetIndx * \
        CAN_17_MCMCAN_RAM_BYTES * CAN_17_MCMCAN_TWO);
    /* Read Filter F0 configuration data */
    XIDFilterData = CanXIDPtr[XIDFiltrIndx].CanXIDFiltEleF0;
    /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
    cast the address of Extended filter Type to the extended filter elements
    structure type */
    /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
    integer type. Permitted for special function registers.*/
    XIDFilterPtr = (volatile Ifx_CAN_EXTMSG*) XIDFilterRealAddr;
    /* Set Filter element F0 with configuration data */
    XIDFilterPtr->F0.U = XIDFilterData;
    /* Read Filter F1 configuration data */
    XIDFilterData = CanXIDPtr[XIDFiltrIndx].CanXIDFiltEleF1;
    /* Set Filter element F1 with configuration data */
    XIDFilterPtr->F1.U = XIDFilterData;
    /* Increment to next offset */
    XIDOffsetIndx++;
  }
}

/*******************************************************************************
         Receive ,Transmit ,Wakeup and Bus-Off  Handler
*******************************************************************************/
#if(((CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_OFF))|| \
  (CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)))
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lReceiveHandler              **
**                    (                                                       **
**                      const uint8 HwControllerId,                           **
**                      const uint8 CheckBuffType,                            **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState,     **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : - This function is the core part of the interrupt      **
**                      service routine for Receive Interrupt                 **
**                    - In case of successful reception event, this           **
**                      function calls the function                           **
**                     Can_17_McmCan_lRxExtractData to extract data from the  **
**                                message object and notify upper layer       **
**                    - This function is also called by the polling function  **
**                      Can_17_McmCan_MainFunction_Read for controllers       **
**                      configured with CanRxProcessing as POLLING            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HwControllerId - Associated CAN Controller             **
**                    CheckBuffType -  Data received buffer type              **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lReceiveHandler(const uint8 HwControllerId, \
  const uint8 CheckBuffType, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint32 RxNDATValue;
  uint32 RxNDATValue0;
  uint32 RxNDATValue1;
  uint32 RxDedMask;
  uint8 RxHandleBuffPos;
  uint8 RxFillLvlVal;
  uint8 LoopExitFlag;
  uint8 RegSet;
  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
               CanConfig->CanControllerConfigPtr[HwControllerId].CanNodeAddress;
  /* Check the Buffer Type and request from Isr or scheduled function */
  /* [cover parentID={2A8D12D0-8282-405f-B6F6-14ADF180E0ED}]
      Recieve data buffer is dedicated Type
      [/cover] */
  if((CheckBuffType == CAN_17_MCMCAN_ONE) || \
    (CheckBuffType == CAN_17_MCMCAN_ZERO))
  {
    RxNDATValue0 = NodeRegAddressPtr->NDAT1.U;
    RxNDATValue1 = NodeRegAddressPtr->NDAT2.U;
    /* Set with first bit position*/
    RxHandleBuffPos = CAN_17_MCMCAN_ZERO;
    /* Read first NDAT0 buffer value */
    RxNDATValue = RxNDATValue0;

