liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
    /* Read NDAT1 and NDAT2 */
    for(RegSet = CAN_17_MCMCAN_ZERO; RegSet < CAN_17_MCMCAN_TWO ; RegSet++ )
    {
      /* Set mask value */
      RxDedMask = CAN_17_MCMCAN_ONE;
      /* Check any one of the Rx dedicated buffer is received with new
      data */
      while(CAN_17_MCMCAN_DATA_ZERO != (Ifx_UReg_32Bit)RxNDATValue)
      {
        /* Check buffer with mask position is received data or not */
        /* [cover parentID={F199317D-9898-4000-BF43-AC12EF98E323}]
        Check buffer with mask position is received data or not
        [/cover] */
        if(CAN_17_MCMCAN_DATA_ZERO != (Ifx_UReg_32Bit)(RxNDATValue & RxDedMask))
        {
          /* Invoke Can_17_McmCan_lRxExtractData function for retrieve data from
          message */
          Can_17_McmCan_lRxExtractData(HwControllerId,RxHandleBuffPos, \
          CAN_17_MCMCAN_RX_DED_BUFFER,CanCoreState,CanConfig);
          /* Clear the set bit position of NDAT Reg value */
          RxNDATValue = RxNDATValue & (~RxDedMask);
        }
        /* Set mask for check next buffer status */
        RxDedMask = RxDedMask << CAN_17_MCMCAN_ONE;
        /* Increment bit position */
        RxHandleBuffPos++;
      }
      /* After completion of read NDAT1 load NDAT_value with NDAT2 register
         value */
      RxNDATValue = RxNDATValue1;
      /* Set Buffer position from value 32 for NDAT2 */
      RxHandleBuffPos = CAN_17_MCMCAN_THIRTY_TWO;
    }
    /* Clear NDAT Register for receive new message */
    NodeRegAddressPtr->NDAT1.U = RxNDATValue0;
    NodeRegAddressPtr->NDAT2.U = RxNDATValue1;
  }

  /* [cover parentID={C1B9A52E-BCC8-448e-A838-F4B44269384B}]
      Recieve data buffer is RXFIFO0
      [/cover] */
  if((CheckBuffType == CAN_17_MCMCAN_TWO) || \
    (CheckBuffType == CAN_17_MCMCAN_ZERO))
  {
    /* Check Received CAN message is lost or not */
    /* [cover parentID={6B2EFACA-75BB-44e0-A0A2-7BE1D2A73CB5}]
      Check Received CAN message is lost or not
      [/cover] */
    if(CAN_17_MCMCAN_BIT_CLEAR_VAL != NodeRegAddressPtr->RX.F0S.B.RF0L)
    {
      #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
      /* [cover parentID={79D189C7-BDAC-473f-B6F8-2E7C41F4886E}]
      DET is enabled
      [/cover] */
      /* [cover parentID={4D86462A-BB81-4c29-B566-F1C306C59D08}]
      [/cover] */
      /* [cover parentID={4EAE11EC-14C9-4470-9B6F-F8715D79FC8C}]
      Det error CAN_17_MCMCAN_E_DATALOST
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_RECEIVEHANDLER, CAN_17_MCMCAN_E_DATALOST);
      #endif
      NodeRegAddressPtr->IR.B.RF0L = CAN_17_MCMCAN_ONE;
    }
    /* Set safety loop exit flag with value zero */
    LoopExitFlag = CAN_17_MCMCAN_ZERO;
    /* Read Fill Level value */
    RxFillLvlVal = NodeRegAddressPtr->RX.F0S.B.F0FL;
    /* Check if any of the message received by RXFIFO0 */
    while(LoopExitFlag < RxFillLvlVal)
    {
      /* Read Rx FIFO 0 Get Index */
      RxHandleBuffPos = NodeRegAddressPtr->RX.F0S.B.F0GI;
      /* Invoke data retrieve function */
      Can_17_McmCan_lRxExtractData(HwControllerId,RxHandleBuffPos, \
      CAN_17_MCMCAN_RX_FIFO0,CanCoreState,CanConfig);
      /* Set read Acknowledge of buffer */
      NodeRegAddressPtr->RX.F0A.U = RxHandleBuffPos;
      /* Increment exit loop condition for safety */
      LoopExitFlag++;
      /* Clear Fifo full flag after the read is done */
      NodeRegAddressPtr->IR.B.RF0F = CAN_17_MCMCAN_ONE;
    }
  }
  /* [cover parentID={718D7E08-4563-4e45-A662-4E14CD08E759}]
      Recieve data buffer is RXFIFO1
      [/cover] */
  if((CheckBuffType == CAN_17_MCMCAN_THREE) || \
    (CheckBuffType == CAN_17_MCMCAN_ZERO))
  {
    /* Check Received CAN message is lost or not */
    /* [cover parentID={AE3A81FA-3AA2-4049-A631-C6031F38A6F6}]
      Check Received CAN message is lost or not
      [/cover] */
    if(CAN_17_MCMCAN_BIT_CLEAR_VAL != NodeRegAddressPtr->RX.F1S.B.RF1L)
    {
      #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
      /* [cover parentID={6ED3CB77-D482-454c-9CCB-E1817E119ED2}]
      Det error CAN_17_MCMCAN_E_DATALOST
      [/cover] */
      /* [cover parentID={6CC7AA60-5D45-457e-9BC0-AD3EE6F3FEBA}]
      DET is enabled
      [/cover] */
      /* [cover parentID={4D86462A-BB81-4c29-B566-F1C306C59D08}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_RECEIVEHANDLER, CAN_17_MCMCAN_E_DATALOST);
      #endif
      NodeRegAddressPtr->IR.B.RF1L = CAN_17_MCMCAN_ONE;
    }
    /* Set safety loop exit flag with value zero */
    LoopExitFlag = CAN_17_MCMCAN_ZERO;
    /* Read Fill Level value */
    RxFillLvlVal = NodeRegAddressPtr->RX.F1S.B.F1FL;
    /* Check if any of the message received by RXFIFO1 */
    while(LoopExitFlag < RxFillLvlVal)
    {
      /* Read Rx FIFO 1 Get Index */
      RxHandleBuffPos =NodeRegAddressPtr->RX.F1S.B.F1GI;
      /* Invoke data retrieve function */
      Can_17_McmCan_lRxExtractData(HwControllerId,RxHandleBuffPos, \
      CAN_17_MCMCAN_RX_FIFO1, CanCoreState,CanConfig);
      /* Set read Acknowledge of buffer */
      NodeRegAddressPtr->RX.F1A.U = RxHandleBuffPos;
      /* Increment exit loop condition for safety */
      LoopExitFlag++;
      /* Clear Fifo full flag after the read is done */
      NodeRegAddressPtr->IR.B.RF1F = CAN_17_MCMCAN_ONE;
    }
  }
}
#endif /* #if(((CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_OFF))|| \
  (CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON))) */

#if((CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_OFF)))
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lTxEventHandler              **
**                    (                                                       **
**                      const uint8 HwControllerId,                           **
**                     const Can_17_McmCan_CoreStatesType* const CanCoreState,**
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : - This function shall read all the Tx event FIFO       **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HwControllerId - Associated CAN Controller             **
**                     CanConfig - Pointer to CAN driver configuration        **
**                     CanCoreState - Pointer to global structure             **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lTxEventHandler (const uint8 HwControllerId, \
                const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  volatile const Ifx_CAN_TXEVENT *TxEvntReadData;
  const Can_17_McmCan_ControllerMsgRAMConfigType*MsgRamCfgPtr;
  uint32 TxEvntFIFOstartAddr;
  uint32 TxEvntFIFORealAddr;
  uint32 TxEvntFIFOGetIndex;
  Can_HwHandleType TxHandleIndx;
  uint8 TxEvntFillLvlVal;
  uint8 LoopExitFlag;
  uint16 SwObjIndx;

  /* Set pointer variable with Message RAM Configuration structure */
  MsgRamCfgPtr = CanConfig->CanControllerMsgRAMMapConfigPtr;
  /* Read the exact Node Start address */
  NodeRegAddressPtr =
    CanConfig->CanControllerConfigPtr[HwControllerId].CanNodeAddress;
  /* Set Tx Event FIFO Start Address */
  TxEvntFIFOstartAddr =
    MsgRamCfgPtr[HwControllerId].CanControllerMsgRAMMap[CAN_17_MCMCAN_FIVE];
  /* Set safety loop exit flag with value zero */
  LoopExitFlag = CAN_17_MCMCAN_ZERO;
  /* Read Fill Level value */
  TxEvntFillLvlVal =  NodeRegAddressPtr->TX.EFS.B.EFFL;
  /*[cover parentID={5B6E431C-9DFA-4ba3-8C9B-04CEE48021CB}]
  Read Tx event FIFO register for read No of stored Events
  [/cover]*/
  while((CAN_17_MCMCAN_ZERO != TxEvntFillLvlVal)&& \
    (CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE > LoopExitFlag))
  {
    /* Read TxEvent buffer index */
    TxEvntFIFOGetIndex = NodeRegAddressPtr->TX.EFS.B.EFGI;
    /* Set Real Event FIFO element address */
    TxEvntFIFORealAddr = TxEvntFIFOstartAddr + (TxEvntFIFOGetIndex * \
                                   (uint32)CAN_17_MCMCAN_EIGHT);
    /* Load EventFIFO element address */
    /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
    cast the address of Tx Event Type to the event elements  structure type */
    /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
    integer type. Permitted for special function registers.*/
    TxEvntReadData = (volatile Ifx_CAN_TXEVENT*) TxEvntFIFORealAddr;
    /* Read Message Marker */
    TxHandleIndx = (Can_HwHandleType) TxEvntReadData->E1.B.MM;
    /* Calculate Sw Obj Handle index */
    SwObjIndx = (uint16)((HwControllerId * \
      CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ TxHandleIndx);
    /* Set with Exact PduHandle Stored Index value */
    /*[cover parentID={CF5C13A2-E51C-4f13-8152-B8B4591F3FFF}]
      Call Transmission confirmation to upper-layer with L-PDU handle
     [/cover]*/
    CanIf_TxConfirmation(CanCoreState->CanSwObjectHandlePtr[SwObjIndx]);
    /* Acknowledge shall set to free the Tx Event FIFO */
    NodeRegAddressPtr->TX.EFA.B.EFAI =(uint8) TxEvntFIFOGetIndex;
    /* Increment exit loop condition for safety */
    LoopExitFlag++;
    /* Read Fill Level value */
    TxEvntFillLvlVal =  NodeRegAddressPtr->TX.EFS.B.EFFL;
  }
}
#endif /* #if((CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)|| \
  ((CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)&& \
  (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_OFF))) */

