liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lBusOffHandler               **
**                    (                                                       **
**                      const uint8 HwControllerId,                           **
**                      Can_17_McmCan_CoreStatesType* const CanCoreState,     **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : The function used to handle the controller while in    **
**                    bus-off state                                           **
**                                                                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HwControllerId - Associated CAN Controller             **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lBusOffHandler(const uint8 HwControllerId,
              const Can_17_McmCan_CoreStatesType* const CanCoreState,
               const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  const volatile Ifx_CAN_N *NodeRegAddressPtr;
  Ifx_UReg_32Bit TempInitStatus;
  uint8 LogicalHwControllerId;

  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
               CanConfig->CanControllerConfigPtr[HwControllerId].CanNodeAddress;
  /* Read Controller mode status */
  TempInitStatus = NodeRegAddressPtr->CCCR.B.INIT;
  /* [cover parentID={D5432A7A-C352-4415-9D98-2EF0777415BC}]
  Controller in Bus OFF state
  [/cover] */
  /* Check the M_CAN is in BusOff state or not */
  if((CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->PSR.B.BO) && \
      (CAN_17_MCMCAN_BIT_SET_VAL == TempInitStatus))
  {
    /* [cover parentID={E538497B-FAF6-4ab2-B3BE-D071E5CB386D}]
    [/cover] */
    /* invoke function to cancel all pending request */
    Can_17_McmCan_lCancelPendingTx(HwControllerId,CanCoreState,CanConfig);

    /* [cover parentID={CD1DD19F-D41B-4aa2-B119-CA627803E165}]
    Set Controller mode to CANIF_CS_STOPPED state
    [/cover] */
    /* Set controller mode with STOP state */
    CanCoreState->CanControllerModePtr[HwControllerId] = CANIF_CS_STOPPED;
    LogicalHwControllerId = CanConfig->CanControllerIndexingPtr[HwControllerId];
    /* [cover parentID={838455CD-FCFA-45e0-B4C7-8FBEBACB92A0}]
    Call Bus_Off notification function to notify upper layer
    [/cover] */
    /* Call Bus_Off notification function to notify upper layer */
    CanIf_ControllerBusOff(LogicalHwControllerId);
  }
}

#if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           :  void Can_17_McmCan_lTxPeriodHandler                   **
**                    (                                                       **
**                      const uint8 HthRefPeriods                             **
**                    )                                                       **
**                                                                            **
**  Description      :  Function used for handling Tx confirmation process    **
**                      with multiple write period                            **
**                                                                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HthRefPeriods - The write operation cyclic period      **
**                    configuration index                                     **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_lTxPeriodHandler (const uint8 HthRefPeriods)
{
  /* [cover parentID={F9523C12-9D77-4f10-9665-B61721931A56}]
  [/cover] */
#if(CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)
  /* Variable holding the core index value */
  uint8 CoreIndex;
  /* Det check status */
  Std_ReturnType ApiStatus;
  Std_ReturnType SwObjFound;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  volatile const Ifx_CAN_TXEVENT *TxEvntReadData;
  const Can_17_McmCan_ControllerMsgRAMConfigType*MsgRamCfgPtr;
  uint8  CtrlIndex;
  uint8 TxHandleIndx;
  uint32 TxEvntFIFOstartAddr;
  uint32 TxEvntFIFORealAddr;
  uint32 TxEvntFIFOGetIndex;
  uint8 TxEvntFillLvlVal;
  uint8 LoopExitFlag;
  uint16 SwObjIndx;
  uint8 count_i;
  uint8 count;
  uint8 TxCount[CAN_17_MCMCAN_NOOF_CONTROLLER] ={0};

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* [cover parentID={9620144A-4BA4-458c-A9FD-09C720111CBA}]
  [/cover] */
  /* Check if status is initilaized */
  ApiStatus = \
    Can_17_McmCan_lMainDetUninitConfig(CAN_17_MCMCAN_SID_MAINFUNCTIONWRITE, \
    CoreIndex);

