liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* Check if ref period is configured for current core */
  /* [cover parentID={20BD2FAC-8864-420e-8B8A-186261C0E038}]
  [/cover] */
  if((E_NOT_OK != ApiStatus) && (CAN_17_MCMCAN_NO_HOH_VAL == \
    Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex]-> \
    CanHthPeriodIndexPtr[HthRefPeriods]))
  {
    ApiStatus = E_NOT_OK;
  }
  if(E_NOT_OK != ApiStatus)
  {
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Set pointer variable with Message RAM Configuration structure */
    MsgRamCfgPtr = CanConfig->CanControllerMsgRAMMapConfigPtr;
    /* [cover parentID={49A0E288-32A0-462c-AFE0-4207196A3F32}]
    Call transmit handler function for each of the CAN controllers
    configured as POLLING mode for transmission successful event handling
    [/cover] */
    for(CtrlIndex = CAN_17_MCMCAN_ZERO;CtrlIndex < CanConfig->CanCoreContCnt; \
      CtrlIndex++)
    {
      /* [cover parentID={D5C52A11-422E-4504-A1A2-10893B61A054}]
      Requested controller transmit event handling is of polling type
      and the controller mode is STARTED
      Check the Tx processing is configured as POLLING
      [/cover] */
      if((CAN_17_MCMCAN_POLLING == \
       CanConfig->CanEventHandlingConfigPtr[CtrlIndex]. \
       CanEventType[CAN_17_MCMCAN_ZERO]) \
       && (CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CtrlIndex]))
      {
        /* Reset the message order count */
        TxCount[CtrlIndex] = CAN_17_MCMCAN_ZERO;
        count = CAN_17_MCMCAN_ZERO;
        /* search through controller specific Tx buffer priority list */
        while(count<CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)
        {
          /* retrive the Sw object hanle for the current priority */
          SwObjIndx = CanCoreState->CanTxSwObjPriorityPtr[((CtrlIndex * \
            CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE) + count)];
          /* [cover parentID={FD9AF92F-CDD0-44ba-825E-984E8949287A}]
          check if priority state is filled with valid sw handle
          [/cover] */
          if(CAN_17_MCMCAN_MAX_SWOBJECT_INDEX == SwObjIndx)
          {
            /* Reset the message order count */
            TxCount[CtrlIndex] = count;
            count = (uint8)CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE;
          }
          else
          {
            /* [cover parentID={D8CCA0AD-8BA9-4ee8-AA91-A2227D82A00D}]
            check if the sw object handle is configured for this period
            [/cover] */
            SwObjFound = Can_17_McmCan_lPeriodCheckSwHandle(CtrlIndex, \
              SwObjIndx, HthRefPeriods,CanConfig, CanCoreState);
            if(E_OK == SwObjFound)
            {
              /* [cover parentID={651FFA17-3769-4d8a-A842-91AE71DD65E7}]
              update Sw handle priority list
              [/cover] */
              for(count_i = count;count_i< \
                (CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE - CAN_17_MCMCAN_ONE); \
                count_i++)
              {
                CanCoreState->CanTxSwObjPriorityPtr[((CtrlIndex * \
                  CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE) + count_i)] =
                  CanCoreState->CanTxSwObjPriorityPtr[((CtrlIndex * \
                  CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE) + count_i + \
                  CAN_17_MCMCAN_ONE)];
                CanCoreState->CanTxSwObjPriorityPtr[((CtrlIndex * \
                  CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE) + count_i + \
                  CAN_17_MCMCAN_ONE)] = CAN_17_MCMCAN_MAX_SWOBJECT_INDEX;
              }
              /* Reset the message order count */
              TxCount[CtrlIndex] = count;
            }
            else
            {
              /* Reset the message order count */
              TxCount[CtrlIndex] = count + CAN_17_MCMCAN_ONE;
            }
          }
          count++;
        }
        /* [cover parentID={CAD339A2-658C-4155-96B9-AAB45420B169}]
        Invoke Transmit Handler
        [/cover] */
        /* [cover parentID={214D632C-55DF-4d73-9AC6-3350D140EEBB}]
        Invoke Transmit Handler
        [/cover] */
        /* Read the exact Node Start address */
        NodeRegAddressPtr = \
          CanConfig->CanControllerConfigPtr[CtrlIndex].CanNodeAddress;
        /* Set Tx Event FIFO Start Address */
        TxEvntFIFOstartAddr = \
          MsgRamCfgPtr[CtrlIndex].CanControllerMsgRAMMap[CAN_17_MCMCAN_FIVE];
        /* Set safety loop exit flag with value zero */
        LoopExitFlag = CAN_17_MCMCAN_ZERO;
        /* Read Fill Level value */
        TxEvntFillLvlVal =  NodeRegAddressPtr->TX.EFS.B.EFFL;

        /* [cover parentID={36F56C52-C9EA-465d-96B2-5F50A2FB6BDB}]
        Read Tx event FIFO register for read No of stored Events
        [/cover] */
        while((CAN_17_MCMCAN_ZERO != TxEvntFillLvlVal)&& \
          (CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE > LoopExitFlag))
        {
          /* Read TxEvent buffer index */
          TxEvntFIFOGetIndex = NodeRegAddressPtr->TX.EFS.B.EFGI;
          /* Set Real Event FIFO element address */
          TxEvntFIFORealAddr = TxEvntFIFOstartAddr + \
            (TxEvntFIFOGetIndex * (uint32)CAN_17_MCMCAN_EIGHT);
          /* Load EventFIFO element address */
          /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to cast
          the address of Tx Event Type to the event elements  structure type */
          /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
          integer type. Permitted for special function registers.*/
          TxEvntReadData = (volatile Ifx_CAN_TXEVENT*) TxEvntFIFORealAddr;
          /* Read Message Marker */
          TxHandleIndx = (uint8)(TxEvntReadData->E1.B.MM);
          /* Calculate Sw Obj Handle index */
          SwObjIndx = (uint16)(CtrlIndex * \
            CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ TxHandleIndx;
          SwObjFound = Can_17_McmCan_lPeriodCheckSwHandle(CtrlIndex, \
            SwObjIndx, HthRefPeriods, CanConfig, CanCoreState);
          /* [cover parentID={4040DC33-C6A8-4ae5-86D7-932555453881}]
          Check if Sw Obj Handle index is valid
          [/cover] */
          if(E_OK != SwObjFound)
          {
            CanCoreState->CanTxSwObjPriorityPtr[((CtrlIndex * \
              CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE) + \
              TxCount[CtrlIndex])] = SwObjIndx;
            TxCount[CtrlIndex] = TxCount[CtrlIndex] + CAN_17_MCMCAN_ONE;
          }
          /* Acknowledge shall set to free the Tx Event FIFO */
          NodeRegAddressPtr->TX.EFA.B.EFAI =(uint8) TxEvntFIFOGetIndex;
          /* Increment exit loop condition for safety */
          LoopExitFlag++;
          /* Read Fill Level value */
          TxEvntFillLvlVal =  NodeRegAddressPtr->TX.EFS.B.EFFL;
        }
      }
    }
  }
#endif /* #if(CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON) */
}
#endif /* #if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)) */

#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON) && \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/*******************************************************************************
**                                                                            **
**  Syntax           :  Std_ReturnType Can_17_McmCan_lPeriodCheckSwHandle     **
**                    (                                                       **
**                      const uint8 CtrlIndex,                                **
**                      const uint16 SwObjIndx,                               **
**                      const uint8 HthRefPeriods,                            **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig,  **
**                      const Can_17_McmCan_CoreStatesType* const CanCoreState**
**                    )                                                       **
**                                                                            **
**  Description      :  Function used for handling Tx confirmation according  **
**                      to the multiple write period called                   **
**                                                                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : HthRefPeriods - The write operation cyclic period      **
**                    configuration index                                     **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lPeriodCheckSwHandle( \
   const uint8 CtrlIndex, \
   const uint16 SwObjIndx, const uint8 HthRefPeriods, \
   const Can_17_McmCan_CoreConfigType* const CanConfig, \
   const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  const Can_17_McmCan_PeriodHthMaskConfigType *HthPeriodInfo;
  const Can_17_McmCan_HthMaskObjectConfigType *HthConfigInfo;
#if(CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  const Can_17_McmCan_ControllerMsgRAMConfigType*MsgRamCfgPtr;
#endif
  Std_ReturnType SwObjFound;
  Can_HwHandleType  HthCnt;
  Can_HwHandleType  HthStartIndx;
  Can_HwHandleType  HthEndIndx;
  uint8 CoreHthRefPeriod;
  uint8  HwControllerId;
  uint8  CoreControllerId;
  Can_HwHandleType TxHandleIndx;
  uint8 HthMaskVal;
  uint16 SwObjIndxCalc;
  Can_HwHandleType CoreSpecHth;
#if(CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  uint8 CoreTxQueueSize;
  Can_HwHandleType HthIndex;
#endif
  Can_17_McmCan_TxBufferType BufferType;

  /* Set pointer with HTH period set information */
  HthPeriodInfo = CanConfig->CanPeriodHthMaskConfigPtr;
  /* Set pointer with HTH period handler information */
  HthConfigInfo = CanConfig->CanHthMaskObjectConfigPtr;
  /* Retrieve Core specific Hth period reference index */
  CoreHthRefPeriod = CanConfig->CanHthPeriodIndexPtr[HthRefPeriods];
  /* Read the cyclic corresponding handler first index */
  HthStartIndx = HthPeriodInfo[CoreHthRefPeriod].CanPerHthStartIndx;
  /* Read the cyclic corresponding handler first index */
  HthEndIndx = HthPeriodInfo[CoreHthRefPeriod].CanPerHthEndIndx;
#if(CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  /* Set pointer variable with Message RAM Configuration structure */
  MsgRamCfgPtr = CanConfig->CanControllerMsgRAMMapConfigPtr;
#endif
  /* Reset object found flag */
  SwObjFound = E_NOT_OK;
  HthCnt = HthStartIndx;
  /* [cover parentID={C784F5C2-29A8-4563-B083-DD0C6C59AB6D}]
  Read all the HTH  status corresponding with period
  [/cover] */
  while((HthCnt<(HthStartIndx + HthEndIndx))&&(E_NOT_OK == SwObjFound))
  {
    /* Read Hw associated with HTH */
    HwControllerId = HthConfigInfo[HthCnt].HwControllerId;
    /* retrive core specific controller index */
    CoreControllerId = Can_17_McmCan_kGblConfigPtr-> \
      CanLogicalControllerIndexPtr[HwControllerId].CanLCoreSpecContIndex;
    /* [cover parentID={B51CC71A-A81C-410c-A169-A9C89D1F99F2}]
    Check If Controller Id is configured
    [/cover] */
    if(CoreControllerId == CtrlIndex)
    {
      TxHandleIndx = HthConfigInfo[HthCnt].CanPerHthHwObjId - \
        Can_17_McmCan_kGblConfigPtr->CanNoOfHrh;
      /* Retrive core specific Hth of the hardware object */
      CoreSpecHth = Can_17_McmCan_kGblConfigPtr-> \
        CanHthIndexPtr[TxHandleIndx].CanHthCoreSpecIndex;
      /* Read Mask value */
      HthMaskVal = CanConfig->CanTxHwObjectConfigPtr[CoreSpecHth]. \
        CanTxBuffIndx;
      /* Retrive core specific Hth of the hardware object */
      BufferType = \
        CanConfig->CanTxHwObjectConfigPtr[CoreSpecHth].CanTxBufferType;
      /* [cover parentID={8F959ADA-A11D-4904-93C2-3EC18A61E061}]
      Check if buffer is dedicated buffer
      [/cover] */
      if(CAN_17_MCMCAN_TX_DED_BUFFER == BufferType)
      {
        /* Calculate Sw Obj Handle index */
        SwObjIndxCalc = (uint16)((CoreControllerId * \
          CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ HthMaskVal);
        /* [cover parentID={DFEEDF20-9DC4-4ecf-9565-DF85B91C3331}]
        Check if calculated SW obj handle is same as configuredSW obj handle
        [/cover] */
        if(SwObjIndx == SwObjIndxCalc)
        {
          /* Set with Exact PduHandle Stored Index value */
          /* Call Transmission confirmation to upper-layer with L-PDU handle */
          CanIf_TxConfirmation(CanCoreState->CanSwObjectHandlePtr[SwObjIndx]);
          /* handler configured for this period in the current core */
          SwObjFound = E_OK;
        }
      }
#if(CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
      else
      {
        CoreSpecHth = MsgRamCfgPtr[CoreControllerId].CanTxDedBuffCount;
        CoreTxQueueSize = MsgRamCfgPtr[CoreControllerId].CanTxQueueSize;
        HthIndex = CoreSpecHth;
        /* [cover parentID={4FB9A88A-0256-4351-86F3-45DAFE253A11}]
        Scan through Hth buffers used
        [/cover] */
        while((HthIndex<(CoreSpecHth + CoreTxQueueSize))&& \
          (E_NOT_OK == SwObjFound))
        {
          /* Calculate Sw Obj Handle index */
          SwObjIndxCalc = (uint16)((CoreControllerId * \
            CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ HthIndex);
          /* [cover parentID={03A928B4-9D15-41ed-AE04-2CDB1043F16F}]
          Check ifcalculated SW obj handle is same as configured SW obj handle
          [/cover] */
          if(SwObjIndx == SwObjIndxCalc)
          {
            /* Set with Exact PduHandle Stored Index value */
            /* Call Transmission confirmation to upper-layer with L-PDU handle*/
            CanIf_TxConfirmation(CanCoreState->CanSwObjectHandlePtr[SwObjIndx]);
            /* handler configured for this period in the current core */
            SwObjFound = E_OK;
          }
          HthIndex ++;
        }
      }
#endif
    }
    HthCnt++;
  }
  return SwObjFound;
}
#endif /* #if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON) && \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)) */

