liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_ON)
/*CYCLOMATIC_Can_17_McmCan_lRxPeriodHandler_JUSTIFICATION: This Function has
cyclomatic Complexity of 18 which is handling Rx mainfunction periods.
*/
/*******************************************************************************
**                                                                            **
**  Syntax           : void Can_17_McmCan_lRxPeriodHandler                    **
**                    (                                                       **
**                      const uint8 HrhRefPeriods                             **
**                    )                                                       **
**                                                                            **
**  Description      :  Function used for handling Rx indication process with **
**                     multiple read period                                   **
**                                                                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : HrhRefPeriods - The read operation cyclic period       **
**                    configuration index                                     **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_lRxPeriodHandler (const uint8 HrhRefPeriods)
{
#if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)
  const  Can_17_McmCan_PeriodHrhMaskConfigType *HrhPeriodInfo;
  const  Can_17_McmCan_HrhMaskObjectConfigType *HrhConfigInfo;
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 CoreHrhRefPeriod;
  uint32 HrhMaskVal_0;
  uint32 HrhMaskVal_1;
  uint32 RxDedMask;
  Can_HwHandleType  HrhCnt;
  uint8  RxHandleBuffPos;
  Can_HwHandleType  HrhStartIndx;
  Can_HwHandleType  HrhEndIndx;
  uint8  ControllerId;
  uint8 HwControllerId;
  uint8 RxFillLvlVal;
  uint8 LoopExitFlag;
  uint8 CoreIndex;
  uint32 RxNDATValue0;
  uint32 RxNDATValue1;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;
  /* Det check status */
  Std_ReturnType ApiStatus;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* Check if status is initilaized */
  ApiStatus = Can_17_McmCan_lMainDetUninitConfig( \
  CAN_17_MCMCAN_SID_MAINFUNCTIONREAD, CoreIndex);

  /* Check if ref period is configured for current core */
  if((E_NOT_OK != ApiStatus) && (CAN_17_MCMCAN_NO_HOH_VAL == \
    Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex]-> \
    CanHrhPeriodIndexPtr[HrhRefPeriods]))
  {
    ApiStatus = E_NOT_OK;
  }
/* [cover parentID={BD1836E8-2694-4150-B9FE-90BC6E72746A}]
  Is Status OK
  [/cover] */

  if(E_OK == ApiStatus)
  {
    /* Local copy of the core specific configuration */
    CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
    /* Local copy of the core specific global states */
    CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
    /* Set pointer with Hrh period set information */
    HrhPeriodInfo = CanConfig->CanPeriodHrhMaskConfigPtr;
    /* Set pointer with Hrh period handler information */
    HrhConfigInfo = CanConfig->CanHrhMaskObjectConfigPtr;
    /* Retrieve Core specific Hrh period reference index */
    CoreHrhRefPeriod = CanConfig->CanHrhPeriodIndexPtr[HrhRefPeriods];
    /* Read the cyclic corresponding handler first index */
    HrhStartIndx = HrhPeriodInfo[CoreHrhRefPeriod].CanPerHrhStartIndx;
    /* Read the cyclic corresponding handler first index */
    HrhEndIndx = HrhPeriodInfo[CoreHrhRefPeriod].CanPerHrhEndIndx;
    /* Read all the Hrh  status corresponding with period */
    for(HrhCnt = HrhStartIndx ; HrhCnt < (HrhStartIndx+HrhEndIndx) ; HrhCnt++)
    {
      /* Read Mask value */
      HrhMaskVal_0 = HrhConfigInfo[HrhCnt].CanPerRxbufferMaskvalue0;
      /* Read Mask value */
      HrhMaskVal_1 = HrhConfigInfo[HrhCnt].CanPerRxbufferMaskvalue1;
      /* Read Hw associated with Hrh */
      HwControllerId = HrhConfigInfo[HrhCnt].HwControllerId;
      /* retrive core specific controller index */
      ControllerId = Can_17_McmCan_kGblConfigPtr-> \
        CanLogicalControllerIndexPtr[HwControllerId].CanLCoreSpecContIndex;
      /* Read the exact Node Start address */
      NodeRegAddressPtr = \
        CanConfig->CanControllerConfigPtr[ControllerId].CanNodeAddress;
      /* Check the buffer Type  */
      /* [cover parentID={5C1C012B-3DE4-40ec-B3EA-7116FC36ED2F}]
      Is dedicated buffer
      [/cover] */
      if(CAN_17_MCMCAN_RX_DED_BUFFER == \
         HrhConfigInfo[HrhCnt].CanPerHrhBufferType)
      {
        RxNDATValue0 = NodeRegAddressPtr->NDAT1.U;
        RxNDATValue1 = NodeRegAddressPtr->NDAT2.U;
        if((HrhMaskVal_0 != CAN_17_MCMCAN_ZERO)&& \
          (HrhMaskVal_0 == (RxNDATValue0 & HrhMaskVal_0)))
        {
          /* Set mask value */
          RxDedMask = CAN_17_MCMCAN_ONE;
          /* Set with first bit position*/
          RxHandleBuffPos = CAN_17_MCMCAN_ZERO;
          while(HrhMaskVal_0 != RxDedMask)
          {
            /* Increment bit position */
            RxHandleBuffPos++;
            /* Set mask for check next buffer status */
            RxDedMask = CAN_17_MCMCAN_REG_ONE << RxHandleBuffPos;
          }
          /* Call receive data extract fucntion */
           Can_17_McmCan_lRxExtractData(ControllerId,RxHandleBuffPos, \
           CAN_17_MCMCAN_RX_DED_BUFFER, CanCoreState,CanConfig);
          /* Clear NDAT Register for receive new message */
          NodeRegAddressPtr->NDAT1.U = HrhMaskVal_0;
        }
        if ((HrhMaskVal_1 != CAN_17_MCMCAN_ZERO)&& \
          (HrhMaskVal_1 == (RxNDATValue1 & HrhMaskVal_1)))
        {
          /* Set mask value */
          RxDedMask = CAN_17_MCMCAN_ONE;
          /* Set with first bit position*/
          RxHandleBuffPos = CAN_17_MCMCAN_ZERO;
          while(HrhMaskVal_1 != RxDedMask)
          {
            /* Increment bit position */
            RxHandleBuffPos++;
            /* Set mask for check next buffer status */
            RxDedMask = CAN_17_MCMCAN_REG_ONE << RxHandleBuffPos;
          }
          /* Set for read data from NDAT1 buffer */
          RxHandleBuffPos = RxHandleBuffPos + CAN_17_MCMCAN_THIRTY_TWO;
          /* Call receive data extract fucntion */
          Can_17_McmCan_lRxExtractData(ControllerId,RxHandleBuffPos, \
          CAN_17_MCMCAN_RX_DED_BUFFER, CanCoreState,CanConfig);
          NodeRegAddressPtr->NDAT2.U = HrhMaskVal_1;
        }
      }
      /* [cover parentID={91F6FD81-C285-4e08-B5E5-7BC8253B0A7C}]
      Is buffer type FIFO0
      [/cover] */
      if(CAN_17_MCMCAN_RX_FIFO0 == HrhConfigInfo[HrhCnt].CanPerHrhBufferType)
      {
        /* Check Received CAN message is lost or not */
        /* [cover parentID={BBE313D4-5537-4f9b-8683-99753C26283F}]
        [/cover] */
        if(CAN_17_MCMCAN_BIT_CLEAR_VAL != NodeRegAddressPtr->RX.F0S.B.RF0L)
        {
          #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
          /* Report to DET */
          Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
            CAN_17_MCMCAN_SID_RECEIVEHANDLER, CAN_17_MCMCAN_E_DATALOST);
          #endif
          NodeRegAddressPtr->IR.B.RF0L = CAN_17_MCMCAN_ONE;
        }
        /* Set safety loop exit flag with value zero */
        LoopExitFlag = CAN_17_MCMCAN_ZERO;
        /* Read Fill Level value */
        RxFillLvlVal = NodeRegAddressPtr->RX.F0S.B.F0FL;
        /* Check if any of the message received by RXFIFO0 */
        while(LoopExitFlag < RxFillLvlVal)
        {
          /* Read Rx FIFO 0 Get Index */
          RxHandleBuffPos = NodeRegAddressPtr->RX.F0S.B.F0GI;
          /* Invoke data retrieve function */
          Can_17_McmCan_lRxExtractData(ControllerId,RxHandleBuffPos, \
            CAN_17_MCMCAN_RX_FIFO0,CanCoreState,CanConfig);
          /* Set read Acknowledge of buffer */
          NodeRegAddressPtr->RX.F0A.B.F0AI = RxHandleBuffPos;
          /* Increment exit loop condition for safety */
          LoopExitFlag++;
          /* Clear Fifo full flag after the read is done */
          NodeRegAddressPtr->IR.B.RF0F = CAN_17_MCMCAN_ONE;
        }
      }
      /* [cover parentID={53C50D54-8F17-4b3d-9F2E-ADDE8BC15AD5}]
      Is buffer type FIFO1
      [/cover] */
      if(CAN_17_MCMCAN_RX_FIFO1 == HrhConfigInfo[HrhCnt].CanPerHrhBufferType)
      {
        /* Check Received CAN message is lost or not */
        /* [cover parentID={F27F0069-159A-4820-9AD2-2A642DDA0FCA}]
        [/cover] */
        if(CAN_17_MCMCAN_BIT_CLEAR_VAL != NodeRegAddressPtr->RX.F1S.B.RF1L)
        {
          #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
          /* Report to DET */
          Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
            CAN_17_MCMCAN_SID_RECEIVEHANDLER, CAN_17_MCMCAN_E_DATALOST);
          #endif

          NodeRegAddressPtr->IR.B.RF1L = CAN_17_MCMCAN_ONE;
        }
        /* Set safety loop exit flag with value zero */
        LoopExitFlag = CAN_17_MCMCAN_ZERO;
        /* Read Fill Level value */
        RxFillLvlVal = NodeRegAddressPtr->RX.F1S.B.F1FL;
        /* Check if any of the message received by RXFIFO1 */
        while(LoopExitFlag < RxFillLvlVal)
        {
          /* Read Rx FIFO 1 Get Index */
          RxHandleBuffPos = NodeRegAddressPtr->RX.F1S.B.F1GI;
          /* Invoke data retrieve function */
          Can_17_McmCan_lRxExtractData(ControllerId,RxHandleBuffPos, \
            CAN_17_MCMCAN_RX_FIFO1,CanCoreState,CanConfig);
          /* Set read Acknowledge of buffer */
          NodeRegAddressPtr->RX.F1A.B.F1AI = RxHandleBuffPos;
          /* Increment exit loop condition for safety */
          LoopExitFlag++;
          /* Clear Fifo full flag after the read is done */
          NodeRegAddressPtr->IR.B.RF1F = CAN_17_MCMCAN_ONE;
        }
      }
    }
  }
#endif /* #if (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON) */
}
#endif /* #if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_ON) */

