liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lCancelPendingTx       **
**                    (                                                       **
**                      const uint8 ControllerId,                             **
**                      const Can_17_McmCan_CoreStatesType* const CanCoreState**
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : This function is used for the cancellation of          **
**                    Transmission,If there any Tx buffer with pending        **
**                    transmission request.                                   **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId - Associated CAN Controller               **
**                     CanCoreState - Pointer to global structure             **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lCancelPendingTx (const uint8 ControllerId, \
              const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                    const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint32 TxPendingStatus;
  uint16 TxHwIndex;
  uint16 SwObjIndx;

  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
    CanConfig->CanControllerConfigPtr[ControllerId].CanNodeAddress;
  if(NULL_PTR != CanConfig->CanTxHwObjectConfigPtr)
  {
    for (TxHwIndex = CAN_17_MCMCAN_ZERO; TxHwIndex < \
      CAN_17_MCMCAN_MAX_TX_BUFFER_INDEX;TxHwIndex++)
    {
      /* Calculate Sw Obj Handle index */
      SwObjIndx = (uint16)((ControllerId * \
        CAN_17_MCMCAN_NOOF_TX_HW_BUFF_AVAILABLE)+ TxHwIndex);
      CanCoreState->CanSwObjectHandlePtr[SwObjIndx] = CAN_17_MCMCAN_ZERO;
#if ((CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)&& \
     (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
      CanCoreState->CanTxSwObjPriorityPtr[SwObjIndx] = \
        CAN_17_MCMCAN_MAX_SWOBJECT_INDEX;
#endif
    }
    /* [cover parentID={C926FB6D-5374-4b43-AA64-CFA53B46FAF2}]
    Check for pending request
    [/cover] */
    /* Check for pending request */
    if(CAN_17_MCMCAN_DATA_ZERO != NodeRegAddressPtr->TX.BRP.U)
    {
      /* Read Pending Tx Request for buffer */
      TxPendingStatus = NodeRegAddressPtr->TX.BRP.U;
      /* Set the pending request with cancellation request */
      NodeRegAddressPtr->TX.BCR.U = TxPendingStatus;
    }
  }
}

/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lClearReceivedMsg            **
**                    (                                                       **
**                      const uint8 HwControllerId,                           **
**                      const Can_17_McmCan_CoreConfigType* const CanConfig   **
**                    )                                                       **
**                                                                            **
**  Description      : Clears receive message objects to avoid any unintended **
**                    notification                                            **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : ControllerId - Associated CAN Controller               **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void  Can_17_McmCan_lClearReceivedMsg(const uint8 HwControllerId,
                     const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 RxHandleBuffPos;
  uint8 RxFillLvlVal;
  uint8 LoopExitFlag;

  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
               CanConfig->CanControllerConfigPtr[HwControllerId].CanNodeAddress;
  /* Dedicated Rx Message checks */
  /* [cover parentID={6507E831-08CA-4078-884E-FEF5E67DCC9F}]
  [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanConfig-> \
    CanControllerMsgRAMMapConfigPtr[HwControllerId]. \
      CanControllerMsgRAMMap[CAN_17_MCMCAN_FOUR])
  {
    /* Check if any of the message received by dedicated buffer NDAT1 */
    if(CAN_17_MCMCAN_DATA_ZERO != NodeRegAddressPtr->NDAT1.U)
    {
      /* Clear the Register */
      NodeRegAddressPtr->NDAT1.U = CAN_17_MCMCAN_CLEAR_NEWDATA_REG;
    }
    /* Check if any of the message received by dedicated buffer NDAT2 */
    if(CAN_17_MCMCAN_DATA_ZERO != NodeRegAddressPtr->NDAT2.U)
    {
      /* Clear the Register */
      NodeRegAddressPtr->NDAT2.U = CAN_17_MCMCAN_CLEAR_NEWDATA_REG;
    }
  }
  /* RxFIFO0 Message checks */
  /* [cover parentID={7DAB05D7-ACE9-4891-9BC9-103699A8D80F}]
  RxFIFO0 Message checks
  [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanConfig-> \
    CanControllerMsgRAMMapConfigPtr[HwControllerId]. \
      CanControllerMsgRAMMap[CAN_17_MCMCAN_TWO])
  {
    /* Set safety loop exit flag with value zero */
    LoopExitFlag = CAN_17_MCMCAN_ZERO;
    /* Read Fill Level value */
    RxFillLvlVal = NodeRegAddressPtr->RX.F0S.B.F0FL;
    /* Check if any of the message received by RXFIFO0 */
    while(RxFillLvlVal > LoopExitFlag)
    {
      /* Read Rx FIFO 0 Get Index */
      RxHandleBuffPos = NodeRegAddressPtr->RX.F0S.B.F0GI;
      /* Set read Acknowledgement of buffer */
      NodeRegAddressPtr->RX.F0A.U = RxHandleBuffPos;
      /* Increment loop exit flag */
      LoopExitFlag++;
    }
  }
  /* RxFIFO1 Message checks */
  /* [cover parentID={ACD4DD5E-3FD6-476c-BD26-703E849459D2}]
  RxFIFO1 Message checks
  [/cover] */
  if(CAN_17_MCMCAN_ADDRESS_CHECK != CanConfig-> \
     CanControllerMsgRAMMapConfigPtr[HwControllerId]. \
       CanControllerMsgRAMMap[CAN_17_MCMCAN_THREE])
  {
    /* Set safety loop exit flag with value zero */
    LoopExitFlag = CAN_17_MCMCAN_ZERO;
    /* Read Fill Level value */
    RxFillLvlVal = NodeRegAddressPtr->RX.F1S.B.F1FL;
    /* Check if any of the message received by RXFIFO1 */
    while(RxFillLvlVal > LoopExitFlag)
    {
      /* Read Rx FIFO 0 Get Index */
      RxHandleBuffPos = NodeRegAddressPtr->RX.F1S.B.F1GI;
      /* Set read Acknowledge of buffer */
      NodeRegAddressPtr->RX.F1A.U = RxHandleBuffPos;
      /* Increment loop exit flag */
      LoopExitFlag++;
    }
  }
}

