liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lTimeOut           **
**                    (                                                       **
**                      const volatile uint32* const Can_RegAddress,          **
**                      const uint32 Check_Val,                               **
**                      const boolean CheckStatus                             **
**                    )                                                       **
**                                                                            **
**  Description      : This service for a time-out detection in case the      **
**                    hardware doesn't react in the expected time             **
**                    (hardware error) to prevent endless loops.              **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : Can_RegAddress- The address of register which value    **
**                    shall be check.                                         **
**                    Check_Val- The value which is used for comparing with   **
**                    Register value.                                         **
**                    CheckStatus- used for identify the comparison method    **
**                    Method.                                                 **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK: Hw written successfully                          **
**                    E_NOT_OK: Hw is not set with requested value            **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lTimeOut ( \
  const volatile uint32* const Can_RegAddress, \
  const uint32 Check_Val, const Can_17_McmCan_TimeoutCheckType CheckStatus)
{
  uint32 TimeOutResolution;
  uint32 TimeOutCount;
  uint32 TimeOutCountInitial;
  uint32 MeasuredTicks;
  Std_ReturnType TimeOutStatus;

  /* Set with Dem event is reported */
  TimeOutStatus = E_NOT_OK;
  /* Read the delay calibration Time */
  TimeOutResolution = Mcal_DelayTickResolution();

  /* calculate actual delay span */
  TimeOutCount =  (uint32)CAN_17_MCMCAN_TIMEOUT_DURATION / TimeOutResolution ;
  /* Wait for Hardware Loop time-out to check  the setting status of
     status register */
  /* Set with initial value */
  TimeOutCountInitial = Mcal_DelayGetTick();
  do
  {
    /* Count the elapsed time */
    MeasuredTicks = Mcal_DelayGetTick() - TimeOutCountInitial;
    /* [cover parentID= {AF7A0560-C039-4dec-B95A-25D6CFB11C21}]
    Is Status True
    [/cover] */
    /*[cover parentID={DE447DBA-838D-4ca7-83BD-2EC917BD1887}]
    Is Status True
    [/cover]*/
    if(CAN_17_MCMCAN_EQUAL == CheckStatus)
    {
      /* [cover parentID= {941F296F-B7C1-4fa6-9CE7-5569C15E96A9}]
      Is Status True
      [/cover] */
      if(Check_Val == (((uint32)*Can_RegAddress & Check_Val)))
      {
        TimeOutStatus = E_OK;
      }
    }
    else if(CAN_17_MCMCAN_NOT_EQUAL == CheckStatus)
    {
      /* [cover parentID= {4177FD0F-5D7E-481d-B9AA-F8519E55FD5F}]
      Is Status True
      [/cover] */
      if(Check_Val != (((uint32)*Can_RegAddress & Check_Val)))
      {
        TimeOutStatus = E_OK;
      }
    }
    else
    {
      /*CAN_17_MCMCAN_NAND == CheckStatus*/
      /* [cover parentID= {4177FD0F-5D7E-481d-B9AA-F8519E55FD5F}]
      Is Status True
      [/cover] */
      if(CAN_17_MCMCAN_ZERO != (((uint32)*Can_RegAddress) & (Check_Val)))
      {
        TimeOutStatus = E_OK;
      }
    }
  }while ((E_NOT_OK == TimeOutStatus)&& \
    ((TimeOutCount*CAN_17_MCMCAN_HUNDRED) >= MeasuredTicks));

  return TimeOutStatus;
}

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : LOCAL_INLINE void Can_17_McmCan_lActivateIcom          **
**                    (                                                       **
**                       const uint8 Controller ,                             **
**                       const IcomConfigIdType  ConfigurationId,             **
**                       Can_17_McmCan_CoreStatesType * const CanCoreState,   **
**                       const Can_17_McmCan_CoreConfigType * const CanConfig **
**                    )                                                       **
**                                                                            **
**  Description      : Activates CAN pretended networking for a CAN controller**
** [cover parentID={488C84CA-6384-46ea-9B45-C5A8B6FD3931}]                    **
** [/cover]                                                                   **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                    ConfigurationId  - Requested ICOM Configuration         **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE void Can_17_McmCan_lActivateIcom (const uint8 Controller,\
  const IcomConfigIdType ConfigurationId, \
  const Can_17_McmCan_CoreStatesType* const CanCoreState, \
  const Can_17_McmCan_CoreConfigType* const CanConfig)
{

  const Can_17_McmCan_SIDFilterConfigType *CanSIDPtr;
  volatile Ifx_CAN_STDMSG *SIDFilterDataPtr;
  uint32 SIDFilterStartAddr;
  uint32 SIDFilterRealAddr;
  uint16 SIDFiltrStartIndx;
  uint16 SIDFiltrEndIndx;
  uint16 SIDFiltrIndx;
  uint8  SIDOffsetIndx;
  const Can_17_McmCan_XIDFilterConfigType *CanXIDPtr;
  volatile Ifx_CAN_EXTMSG *XIDFilterPtr;
  uint32 XIDFilterStartAddr;
  uint32 XIDFilterRealAddr;
  uint16 XIDFiltrStartIndx;
  uint16 XIDFiltrEndIndx;
  uint16 XIDFiltrIndx;
  uint8  XIDOffsetIndx;

  /* Read the exact Node Start address */
  Ifx_CAN_N *NodeRegAddressPtr = \
                   CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* Check if Wakeup on bus off condition is configured*/
    /* [cover parentID= {364ACACF-B21D-46a6-B2E1-525B11513D49}]
  Check if Wakeup on bus off condition is configured
  [/cover] */
  if (FALSE == Can_17_McmCan_kGblConfigPtr-> \
    CanIcomConfigPtr[ConfigurationId - CAN_17_MCMCAN_ONE].CanIcomWakeOnBusOff)
  {
      /* Check if Wakeup on bus off condition is configured*/
    /* [cover parentID={097D0152-B9A7-4708-B874-F5F51524750A}]
  Bus off interrupt of the current CAN node is enabled or not
  [/cover] */
    if (CAN_17_MCMCAN_INTERRUPT == \
         CanConfig->CanEventHandlingConfigPtr[Controller]. \
         CanEventType[CAN_17_MCMCAN_TWO])
    {
      /* Disable Bus off interrupt of the current CAN node */
      NodeRegAddressPtr->IE.B.BOE = CAN_17_MCMCAN_ZERO;
    }
    /* Set the ICOM Wake on bus off status */
    CanCoreState->CanIcomConfgBOStatusPtr[Controller] = FALSE;
  }
  else
  {
    if (CAN_17_MCMCAN_INTERRUPT == \
         CanConfig->CanEventHandlingConfigPtr[Controller]. \
         CanEventType[CAN_17_MCMCAN_TWO])
    {
      /* Enable Bus off interrupt of the current CAN node */
      NodeRegAddressPtr->IE.B.BOE = CAN_17_MCMCAN_ONE;
    }
    /* Set the ICOM Wake on bus off status */
    CanCoreState->CanIcomConfgBOStatusPtr[Controller] = TRUE;
  }
  /* Check if Wakeup on bus off condition is configured*/
    /* [cover parentID={DA2E1E7C-505A-4863-B084-B08A3887846E}]
  If SID filter is NULL_PTR
  [/cover] */
  if(NULL_PTR != CanConfig-> CanSIDFilterConfigPtr)
  {
    /* Set offset with first element */
    SIDOffsetIndx = CAN_17_MCMCAN_ZERO;

    /* Set SID filter list Address */
    CanSIDPtr = CanConfig->CanSIDFilterConfigPtr;
    /* Set with first SID filter Index */
    SIDFiltrStartIndx = \
         CanConfig->CanControllerConfigPtr[Controller]. \
         CanControllerMOMap[CAN_17_MCMCAN_TWO];
    /* Set with End SID filter Index */
    SIDFiltrEndIndx = \
       CanConfig->CanControllerConfigPtr[Controller]. \
       CanControllerMOMap[CAN_17_MCMCAN_THREE];
    /* Read Standard Identifier filter Start address */
    SIDFilterStartAddr = CanConfig-> \
     CanControllerMsgRAMMapConfigPtr[Controller]. \
     CanControllerMsgRAMMap[CAN_17_MCMCAN_ZERO];
    /* Set with all standard filter configuration */
    for(SIDFiltrIndx = SIDFiltrStartIndx; SIDFiltrIndx < \
         (SIDFiltrStartIndx+SIDFiltrEndIndx); SIDFiltrIndx++)
    {
      /* Set with SID Filter element address */
      SIDFilterRealAddr = SIDFilterStartAddr + (CAN_17_MCMCAN_RAM_BYTES * \
              (uint32)SIDOffsetIndx);
      /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
      cast the address of Standard filter Type to the Standard filter elements
      structure type  */
      /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
      integer type. Permitted for special function registers.*/
      /* Increment for access next filter element */
      SIDFilterDataPtr = (volatile Ifx_CAN_STDMSG*)SIDFilterRealAddr;
        /* [cover parentID={0A4FDBB9-8D20-4320-B5C1-209682BE857A}]
      If Pretended Network OFF
      [/cover] */
      if(FALSE == CanSIDPtr[SIDFiltrIndx].CanSidPNSupport)
      {
        /* Set to Reject Message with Filter element */
        SIDFilterDataPtr->S0.B.SFEC = CAN_17_MCMCAN_ZERO;
      }
      /* Increment for access next filter element */
      SIDOffsetIndx++;
    }
  }
    /* [cover parentID={979410E7-2304-4e71-A0BD-BD924D7C9EA5}]
  If XID filter is NULL_PTR
  [/cover] */
  if(NULL_PTR != CanConfig-> CanXIDFilterConfigPtr)
  {

    /* Set with XID filter list configuration address */
    CanXIDPtr = CanConfig->CanXIDFilterConfigPtr;
    /* Read Extended Identifier filter Start address */
    XIDFilterStartAddr = CanConfig-> \
       CanControllerMsgRAMMapConfigPtr[Controller]. \
       CanControllerMsgRAMMap[CAN_17_MCMCAN_ONE];
    /* Set with start Index */
    XIDFiltrStartIndx = \
      CanConfig->CanControllerConfigPtr[Controller]. \
      CanControllerMOMap[CAN_17_MCMCAN_FOUR];
    /* Set with end Index */
    XIDFiltrEndIndx = \
      CanConfig->CanControllerConfigPtr[Controller]. \
      CanControllerMOMap[CAN_17_MCMCAN_FIVE];
    /* Set OFFSET with first element */
    XIDOffsetIndx = CAN_17_MCMCAN_ZERO;
    /* Set with all Extended filter configuration */
    for(XIDFiltrIndx = XIDFiltrStartIndx; XIDFiltrIndx <
                       (XIDFiltrStartIndx + XIDFiltrEndIndx); XIDFiltrIndx++)
    {
      /* Set address with XID filter element Address */
      XIDFilterRealAddr = XIDFilterStartAddr + ((uint32)CAN_17_MCMCAN_EIGHT * \
                   (uint32)XIDOffsetIndx);
      /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to cast the
      address of Extended filter Type to the extended filter elements  structure
      type */
      /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
      integer type. Permitted for special function registers.*/
      XIDFilterPtr = (volatile Ifx_CAN_EXTMSG*)XIDFilterRealAddr;
      /* [cover parentID={AA578760-E59C-462a-9A65-81B9E3FFDB67}]
      If Pretended Network OFF
      [/cover] */
      if(FALSE == CanXIDPtr[XIDFiltrIndx].CanXidPNSupport)
      {
        /* Set to Reject Message with Filter element */
        XIDFilterPtr->F0.B.EFEC = CAN_17_MCMCAN_ZERO;
      }
      /* Increment for access next filter element */
      XIDOffsetIndx++;
    }
  }
  /*Set the pretended network status for the current CAN controller */
  CanCoreState->CanIcomEnableStatusPtr[Controller] = TRUE;
  /* Store ICOM Configuration ID */
  CanCoreState->CanActiveIcomCfgIdPtr[Controller] = ConfigurationId;
}
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

