liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static void Can_17_McmCan_lDeactivateIcom              **
**                    (                                                       **
**                       const uint8 Controller,                              **
**                       const IcomConfigIdType ConfigurationId,              **
**                       Can_17_McmCan_CoreStatesType* const CanCoreState,    **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                    )                                                       **
**                                                                            **
**  Description      : Deactivate CAN pretended networking for a CAN          **
**                     controller                                             **
** [cover parentID={BE2FCC3E-23ED-4ab0-A6C3-8A5E7D285E7A}]                    **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller                 **
**                    ConfigurationId  - Requested ICOM Configuration         **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lDeactivateIcom (const uint8 Controller,
  const IcomConfigIdType ConfigurationId,
  const Can_17_McmCan_CoreStatesType* const CanCoreState,
  const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;

  const Can_17_McmCan_SIDFilterConfigType *CanSIDPtr;
  volatile Ifx_CAN_STDMSG *SIDFilterPtr;
  uint32 SIDFilterStartAddr;
  uint32 SIDFilterRealAddr;
  uint16 SIDFiltrStartIndx;
  uint16 SIDFiltrEndIndx;
  uint16 SIDFiltrIndx;
  uint8 SIDOffsetIndx;
  const Can_17_McmCan_XIDFilterConfigType *CanXIDPtr;
  volatile Ifx_CAN_EXTMSG *XIDFilterPtr;
  uint32 XIDFilterStartAddr;
  uint32 XIDFilterRealAddr;
  uint16 XIDFiltrStartIndx;
  uint16 XIDFiltrEndIndx;
  uint16 XIDFiltrIndx;
  uint8 XIDOffsetIndx;

  uint16 IcomMsgIndex;
  uint16 MsgIndex;
  uint16 IcomNoOfRxMsg;
  uint8 IcomConfigId;

  /* Get ICOM configuration ID*/
  IcomConfigId = CanCoreState->CanActiveIcomCfgIdPtr[Controller];
  /* Get the first receive configuration index */
  IcomMsgIndex = Can_17_McmCan_kGblConfigPtr->CanIcomConfigPtr \
    [IcomConfigId - CAN_17_MCMCAN_ONE].CanIcomFirstMsgIndx;
  /* Get the total number of ICOM Receive messages configured*/
  IcomNoOfRxMsg =
    Can_17_McmCan_kGblConfigPtr->CanIcomConfigPtr \
    [IcomConfigId - CAN_17_MCMCAN_ONE].CanIcomNoOfMsgIndx;
  /* Read the exact Node Start address */
  NodeRegAddressPtr = \
                   CanConfig->CanControllerConfigPtr[Controller].CanNodeAddress;
  /* Set with Initialization mode */
  NodeRegAddressPtr->CCCR.B.INIT = CAN_17_MCMCAN_ONE;
  /* Enable configuration change */
  NodeRegAddressPtr->CCCR.B.CCE = CAN_17_MCMCAN_ONE;
  /* Check if Wakeup on bus off condition is configured*/
  /* [cover parentID={CB0FE3D4-8D89-4b3c-9BD2-3A9FE061098A}]
    Check if Wakeup on bus off condition is configured and interrupt
    [/cover] */
  if(TRUE != CanCoreState->CanIcomConfgBOStatusPtr[Controller])
  {
    if (CAN_17_MCMCAN_INTERRUPT == \
         CanConfig->CanEventHandlingConfigPtr[Controller]. \
         CanEventType[CAN_17_MCMCAN_TWO])
    {
      /* Re enable the Bus Off interrupt of the requested CAN node */
      NodeRegAddressPtr->IE.B.BOE = CAN_17_MCMCAN_ONE;
    }
  }
  /* [cover parentID={D719E03F-D4BE-4569-8473-A4DF0E8AE018}]
  If SID Config Pointer is not Null
  [/cover] */
  if(NULL_PTR != CanConfig-> CanSIDFilterConfigPtr)
  {
    /* Set SID filter list Address */
    CanSIDPtr = CanConfig->CanSIDFilterConfigPtr;
    /* Set with first SID filter Index */
    SIDFiltrStartIndx = \
         CanConfig->CanControllerConfigPtr[Controller]. \
         CanControllerMOMap[CAN_17_MCMCAN_TWO];
    /* Set with End SID filter Index */
    SIDFiltrEndIndx = \
       CanConfig->CanControllerConfigPtr[Controller]. \
       CanControllerMOMap[CAN_17_MCMCAN_THREE];
    /* Read Standard Identifier filter Start address */
    SIDFilterStartAddr = CanConfig-> \
      CanControllerMsgRAMMapConfigPtr[Controller]. \
      CanControllerMsgRAMMap[CAN_17_MCMCAN_ZERO];
    /* Set Offset with First element*/
    SIDOffsetIndx = CAN_17_MCMCAN_ZERO;
    /* Set with all standard filter configuration */
    for(SIDFiltrIndx = SIDFiltrStartIndx; SIDFiltrIndx <
                        (SIDFiltrStartIndx + SIDFiltrEndIndx); SIDFiltrIndx++)
    {
      /* Set with Address of  filter element */
      SIDFilterRealAddr = SIDFilterStartAddr + ((uint32)SIDOffsetIndx * \
             CAN_17_MCMCAN_RAM_BYTES);
      /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
      cast the address of Standard filter Type to the standard filter
      elements  structure type  */
      /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
      integer type. Permitted for special function registers.*/
      /* Set with First filter element */
      SIDFilterPtr = (volatile Ifx_CAN_STDMSG*)SIDFilterRealAddr;
        /* [cover parentID={E4964635-E2F9-48cb-98F1-6F3129D19994}]
      If Pretended Network OFF
      [/cover] */
      if(FALSE == CanSIDPtr[SIDFiltrIndx].CanSidPNSupport)
      {
        /* [cover parentID={B6024BAF-5E14-450b-9A5B-7068C34F4611}]
        [/cover] */
        /* [cover parentID={8D068AA0-9DA1-4c75-B3F8-1F8040F23865}]
        [/cover] */
        if(CAN_17_MCMCAN_RX_FIFO1 == CanSIDPtr[SIDFiltrIndx].CanSidBufferType)
        {
          /* Set to store in RXFIO1 */
          SIDFilterPtr->S0.B.SFEC = CAN_17_MCMCAN_TWO;
        }
        else if(CAN_17_MCMCAN_RX_FIFO0 == \
          CanSIDPtr[SIDFiltrIndx].CanSidBufferType)
        {
          /* Set to store in RXFIO0 */
          SIDFilterPtr->S0.B.SFEC = CAN_17_MCMCAN_ONE;
        }
        else
        {
          /* Set to store in RX Dedicated buffer */
          SIDFilterPtr->S0.B.SFEC = CAN_17_MCMCAN_SEVEN;
        }
      }
      /* increment to access next element */
      SIDOffsetIndx++;
    }
  }
  /* [cover parentID={80B1B0F9-7EF8-46a6-A730-C2038990D035}]
    If XID Config Pointer is not Null
    [/cover] */
  if(NULL_PTR != CanConfig-> CanXIDFilterConfigPtr)
  {
    /* Set with XID filter list configuration address */
    CanXIDPtr = CanConfig->CanXIDFilterConfigPtr;
    /* Read Extended Identifier filter Start address */
    XIDFilterStartAddr = CanConfig-> \
       CanControllerMsgRAMMapConfigPtr[Controller]. \
       CanControllerMsgRAMMap[CAN_17_MCMCAN_ONE];
    /* Set with start Index */
    XIDFiltrStartIndx = \
      CanConfig->CanControllerConfigPtr[Controller]. \
      CanControllerMOMap[CAN_17_MCMCAN_FOUR];
    /* Set with end Index */
    XIDFiltrEndIndx = \
      CanConfig->CanControllerConfigPtr[Controller]. \
      CanControllerMOMap[CAN_17_MCMCAN_FIVE];
    /* Set Offset with first element */
    XIDOffsetIndx = CAN_17_MCMCAN_ZERO;
    /* Set with all Extended filter configuration */
    for(XIDFiltrIndx = XIDFiltrStartIndx; XIDFiltrIndx < \
         (XIDFiltrStartIndx + XIDFiltrEndIndx); XIDFiltrIndx++)
    {
      /* Set with offset of XID filter element */
      XIDFilterRealAddr = XIDFilterStartAddr + ((uint32)CAN_17_MCMCAN_EIGHT * \
               (uint32)XIDOffsetIndx);
      /* Set with First filter element */
      /* MISRA2012_RULE_11_6_JUSTIFICATION: The pointer cast is used to
      cast the address of extended filter type to the extended filter
      elements  structure type  */
      /* MISRA2012_RULE_11_4_JUSTIFICATION: conversion between pointer and
       integer type. Permitted for special function registers.*/
      XIDFilterPtr = (volatile Ifx_CAN_EXTMSG*) XIDFilterRealAddr;
      /* [cover parentID={8C11FDDA-2EDA-42c4-A777-0CC38134A365}]
      If Pretended Network OFF
      [/cover] */
      if(FALSE == CanXIDPtr[XIDFiltrIndx].CanXidPNSupport)
      {
        if(CAN_17_MCMCAN_RX_FIFO1 == CanXIDPtr[XIDFiltrIndx].CanXidBufferType)
        {
          /* Set to store in RXFIO1 */
          XIDFilterPtr->F0.B.EFEC = CAN_17_MCMCAN_TWO;
        }
        else if(CAN_17_MCMCAN_RX_FIFO0 == \
          CanXIDPtr[XIDFiltrIndx].CanXidBufferType)
        {
          /* Set to store in RXFIO0 */
          XIDFilterPtr->F0.B.EFEC = CAN_17_MCMCAN_ONE;
        }
        else
        {
          /* Set to store in RX Dedicated buffer */
          XIDFilterPtr->F0.B.EFEC = CAN_17_MCMCAN_SEVEN;
        }
      }
      /* increment to access next element */
      XIDOffsetIndx++;
    }
  }
  /* Disable configuration change mode */
  NodeRegAddressPtr->CCCR.B.CCE = CAN_17_MCMCAN_ZERO;
  /* Set with normal operation mode */
  NodeRegAddressPtr->CCCR.B.INIT = CAN_17_MCMCAN_ZERO;
  /* Set with First index value */
  MsgIndex = IcomMsgIndex;
  SchM_Enter_Can_17_McmCan_IcomMsgCntrVal();
  while(MsgIndex < (IcomMsgIndex + IcomNoOfRxMsg))
  {
    /* Clear Msg Counter values */
    CanCoreState->CanIcomMsgCntrValPtr[MsgIndex] = CAN_17_MCMCAN_ZERO;
    /* Increment message counter index */
    MsgIndex++;
  }
  SchM_Exit_Can_17_McmCan_IcomMsgCntrVal();
  /* Clear the ICOM Wake on bus off status */
  CanCoreState->CanIcomConfgBOStatusPtr[Controller] = FALSE;
  /* Set the pretended network status for the current CAN controller */
  CanCoreState->CanIcomEnableStatusPtr[Controller] = FALSE;
  /* Clear ICOM Configuration ID */
  CanCoreState->CanActiveIcomCfgIdPtr[Controller] = CAN_17_MCMCAN_ZERO;
  UNUSED_PARAMETER(ConfigurationId);
}
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

