liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           :  static void Can_17_McmCan_lIcomValidateMsg            **
**                     (                                                      **
**                        Can_HwType* const Mailbox,                          **
**                        const PduInfoType* const PduInfoPtr,                **
**                        Can_17_McmCan_CoreStatesType* const CanCoreState,   **
**                        const Can_17_McmCan_CoreConfigType* const CanConfig **
**                     )                                                      **
**                                                                            **
**  Description      : Validates the received message against configured      **
**                    wakeup conditions .                                     **
** [cover parentID={59278E5B-418E-4beb-B6C8-F2F6D8237C2D}]                    **
** [/cover]                                                                   **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Mailbox    : Included Received Message ID,HOH          **
**                                 and Controller Id                          **
**                    PduInfoPtr : Included SDU length and Data pointer       **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Parameters (in-out) : CanCoreState - Pointer to global structure          **
**                                                                            **
**  Return value     : E_OK : The WakeUp condition is caused                  **
**                    E_NOT_OK : The WakeUp condition is not caused           **
**                                                                            **
*******************************************************************************/
static void Can_17_McmCan_lIcomValidateMsg(Can_HwType* const Mailbox, \
                                    const PduInfoType* const PduInfoPtr, \
                      const Can_17_McmCan_CoreStatesType* const CanCoreState, \
                      const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  Can_IdType IcomRxMsgId;
  Can_IdType Icom_CheckMsgId;
  uint16 IcomMsgIndex;
  uint16 MsgIndex;
  uint16 IcomNoOfRxMsg;
  uint8 IcomConfigId;
  uint8 ControllerId;
  Std_ReturnType ApiStatus;
  Std_ReturnType RxIndicationStatus;

  /* Set with Controller Configuration Id */
  ControllerId = Mailbox->ControllerId;
  /* Get ICOM configuration ID*/
  IcomConfigId = CanCoreState->CanActiveIcomCfgIdPtr[ControllerId];
  /* Get the first receive configuration index */
  IcomMsgIndex = \
   Can_17_McmCan_kGblConfigPtr->CanIcomConfigPtr \
   [IcomConfigId - CAN_17_MCMCAN_ONE].CanIcomFirstMsgIndx;
  /* Get the total number of ICOM Receive messages configured*/
  IcomNoOfRxMsg = \
    Can_17_McmCan_kGblConfigPtr->CanIcomConfigPtr \
    [IcomConfigId - CAN_17_MCMCAN_ONE].CanIcomNoOfMsgIndx;
  /* Set with First index value */
  MsgIndex = IcomMsgIndex;
  while(MsgIndex < (IcomMsgIndex + IcomNoOfRxMsg))
  {
    /* Set with Icom Rx message Id */
    IcomRxMsgId = Mailbox->CanId & ~(CAN_17_MCMCAN_SET_XTD_BIT_MASK);
    /* check if CanIcomMessageIdMask is configured */
    /* [cover parentID={7FCE3062-4F0E-42f9-8D63-BFBB915127D4}]
      check if CanIcomMessageIdMask is configured
      [/cover] */
    if(CAN_17_MCMCAN_MSG_MASK_VAL != \
      Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex].CanIcomMaskRef)
    {
      /* Mask the received message ID with the ICOM Message Id mask */
      IcomRxMsgId &= \
    (Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex].CanIcomMaskRef);
      Icom_CheckMsgId = \
    (Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex].CanIcomMsgId &\
     Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex].CanIcomMaskRef);
    }
    else
    {
      Icom_CheckMsgId = Can_17_McmCan_kGblConfigPtr-> \
        CanIcomMsgConfigPtr[MsgIndex].CanIcomMsgId;
    }
    /* Compare Masked id with configured Id */
    /* [cover parentID={20A7B80B-4B45-4249-A1D9-005D2A4E3234}]
      Compare Masked id with configured Id
      [/cover] */
    if(IcomRxMsgId == Icom_CheckMsgId)
    {
      /* Compare payload length(DLC)and if mismatch set as wake-up */
      /* [cover parentID={3193029F-59A3-4683-9006-5BCDB27C4AC6}]
      Compare payload length(DLC)and if mismatch set as wake-up
      [/cover] */
      if( PduInfoPtr-> SduLength == \
        Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex].CanIcomDLC)
      {
        RxIndicationStatus = E_OK;
        ApiStatus = E_OK;
      }
      else
      {
        /* [cover parentID={670F2400-E590-4930-BD2C-08C2B8FE8951}]
        Check payload length error is configured
        [/cover] */
        /* Set Status as Wakeup condition cause */
        if(TRUE == \
          Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex]. \
          CanIcomLengthErr)
        {
          RxIndicationStatus = E_OK;
          ApiStatus = E_NOT_OK;
        }
        else
        {
          ApiStatus = E_NOT_OK;
          RxIndicationStatus = E_NOT_OK;
        }
      }
      /* Compare masked ID with message Id */
      /* [cover parentID={D088A1AF-E79D-488e-8523-1328EC6F754D}]
      Check if signal comparison is required
      [/cover] */
      if ((E_OK == ApiStatus) && (CAN_17_MCMCAN_ZERO != \
        Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex]. \
        CanIcomNoOfSignalIndx))
      {
        /* Invoke function for Message signal validation */
        ApiStatus = Can_17_McmCan_lIcomValidateMsgSignal(MsgIndex,PduInfoPtr, \
          Can_17_McmCan_kGblConfigPtr);
        RxIndicationStatus = ApiStatus;
      }
      /* [cover parentID={45648DCE-4474-45bf-836F-76DAA4681C09}]
      [/cover] */
      /* Check counter value is configured or not */
      if((E_OK == ApiStatus) && (CAN_17_MCMCAN_ZERO != \
        Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex]. \
          CanIcomCntrVal))
      {
        SchM_Enter_Can_17_McmCan_IcomMsgCntrVal();
        /* Increment Message Counter Value */
        CanCoreState->CanIcomMsgCntrValPtr[MsgIndex]++;
        /* Check if the message with the ID is received n times on the
        communication channel. */
        if(Can_17_McmCan_kGblConfigPtr->CanIcomMsgConfigPtr[MsgIndex]. \
            CanIcomCntrVal == CanCoreState->CanIcomMsgCntrValPtr[MsgIndex])
        {
          /* Set Status as Wakeup condition cause */
          RxIndicationStatus = E_OK;
          CanCoreState->CanIcomMsgCntrValPtr[MsgIndex] = CAN_17_MCMCAN_ZERO;
        }
        else
        {
          /* reset Wake up cause till counter value matches */
          RxIndicationStatus = E_NOT_OK;
        }
        SchM_Exit_Can_17_McmCan_IcomMsgCntrVal();
      }
      /* Set Exit condition if Wakeup Cause is enabled */
      /* [cover parentID={573DD384-AF96-4acb-880E-B6DFDDFE54FA}]
        Check return Value is E_OK
        [/cover] */
      if(E_OK == RxIndicationStatus)
      {
        /* Update mail box info with logical controller ID value */
        Mailbox->ControllerId = \
          CanConfig->CanControllerIndexingPtr[ControllerId];
        /* Call CanIf_RxIndication received message matches the wakeup */
        /* [cover parentID={397CDE2A-64F0-4cec-B81E-42DF58B135BD}]
        [/cover] */
        CanIf_RxIndication(Mailbox,PduInfoPtr);
        /* Set Exit Condition */
        MsgIndex = (IcomMsgIndex + IcomNoOfRxMsg);
      }
    }
    /* Increment to point next Message configuration*/
    MsgIndex++;
  }
}
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */
#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           :  LOCAL_INLINE Std_ReturnType                           **
**                      Can_17_McmCan_lIcomCheckGreaterSmaller                **
**                     (                                                      **
**                          const uint8 ValData,const uint8 ConfigData,       **
**                          uint8* const CheckVal,                            **
**                  const Can_17_McmCan_IcomSignalOperType SignalOperType)    **
**                     )                                                      **
**                                                                            **
**  Description      : Validates the received message Signal values for       **
**                     the greater and lesser wakeup conditions.              **
** [cover parentID={A3BCA435-BA18-4435-B958-3572375DFFF9}]                    **
** [/cover]                                                                   **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : SignalIndex : Signal index of the configuration message**
**                                    to be compared with                     **
**                    DataIndex   : Pointer to the information of received    **
**                                   LPDU                                     **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK : The WakeUp condition is caused                  **
**                    E_NOT_OK : The WakeUp condition is not caused           **
**                                                                            **
*******************************************************************************/
LOCAL_INLINE Std_ReturnType Can_17_McmCan_lIcomCheckGreaterSmaller( \
  const uint8 ValData,const uint8 ConfigData, \
  uint8* const CheckVal, \
  const Can_17_McmCan_IcomSignalOperType SignalOperType)
{
  /* API return status */
  Std_ReturnType ApiStatus;
  /* Initialize the Return status */
  ApiStatus =  E_NOT_OK;
  /* [cover parentID={4268D730-023D-44b7-AED0-5636D62E3096}]
  Is SignalOperType is Greater
  [/cover] */
  if(CAN_17_MCMCAN_ICOM_OPER_GREATER == SignalOperType)
  {
    /* [cover parentID={77E7A7AC-DCE7-4dda-859B-088E6BFF919C}]
    Verify the signal value and masked payload data
    [/cover] */
    /* Verify the signal value and masked payload data */
    if (ValData < ConfigData)
    {
      ApiStatus = E_NOT_OK;
      (*CheckVal)++;
    }
    else if ((ValData > ConfigData)&&(CAN_17_MCMCAN_ZERO==(*CheckVal)))
    {
      ApiStatus = E_OK;
    }
    else
    {
      /* Do Nothing */
    }
  }
  /* [cover parentID={4268D730-023D-44b7-AED0-5636D62E3096}]
  Is SignalOperType is Smaller
  [/cover] */
  else
  {
    /* Verify the signal value and masked payload data */
    /* [cover parentID={8B9BFF52-0282-4bf5-B356-46D316416BB9}]
    Verify the signal value and masked payload data
    [/cover] */
    if (ValData > ConfigData)
    {
      ApiStatus = E_NOT_OK;
      (*CheckVal)++;
    }
    else if ((ValData < ConfigData)&&(CAN_17_MCMCAN_ZERO==(*CheckVal)))
    {
      ApiStatus = E_OK;
    }
    else
    {
      /* Do Nothing */
    }
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */
#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           :  static Std_ReturnType                                 **
**                      Can_17_McmCan_lIcomValidateMsgSignal                  **
**                     (                                                      **
**                        const uint16 MessageIndex,                          **
**                        const PduInfoType* const PduInfoPtr,                **
**                        const Can_17_McmCan_ConfigType* const CanConfig     **
**                     )                                                      **
**                                                                            **
**  Description      : Validates the received message Signal values against   **
**                     the configured wakeup conditions.                      **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : MessageIndex : Signal Wakeup cause check corresponding **
**                                   Message configuration index              **
**                    PduInfoPtr   : Pointer to the information of received   **
**                                   LPDU                                     **
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK : The WakeUp condition is caused                  **
**                    E_NOT_OK : The WakeUp condition is not caused           **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lIcomValidateMsgSignal( \
                               const uint16 MessageIndex, \
                               const PduInfoType* const PduInfoPtr, \
                        const Can_17_McmCan_ConfigType* const CanConfig)
{
  uint32 SignalIndex;
  uint16 FirstSignalIndex;
  uint16 NoOfMsgSignal;
  uint8 MsgCtr;
  uint8 DataIndex;
  uint8 DataCnt;
  uint8 CheckIndex;
  uint8 TempData[CAN_17_MCMCAN_EIGHT];
  Std_ReturnType ApiStatus;

