liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* [cover parentID={728ADB13-2277-4569-BBED-C6598A5BA794}]
  [/cover] */
  /* Initialize the temporary array */
 for(DataIndex=CAN_17_MCMCAN_ZERO; DataIndex < CAN_17_MCMCAN_EIGHT;DataIndex++)
  {
    TempData[DataIndex] = CAN_17_MCMCAN_ZERO;
  }
  /* Initialize the Return status */
  ApiStatus =  E_NOT_OK;
  /* First signal index */
  FirstSignalIndex = \
    CanConfig->CanIcomMsgConfigPtr[MessageIndex].CanIcomFirstSignalIndx;
  /* No of signal configuration */
  NoOfMsgSignal = \
    CanConfig->CanIcomMsgConfigPtr[MessageIndex].CanIcomNoOfSignalIndx;
  /* Number of bytes to be checked */
  MsgCtr = CanConfig->CanIcomMsgConfigPtr[MessageIndex].CanIcomDLC;
  /* Message signal validation */
  for (SignalIndex=FirstSignalIndex; SignalIndex <
           ((uint32)FirstSignalIndex+(uint32)NoOfMsgSignal); SignalIndex++)
  {

    /*Initialize check index */
    CheckIndex = CAN_17_MCMCAN_ZERO;
    /*MISRA2012_RULE_1_3_JUSTIFICATION:This rule violation
    is agreed as we need to store the address passed is in
    the called function in many scenarios.*/
    uint8* CheckIndex_ptr = &CheckIndex;
    DataCnt=MsgCtr;
    while(CAN_17_MCMCAN_ZERO != DataCnt)
    {
      DataIndex = DataCnt - CAN_17_MCMCAN_ONE;
      DataCnt--;
      /* Mask the received payload and signal mask value */
      TempData[DataIndex] = (PduInfoPtr->SduDataPtr[DataIndex] \
        &(CanConfig->CanIcomRxSignalConfigPtr[SignalIndex]. \
                                                CanIcomSignalMask[DataIndex]));
      /* Get the Signal operation */
      switch(CanConfig->CanIcomRxSignalConfigPtr[SignalIndex].CanIcomSignalOper)
      {
        /* [cover parentID={3035480D-FFD2-4be8-93E9-3A9945ED2CF0}]
       The ICOM signal operation is AND
       [/cover] */
        case CAN_17_MCMCAN_ICOM_OPER_AND:
        {
          /* Verify the signal value and masked payload data */
          /* [cover parentID={FC150B53-99DD-48ce-BF32-0E3D01A27D6E}]
       Verify the signal value and masked payload data
       [/cover] */
          if (CAN_17_MCMCAN_ZERO != (TempData[DataIndex]& \
           (CanConfig->CanIcomRxSignalConfigPtr[SignalIndex]. \
           CanIcomSignalValue[DataIndex])))
          {
            ApiStatus = E_OK;
          }
        }
        break;
        /* Verify the signal value and masked payload data */
          /* [cover parentID={A06F59E0-00A6-4813-8EA0-ADE12DBC856E}]
       The ICOM signal operation is Equal
       [/cover] */

        case CAN_17_MCMCAN_ICOM_OPER_EQUAL:
        {
          /* [cover parentID={F1FFF568-488F-4246-AA49-6A856E037E26}]
        Verify the signal value and masked payload data
       [/cover] */
       /* Verify the signal value and masked payload data */
          if (TempData[DataIndex] == \
            (CanConfig->CanIcomRxSignalConfigPtr[SignalIndex]. \
            CanIcomSignalValue[DataIndex]))
          {
            CheckIndex++;
          }
          if(CheckIndex == MsgCtr)
          {
            ApiStatus = E_OK;
          }
        }
        break;
        /* [cover parentID={87F7972F-F16B-4831-AFF1-335EE9FB239A}]
       The ICOM signal operation is Greater
       [/cover] */
        case CAN_17_MCMCAN_ICOM_OPER_GREATER:
        {
          if(E_OK != ApiStatus)
          {
            ApiStatus = Can_17_McmCan_lIcomCheckGreaterSmaller \
            (TempData[DataIndex],(CanConfig-> \
            CanIcomRxSignalConfigPtr[SignalIndex]. \
            CanIcomSignalValue[DataIndex]), \
            CheckIndex_ptr,CAN_17_MCMCAN_ICOM_OPER_GREATER);
          }
        }
        break;
        /* [cover parentID={40C6BAB3-243F-46e8-859F-0857FAA3D8DA}]
       The ICOM signal operation is Smaller
       [/cover] */
        case CAN_17_MCMCAN_ICOM_OPER_SMALLER:
        {
          if(E_OK != ApiStatus)
          {
            ApiStatus = Can_17_McmCan_lIcomCheckGreaterSmaller(  \
            TempData[DataIndex],(CanConfig-> \
            CanIcomRxSignalConfigPtr[SignalIndex]. \
            CanIcomSignalValue[DataIndex]), \
            CheckIndex_ptr,CAN_17_MCMCAN_ICOM_OPER_SMALLER);
          }
        }
        break;
        default:
        {
          /* [cover parentID={A9027982-339E-47e4-B54D-05CD0CEF1382}]
       signal value and data when NORed if gives valid value
       [/cover] */
          if (CAN_17_MCMCAN_ZERO != (TempData[DataIndex] ^ \
           CanConfig->CanIcomRxSignalConfigPtr[SignalIndex]. \
           CanIcomSignalValue[DataIndex]))
          {
            ApiStatus = E_OK;
          }
        }
        break;
      }
    }
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */

/*******************************************************************************
            DET condition check internal functions
*******************************************************************************/
#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
** Traceability:                                                              **
**                                                                            **
** Syntax :        static Std_ReturnType Can_17_McmCan_lInitDetCheck(         **
**                 const Can_17_McmCan_ConfigType *const Config,              **
**                 const uint8 CoreIndex )                                    **
**                                                                            **
** Description :      Local function :Service to do DET Check for Init        **
** [/cover]                                                                   **
**                                                                            **
** Service ID:        None                                                    **
**                                                                            **
** Sync/Async:        Synchronous                                             **
**                                                                            **
** Reentrancy:        Non Reentrant                                           **
**                                                                            **
** Parameters (in):   Config - CAN config pointer                             **
**                    CoreIndex  - Core which is calling this function        **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      Std_ReturnType: status of DET.                          **
**                            E_NOT_OK/E_OK                                   **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lInitDetCheck( \
    const Can_17_McmCan_ConfigType *const Config, \
    const uint8 CoreIndex)
{
  Std_ReturnType ApiStatus;
  /* Initialize the variable */
  ApiStatus = E_OK;

