liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* To verify whether Init has been called with wrong parameter */
  /* Det Check for NULL pointer  */
  /* [cover parentID=  {AFC75F27-5860-4ac2-9C9D-4ECAF1B38F2D}]
    Det Check for NULL pointer
    [/cover] */
  if (NULL_PTR == Config)
  {
    /* [cover parentID={FF84B51F-837D-4b45-801D-462D5D647425}]
    [/cover] */
    /*Report Error, Init has been called with wrong parameter
      NULL Config Pointer */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                    CAN_17_MCMCAN_SID_INIT, CAN_17_MCMCAN_E_INIT_FAILED);
    /* Report Error */
    ApiStatus = E_NOT_OK;
  }
   /* [cover parentID={3AD9D42B-9ED6-4809-A008-0599C92C82F0}]
    [/cover] */
  #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
  /* Check if current core is slave core */
  /* [cover parentID={2EF7682E-4DAE-4dc5-BF3A-F54F1DEDD108}]
    Check if current core is slave core
    [/cover] */
  else if(MCAL_MASTER_COREID != CoreIndex)
  {
 /* [cover parentID=  {9FCB486F-7866-474e-9621-D78D124E5378}]
    if core is configured
    [/cover] */
    /* Check if master core is initialized */
    if(CAN_17_MCMCAN_READY !=
        (Mcal_GetBitAtomic(Can_17_McmCan_InitStatus,\
            (MCAL_MASTER_COREID*((uint8)CAN_17_MCMCAN_INIT_STATUS_SIZE)),\
              CAN_17_MCMCAN_INIT_STATUS_SIZE)))
    {
      ApiStatus = E_NOT_OK;
      /* [cover parentID={8176EBEA-757B-43d7-BC3E-1DFEC0BA802F}]
      [/cover] */
      /* Report error */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                    CAN_17_MCMCAN_SID_INIT, CAN_17_MCMCAN_E_MASTER_CORE_UNINIT);
    }
    /* [cover parentID= {262A989B-2938-4e77-8CBB-09C4786036B7}]
    if config ptr is same as master core
    [/cover] */
    /* Check if config ptr is same as master core */
    else if(Can_17_McmCan_kGblConfigPtr != Config)
    {
      ApiStatus = E_NOT_OK;
      /* [cover parentID= {0B962D30-099E-4a4b-8E2C-BCD0F4DE2EDF}]
      Report Error
      [/cover] */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                  CAN_17_MCMCAN_SID_INIT, CAN_17_MCMCAN_E_INIT_FAILED);
    }
    /* [cover parentID= {D6915A11-622A-4ac4-A117-7F00336FB2A1}]
    if core is configured
    [/cover] */
    /* Check if core is configured */
   else if(NULL_PTR == Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex])
    {
        ApiStatus = E_NOT_OK;
        /* Report Error */
        /* [cover parentID= {57B0CDA5-A90D-47a1-954C-610EDE1A6889}]
        if core is configured
       [/cover] */
        Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                    CAN_17_MCMCAN_SID_INIT, CAN_17_MCMCAN_E_NOT_CONFIGURED);
    }
    else
    {
        /* Do Nothing */
    }
  }
  #endif /* #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */

  /* [cover parentID={545ACBF1-A513-4b28-9044-E15771BB30DC}]
    if core is initialized
    [/cover] */
  else if(CAN_17_MCMCAN_READY == \
        (Mcal_GetBitAtomic(Can_17_McmCan_InitStatus,\
              (((sint32)CoreIndex)*((sint32)CAN_17_MCMCAN_INIT_STATUS_SIZE)),\
              CAN_17_MCMCAN_INIT_STATUS_SIZE)))
  {
    ApiStatus = E_NOT_OK;
    /* Report Error */
      /* [cover parentID={730A153B-CF7D-456c-8CD2-032476BB5C1F}]
    [/cover] */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                CAN_17_MCMCAN_SID_INIT, CAN_17_MCMCAN_E_TRANSITION);
  }
  else
  {
    /* Do Nothing */
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lDetUninitConfig   **
**                    (                                                       **
**                      const uint8 ServiceID,                                **
**                      const uint8 CoreIndex                                 **
**                    )                                                       **
**                                                                            **
**  Description      : Checks the status of CAN driver initialization         **
**                    If CAN driver is not initialized, reports to DET and    **
**                    return with E_NOT_OK                                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : ServiceId - Service Id of the calling API              **
**                     DriverState - The driver state of the controller       **
**                     whose state needs to be checked.                       **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : Std_ReturnType                                         **
**                  - E_OK: CAN Driver is initialized                         **
**                  - E_NOT_OK: CAN Driver is not initialized                 **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lDetUninitConfig( \
  const uint8 ServiceID, const uint8 CoreIndex)
{
  Std_ReturnType ApiStatus;

  /* [cover parentID={18C37795-B9DA-482d-83B4-0FB9AE5AE239}]
  [/cover] */
  /* Check if CAN driver is un-initialized */
  if(CAN_17_MCMCAN_READY != \
        (Mcal_GetBitAtomic(Can_17_McmCan_InitStatus,\
              (((sint32)CoreIndex)*((sint32)CAN_17_MCMCAN_INIT_STATUS_SIZE)),\
              CAN_17_MCMCAN_INIT_STATUS_SIZE)))
  {


    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                    ServiceID, CAN_17_MCMCAN_E_UNINIT);
    /* return function call not sucessful*/
    ApiStatus = E_NOT_OK;
  }
  else
  {
    UNUSED_PARAMETER(ServiceID);
    /* Set as Drv state as Initialized*/
    ApiStatus = E_OK;
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */
#if(((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON))|| \
  (CAN_17_MCMCAN_BO_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON))
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType                                  **
**                                       Can_17_McmCan_lMainDetUninitConfig   **
**                    (                                                       **
**                      const uint8 ServiceID,                                **
**                      const uint8 CoreIndex                                 **
**                    )                                                       **
**                                                                            **
**  Description      : Checks the status of CAN driver initialization         **
**                    If CAN driver is not initialized, reports to DET and    **
**                    return with E_NOT_OK                                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : ServiceId - Service Id of the calling API              **
**                     DriverState - The driver state of the controller       **
**                     whose state needs to be checked.                       **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : Std_ReturnType                                         **
**                  - E_OK: CAN Driver is initialized                         **
**                  - E_NOT_OK: CAN Driver is not initialized                 **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lMainDetUninitConfig( \
  const uint8 ServiceID, const uint8 CoreIndex)
{
  Std_ReturnType ApiStatus;

  /* Check if CAN driver is un-initialized */
  if(CAN_17_MCMCAN_READY != \
        (Mcal_GetBitAtomic(Can_17_McmCan_InitStatus,\
              (((sint32)CoreIndex)*((sint32)CAN_17_MCMCAN_INIT_STATUS_SIZE)),\
              CAN_17_MCMCAN_INIT_STATUS_SIZE)))
  {

    #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)

    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
                    ServiceID, CAN_17_MCMCAN_E_UNINIT);
    #endif
    /* return function call not sucessful*/
    ApiStatus = E_NOT_OK;
  }
  else
  {
    UNUSED_PARAMETER(ServiceID);
    /* Set as Drv state as Initialized*/
    ApiStatus = E_OK;
  }
  return ApiStatus;
}
#endif /* #if(((CAN_17_MCMCAN_WU_POLLING_PROCESSING == STD_ON) && \
  (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON))|| \
  (CAN_17_MCMCAN_BO_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_RX_POLLING_PROCESSING == STD_ON)|| \
  (CAN_17_MCMCAN_TX_POLLING_PROCESSING == STD_ON)) */
#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/* [cover parentID={6CDD66D5-A727-47d7-936C-250501448BCC}]
DET is enabled
[/cover] */
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lModeDetCheck      **
**                    (                                                       **
**                       const uint8 Controller,                              **
**                       const Can_StateTransitionType Transition,            **
**                     const Can_17_McmCan_CoreStatesType* const CanCoreState **
**                     )                                                      **
**                                                                            **
**  Description      : Checks the validity of software triggered CAN          **
**                    Controller state transition                             **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : Controller - Associated CAN Controller Id              **
**                    Transition - Requested transition                       **
**                     CanCoreState - Pointer to global structure             **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK - Valid transition                                **
**                    E_NOT_OK - Invalid transition                           **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lModeDetCheck(const uint8 Controller,\
                         const Can_StateTransitionType Transition, \
                    const Can_17_McmCan_CoreStatesType* const CanCoreState)
{
  Std_ReturnType ApiStatus;
  ApiStatus = E_OK;

