liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  switch (Transition)
  {
      /* [cover parentID={460052F2-FC60-41de-A2D3-1356A3BD22BE}]
      Current mode is Start
      [/cover] */
      /* Check if current mode is  Start */
    case CAN_T_START :
    {
      /* [cover parentID={5923BF72-0BF1-4c64-804E-A5090E2B5A2A}]
      Current mode is STOPPED
      [/cover] */
      /* Check if current mode is not STOPPED */
      if (CANIF_CS_STOPPED != CanCoreState->CanControllerModePtr[Controller])
      {
        ApiStatus = E_NOT_OK;
      }
    }
    break;

      /* Check if current mode is  Sleep */
      /* [cover parentID={1D410320-C7C2-488f-809E-65EBD8FE9D21}]
      Current mode is SLEEP
      [/cover] */
    case CAN_T_SLEEP :
    {
      /* [cover parentID={5D0E3B19-8273-41ee-8647-4F2ED32F19EC}]
      Current mode is STOPPED or SLEEP
      [/cover] */
      /* if current mode is neither SLEEP nor STOPPED */
      if((CANIF_CS_SLEEP != CanCoreState->CanControllerModePtr[Controller]) && \
         (CANIF_CS_STOPPED != CanCoreState->CanControllerModePtr[Controller]))
      {
        ApiStatus = E_NOT_OK;
      }
    }
    break;
    /* [cover parentID={96CB087E-4C25-4881-AAA7-17CAC4A30B90}]
      Current mode is Stop
      [/cover] */
      /* Check if current mode is  Stop */
    case CAN_T_STOP :
    {
      /* [cover parentID={3343288B-3C63-4861-9A74-322D38B97B2E}]
      Current mode is STOPPED or SLEEP
      [/cover] */
      /* if current mode is neither STARTED nor STOPPED */
      if((CANIF_CS_STARTED != \
           CanCoreState->CanControllerModePtr[Controller]) && \
        (CANIF_CS_STOPPED != CanCoreState->CanControllerModePtr[Controller]))
      {
        ApiStatus = E_NOT_OK;
      }
    }
    break;
    /* [cover parentID={D56EFC3C-497C-4541-9927-EBF8A0C9283B}]
      Current mode is Wake Up
      [/cover] */
      /* Check if current mode is  Wake Up */
    case CAN_T_WAKEUP :
    {
      /* [cover parentID={BCE0B849-7765-4c3b-8DF0-756EDB40572F}]
      Current mode is STOPPED or STARTED
      [/cover] */
      /* if current mode is neither SLEEP nor STOPPED */
      if((CANIF_CS_SLEEP != CanCoreState->CanControllerModePtr[Controller]) && \
         (CANIF_CS_STOPPED != CanCoreState->CanControllerModePtr[Controller]))
      {
        ApiStatus = E_NOT_OK;
      }
    }
    break;
    default:
    {
      /* Invalid state is requested */
      ApiStatus = E_NOT_OK;
    }
    break;
  }
  if(E_OK != ApiStatus)
  {
    /* [cover parentID={2D27662F-B422-4d24-B1E5-A0BFFA7AAF18}]
    Det error CAN_17_MCMCAN_E_TRANSITION
    [/cover] */
    /* [cover parentID={8D8DB9BD-EF6D-4906-BEF9-2043468C9472}]
    [/cover] */
    /* Report invalid transition request to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
                    CAN_17_MCMCAN_SID_SETCONTROLLERMODE, \
                    CAN_17_MCMCAN_E_TRANSITION);
  }
  return ApiStatus;
}
#endif /*  #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lWriteDetCheck     **
**                    (                                                       **
**                       const Can_HwHandleType Hth,                          **
**                       const Can_PduType* const PduInfo,                    **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                    )                                                       **
**                                                                            **
**  Description      : Handles DET checks for Can_17_McmCan_Write API         **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Hth - Hardware Transmit Handler                        **
**                    PduInfo - Pointer to SDU user memory, DLC and Identifier**
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK - No Development Error                            **
**                    E_NOT_OK - Development Error detected and reported      **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lWriteDetCheck( \
                                    const Can_HwHandleType Hth, \
                                      const Can_PduType* const PduInfo, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  Can_HwHandleType HthIndex;

  #if ((CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)|| \
    (CAN_17_MCMCAN_FD_ENABLE == STD_ON))
  uint8 LogicalControllerId;
  #endif

  #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
  uint8 CoreIndex;
  #endif

  #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  const volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 ControllerId;
  #endif

  Std_ReturnType ApiStatus = E_OK;

  #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
  /* [cover parentID={7FD20809-DAE1-43a0-A455-0A7DC1ACB803}]
  Check if transmit objects are configured in this core
  [/cover] */
  if(NULL_PTR == CanConfig->CanTxHwObjectConfigPtr)
  {
    /* [cover parentID={1938CEB7-260A-405e-81EA-155BF2508492}]
    [/cover] */
    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
      CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_NOT_CONFIGURED);
    /* Transmit objects are not configured for this core */
    ApiStatus = E_NOT_OK;
  }
  /* [cover parentID={ABA556EB-B7FD-459c-811F-6C774F518AC9}]
  Sanity of the transmit hardware object by checking its range (include the Rx
  hardware object offset in the check)
  [/cover] */
  else if((Hth >= CAN_17_MCMCAN_NOOF_HARDWARE_OBJECTS)|| \
    (Hth < Can_17_McmCan_kGblConfigPtr->CanNoOfHrh))
  {
    /* [cover parentID={154AD793-2358-4352-8745-21904858048B}]
    Report to DET
    [/cover] */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
       CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_HANDLE);
    /* Transmit objects are not configured for this core */
    ApiStatus = E_NOT_OK;
  }
  else
  {
    /* Extract HTH index for accessing corresponding configuration */
    HthIndex = Hth - (Can_17_McmCan_kGblConfigPtr->CanNoOfHrh);
    /* Set with the associated controller of requested HTH */
    LogicalControllerId = \
      Can_17_McmCan_kGblConfigPtr->CanHthIndexPtr[HthIndex]. \
      CanHthLogicContIndex;
    CoreIndex = CAN_17_MCMCAN_GETCOREID;
    /* [cover parentID={343A75B8-FF81-4cd9-A22C-F8338EE9A041}]
    check validity of controller
    [/cover] */
    ApiStatus = Can_17_McmCan_lDetParamController(CoreIndex, \
      LogicalControllerId,CAN_17_MCMCAN_SID_WRITE);
  }
  #else
  /* [cover parentID={ABA556EB-B7FD-459c-811F-6C774F518AC9}]
  Sanity of the transmit hardware object by checking its range (include the Rx
  hardware object offset in the check)
  [/cover] */
  if((Hth >= CAN_17_MCMCAN_NOOF_HARDWARE_OBJECTS)|| \
    (Hth < Can_17_McmCan_kGblConfigPtr->CanNoOfHrh))
  {
    /* [cover parentID={154AD793-2358-4352-8745-21904858048B}]
    Report to DET
    [/cover] */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
       CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_HANDLE);
    /* Transmit objects are not configured for this core */
    ApiStatus = E_NOT_OK;
  }
  #endif /* #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */
  /* [cover parentID={088740AE-4624-4d0a-BE64-003CBE2994B4}]
  Controller ID valid
  [/cover] */
  /* [cover parentID={ABA556EB-B7FD-459c-811F-6C774F518AC9}]
  Sanity of the transmit hardware object by checking its range (include the Rx
  hardware object offset in the check)
  [/cover] */
  if (E_NOT_OK != ApiStatus)
  {
    /* [cover parentID={C7EBC16B-A4E5-42a5-BD51-6DCD865D9B78}]
    Pdu info pointer is a NULL_PTR
    [/cover] */
    if (PduInfo == NULL_PTR)
    {
      /* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
      [/cover] */
      /* [cover parentID={D3112E3C-90F2-4211-A4B3-02C9D0FC4206}]
      Report to DET
      [/cover] */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_POINTER);
      ApiStatus = E_NOT_OK;
    }

    #if (CAN_17_MCMCAN_FD_ENABLE == STD_OFF)
    /* check if DLC is greater than 8 */
    /* [cover parentID={08FE56F5-092A-4bd2-9EF9-7057842E888B}]
    check if DLC is greater than 8
    [/cover] */
    else if (PduInfo->length > CAN_17_MCMCAN_MAX_DATA_LENGTH )
    {
      /* [cover parentID={44B0D617-504A-48f2-AAA1-4ADED8C9CD41}]
      Det error CAN_17_MCMCAN_E_PARAM_DLC
      [/cover] */
      /* [cover parentID={9ED8C975-CA94-41e9-9613-025FCBF17E96}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID,
        CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_DLC);
      /* The DLC length is > 8 */
      ApiStatus = E_NOT_OK;
    }
    #else /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_OFF) */
    /* [cover parentID={CF74323E-DE4B-4e2f-A84B-8DCA3B48D978}]
    DLC not in range
    [/cover] */
    else if (PduInfo->length > CAN_17_MCMCAN_MAX_FD_LENGTH)
    {
      /* [cover parentID={44B0D617-504A-48f2-AAA1-4ADED8C9CD41}]
      Det error CAN_17_MCMCAN_E_PARAM_DLC
      [/cover] */
      /* [cover parentID={9ED8C975-CA94-41e9-9613-025FCBF17E96}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
      CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_DLC);
      /* The DLC length is > 64 */
      ApiStatus = E_NOT_OK;
    }
    #endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_OFF) */

    else
    {
      #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON)
      /* [cover parentID={B762F111-56A0-4c5d-8EBD-F4F611F40D9B}]
      PDU info out of range
      [/cover] */
      if(PduInfo->length > CAN_17_MCMCAN_MAX_DATA_LENGTH)
      {
        /* Extract HTH index for accessing corresponding configuration */
        HthIndex = Hth - (Can_17_McmCan_kGblConfigPtr->CanNoOfHrh);
        /* Set with the associated controller of requested HTH */
        LogicalControllerId = \
          Can_17_McmCan_kGblConfigPtr->CanHthIndexPtr[HthIndex]. \
          CanHthLogicContIndex;
        /* Set with the associated controller of requested HTH */
        ControllerId = Can_17_McmCan_kGblConfigPtr-> \
          CanLogicalControllerIndexPtr[LogicalControllerId]. \
          CanLCoreSpecContIndex;
        /* Controller Node Address */
        NodeRegAddressPtr = \
          CanConfig->CanControllerConfigPtr[ControllerId].CanNodeAddress;
        /* Check the controller with FD mode */
        /* [cover parentID={8B484F34-2192-4711-B12A-593166E72ABC}]
        Check the controller with FD mode
        [/cover] */
        if( CAN_17_MCMCAN_BIT_SET_VAL != NodeRegAddressPtr->CCCR.B.FDOE)
        {
          /* [cover parentID={44B0D617-504A-48f2-AAA1-4ADED8C9CD41}]
          Det error CAN_17_MCMCAN_E_PARAM_DLC
          [/cover] */
          /* [cover parentID={9ED8C975-CA94-41e9-9613-025FCBF17E96}]
          [/cover] */
          /* Report to DET */
          Det_ReportError(CAN_17_MCMCAN_MODULE_ID,CAN_17_MCMCAN_INSTANCE_ID, \
            CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_DLC);
          /* Set controller without FD mode while FD request */
          ApiStatus = E_NOT_OK;
        }
        else
        {
          /* [cover parentID={1FE0382F-C545-40ed-8BCB-78D97DE14309}]
          [/cover] */
          /* Ckeck the message Id */
          if(CAN_17_MCMCAN_ID_FD_ENABLE_SET != \
            (PduInfo->id & CAN_17_MCMCAN_ID_FD_ENABLE_SET))
          {
            /* [cover parentID={44B0D617-504A-48f2-AAA1-4ADED8C9CD41}]
            Det error CAN_17_MCMCAN_E_PARAM_DLC
            [/cover] */
            /* [cover parentID={9ED8C975-CA94-41e9-9613-025FCBF17E96}]
            [/cover] */
            /* Report to DET */
            Det_ReportError(CAN_17_MCMCAN_MODULE_ID, \
              CAN_17_MCMCAN_INSTANCE_ID,CAN_17_MCMCAN_SID_WRITE, \
              CAN_17_MCMCAN_E_PARAM_DLC);
            /* Set when controller in FD mode and DLC>8,but Id flag
            is not set properly */
            ApiStatus = E_NOT_OK;
          }
        }
      }
      #endif /* #if (CAN_17_MCMCAN_FD_ENABLE == STD_ON) */
    }
  }
  /* [cover parentID={6124CD9E-C2C4-40e1-992B-9A7947DA0430}]
  Check if sdu is a null pointer
  [/cover] */
  if (E_NOT_OK != ApiStatus)
  {
    /* Extract HTH index for accessing corresponding core specific
    configuration */
    HthIndex = Can_17_McmCan_kGblConfigPtr-> \
      CanHthIndexPtr[Hth - (Can_17_McmCan_kGblConfigPtr->CanNoOfHrh)]. \
        CanHthCoreSpecIndex;
    /* Check the validity of the CAN ID passed in the L-Pdu */
    ApiStatus = Can_17_McmCan_lWriteIdCheck(HthIndex,PduInfo,CanConfig);
  }
  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax           : static Std_ReturnType Can_17_McmCan_lWriteIdCheck      **
**                    (                                                       **
**                       const Can_HwHandleType Hth,                          **
**                       const Can_PduType* const PduInfo,                    **
**                       const Can_17_McmCan_CoreConfigType* const CanConfig  **
**                    )                                                       **
**                                                                            **
**  Description      : Handles DET checks related to Message ID passed for    **
**                     Can_17_McmCan_Write API                                **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : Hth - Hardware Transmit Handler specific to core       **
**                    PduInfo - Pointer to SDU user memory, DLC and Identifier**
**                     CanConfig - Pointer to CAN driver configuration        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : E_OK - No Development Error                            **
**                    E_NOT_OK - Development Error detected and reported      **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lWriteIdCheck( \
              const Can_HwHandleType Hth,const Can_PduType* const PduInfo, \
                        const Can_17_McmCan_CoreConfigType* const CanConfig)
{
  #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
  boolean TrigStatus;
  #endif
  Std_ReturnType ApiStatus = E_OK;

