liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
  /* Check requested Id Type is same as with HTH CanIdType */
  /* [cover parentID={8E54F20B-46B6-4e12-84DD-FEAE40115C26}]
      Check requested Id Type is same as with HTH CanIdType
      [/cover] */
  if((uint8)CAN_17_MCMCAN_ID_EXTENDED == CanConfig->
                    CanTxHwObjectConfigPtr[Hth].CanTxHwObjIdType)
  {
    /* Check Id type is extended or not */
    /* [cover parentID={3738E817-874C-4c93-88AC-EBEEC072E92D}]
      Check Id type is extended or not
      [/cover] */
    if(CAN_17_MCMCAN_SET_XTD_BIT_MASK != (PduInfo->id & \
         CAN_17_MCMCAN_SET_XTD_BIT_MASK))
    {

      /* [cover parentID={4B121357-CD4D-483b-B5D0-2655DF362A49}]
      [/cover] */
      /* Report to DET */
      /* [cover parentID={278FC26B-FBF3-4c0e-A8AB-0BF302F92B2A}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
         CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_MSGID);
      /* Requested with not supported CanId Type message  */
      ApiStatus = E_NOT_OK;
    }
  }
  /* [cover parentID={5D1530A7-7FA2-4737-800C-640AAFEFB6CF}]
      Check Id type is Standard or not
      [/cover] */
  else if((uint8)CAN_17_MCMCAN_ID_STANDARD == \
                      CanConfig->CanTxHwObjectConfigPtr[Hth].CanTxHwObjIdType)
  {
    /* Check Id type is extended or not */
    /* [cover parentID={E062AC43-44B7-4064-9F40-99327AC4CD3E}]
      Check Id type is Standard or not
      [/cover] */
    if(CAN_17_MCMCAN_SET_XTD_BIT_MASK == (PduInfo->id & \
        CAN_17_MCMCAN_SET_XTD_BIT_MASK))
    {

      /* [cover parentID={4B121357-CD4D-483b-B5D0-2655DF362A49}]
      [/cover] */
      /* Report to DET */
      /* [cover parentID={278FC26B-FBF3-4c0e-A8AB-0BF302F92B2A}]
      [/cover] */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
         CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_MSGID);
      /* Requested with not supported CanId Type message  */
      ApiStatus = E_NOT_OK;
    }
  }
  else
  {
    /* Do nothing */
  }
  #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
  /* [cover parentID={F3AC897B-FA20-4064-BC3D-8263A651D084}]
  Is Status ok
  [/cover] */
  if(E_NOT_OK != ApiStatus)
  {
    /* Read requested HTH is with trigger transmit API is enabled  */
    TrigStatus = \
      CanConfig->CanTxHwObjectConfigPtr[Hth].CanTrigTxStatus;
    /* [cover parentID={9D09780A-1403-4d7c-8558-4B1EF0AC0B4E}]
    Transmit trigger status is False or the sdu in the pdu info is a NULL_PTR
    [/cover] */
    /* Check Trigger status */
    if((FALSE == TrigStatus) && (NULL_PTR == PduInfo->sdu))
    {
      /* [cover parentID={44717DBB-E03B-42e9-94EB-B5AC90182EDE}]
      Det error CAN_17_MCMCAN_E_PARAM_POINTER
      [/cover] */
      /* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
      [/cover] */
      /* Report to DET */
      Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
        CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_POINTER);
      /* Trigger transmit API is disabled for the requested HTH */
      ApiStatus = E_NOT_OK;
    }
  }
  #else
  /* [cover parentID={4770EDB2-C2EC-43f2-B8E2-A7E2BE29209F}]
  Check sdu info
  [/cover] */
  if((E_NOT_OK != ApiStatus) && (NULL_PTR == PduInfo->sdu))
  {
    /* [cover parentID={44717DBB-E03B-42e9-94EB-B5AC90182EDE}]
    Det error CAN_17_MCMCAN_E_PARAM_POINTER
    [/cover] */
    /* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
    [/cover] */
    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID, CAN_17_MCMCAN_INSTANCE_ID, \
      CAN_17_MCMCAN_SID_WRITE, CAN_17_MCMCAN_E_PARAM_POINTER);
    /* Trigger transmit API is disabled for the requested HTH */
    ApiStatus = E_NOT_OK;
  }
  #endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */

  return ApiStatus;
}

#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

#if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
**  Syntax     : static Std_ReturnType Can_17_McmCan_lDetParamController      **
**                    (                                                       **
**                      const uint8 CoreIndex,                                **
**                      const uint8 Controller,                               **
**                      const uint8 ServiceID,                                **
**                    )                                                       **
**                                                                            **
**  Description      : Checks if ControllerId is a valid CAN Controller Id    **
**                    If ControllerId is not valid, then report to DET and    **
**                    return with E_NOT_OK                                    **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Reentrant                                              **
**                                                                            **
**  Parameters (in)  : CoreIndex - Core which is calling this function        **
**  Parameters (in)  : Controller - Associated CAN Controller Id              **
**                     ServiceId - Service Id of the calling API              **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : Std_ReturnType                                         **
**                   - E_OK: ControllerId is valid                            **
**                   - E_NOT_OK: ControllerId is invalid                      **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Can_17_McmCan_lDetParamController( \
                                const uint8 CoreIndex, \
                                const uint8 Controller, \
                                const uint8 ServiceID)
{
  Std_ReturnType ApiStatus;

  ApiStatus = E_OK;

  /* Check 'ControllerId' is out of range */
   /* [cover parentID={378E7144-5309-46ea-852E-C7D6FF243F20}]
    Is ControllerId' is out of range
    [/cover] */
  if(Controller >= CAN_17_MCMCAN_NOOF_CONTROLLER)
  {
    /* [cover parentID={433A06CD-4D92-43c7-B000-7DE89BC6AD28}]
    Det error CAN_17_MCMCAN_E_PARAM_CONTROLLER
    [/cover] */
    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID,CAN_17_MCMCAN_INSTANCE_ID, \
                                   ServiceID,CAN_17_MCMCAN_E_PARAM_CONTROLLER);
    /* Set as requested controller ID is Invalid */
    ApiStatus = E_NOT_OK;
  }
  #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
      /* [cover parentID={F58BF72A-4FFD-4b58-B3B4-4CA2CBFC9D58}]
    Is Controllerallocated to current core
    [/cover] */
  if((E_NOT_OK != ApiStatus)&&(CoreIndex != \
    Can_17_McmCan_kGblConfigPtr->CanLogicalControllerIndexPtr[Controller]. \
    CanLCoreAssigned))
  {
    /* [cover parentID={7026EB9F-2D08-4ed2-994D-23A8227F5450}]
    Det error CAN_17_MCMCAN_E_NOT_CONFIGURED
    [/cover] */

    /* Report to DET */
    Det_ReportError(CAN_17_MCMCAN_MODULE_ID,CAN_17_MCMCAN_INSTANCE_ID, \
                         ServiceID,CAN_17_MCMCAN_E_NOT_CONFIGURED);
    /* Set as requested controller ID is Invalid */
    ApiStatus = E_NOT_OK ;
  }
  #endif /*   #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */

  #if (CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_OFF)
  UNUSED_PARAMETER(CoreIndex);
  #endif

  return ApiStatus;
}
#endif /* #if (CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

