liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
/*******************************************************************************
            Interrupt Handler
*******************************************************************************/

#if(CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON)
/*******************************************************************************
** Traceability   : [cover parentID={B91B38C0-0F62-4a9a-BF22-9EC231B6521E}]   **
**                    [cover parentID={D47A49B6-985A-4c4f-86D5-C17125DAE268}] **
**                                                                            **
** Syntax           : void Can_17_McmCan_IsrTransmitHandler                   **
**                    (                                                       **
**                      const uint8 HwKernelId                                **
**                      const uint8 NodeIdIndex                               **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : HwKernelId - Requested with associated kernelId         **
**                    NodeIdIndex - Requested with associated node id         **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : - This is the interrupt service routine for Transmit    **
**                    Interrupt                                               **
**                    - In case of successful transmission event, this        **
**                    function notifies the upper layer                       **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_IsrTransmitHandler(const uint8 HwKernelId, \
                                        const uint8 NodeIdIndex)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 CntrlIndx;
  uint8 CoreIndex;
  const Can_17_McmCan_CoreConfigType* CanConfig;
  const Can_17_McmCan_CoreStatesType* CanCoreState;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* Local copy of the core specific configuration */
  CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
  /* Local copy of the core specific global states */
  CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
  /* Retrive core specific controller index */
  CntrlIndx = Can_17_McmCan_kGblConfigPtr->CanPhyControllerIndexPtr[ \
    (CAN_17_MCMCAN_FOUR * HwKernelId) + NodeIdIndex].CanPCoreSpecContIndex;
  /* Check the controller mode is Interrupt or not */
  /* [cover parentID={72BDFFC9-A38F-4bd9-B5C7-DD371E8ECD40}]
    Check the controller mode is Interrupt or not
    [/cover] */
  if(CAN_17_MCMCAN_POLLING != CanConfig-> \
        CanEventHandlingConfigPtr[CntrlIndx].CanEventType[CAN_17_MCMCAN_ZERO])
  {
    /* Set with Node Register Start address */
    NodeRegAddressPtr = \
          CanConfig->CanControllerConfigPtr[CntrlIndx].CanNodeAddress;
          /* [cover parentID={EF1E9B31-4032-4682-BD50-B7C6EC3B8CB5}]
    Check if Tx Event FIFO New Entry is stored
    [/cover] */
    /* Check if Tx Event FIFO New Entry is stored */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->IR.B.TEFN)
    {
/* [cover parentID={37BEC4E9-A8B9-46eb-959D-5A093D039C26}]
    Check if config pointer is NULL_PTR
    [/cover] */
      if(NULL_PTR != CanConfig->CanTxHwObjectConfigPtr)
      {
        /* If New Event Entry is present then invoke Tx handler */
        Can_17_McmCan_lTxEventHandler(CntrlIndx,CanCoreState,CanConfig);
      }
      /* [cover parentID={C3B17DCE-E7F1-4984-811F-744B914FA7C3}]
      [cover parentID={D0F08DBA-DBE3-4441-9EA9-52407DEDD02E}]
      Reset flag for next RxEvent Entry
      [/cover] */
      /* Reset flag for next TxEvent Entry */
      NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_TEFN_BIT;
    }
  }
  /* [cover parentID={F75BF717-BD29-42cf-B0CA-F37F8FBA550D}]
  [/cover] */
}
#endif /* #if(CAN_17_MCMCAN_TX_INTERRUPT_PROCESSING == STD_ON) */

#if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)
/*******************************************************************************
**                                                                            **
** Syntax           : void Can_17_McmCan_IsrReceiveHandler                    **
**                    (                                                       **
**                      const uint8 HwKernelId                                **
**                      const uint8 NodeIdIndex                               **
**                    )                                                       **
**                                                                            **
** Description      : - This is the interrupt service routine for handling    **
**                      Interrupt of dedicated Rx buffer.                     **
**                      This function checks the CAN Controller is received   **
**                      any messages via Rx dedicated buffer if yes then      **
**                      calls receive handler function                        **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : HwKernelId - Requested with associated kernelId         **
**                    NodeIdIndex - Requested with associated node id         **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_IsrReceiveHandler(const uint8 HwKernelId, \
                                      const uint8 NodeIdIndex)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 CntrlIndx;
  uint8 CoreIndex;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* Local copy of the core specific configuration */
  CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
  /* Local copy of the core specific global states */
  CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
  /* Retrive core specific controller index */
  CntrlIndx = Can_17_McmCan_kGblConfigPtr->CanPhyControllerIndexPtr[ \
    (CAN_17_MCMCAN_FOUR * HwKernelId) + NodeIdIndex].CanPCoreSpecContIndex;
  /* Check the controller mode is Interrupt or not */
  /*[cover parentID= {3D8A9BC8-3DB0-4663-9882-728500A9D783}]
      Check the controller mode is Interrupt or not
      [/cover] */
  if(CAN_17_MCMCAN_POLLING != \
    CanConfig->CanEventHandlingConfigPtr[CntrlIndx]. \
      CanEventType[CAN_17_MCMCAN_ONE])
  {
    /* Set with Node Register Start address */
    NodeRegAddressPtr = \
      CanConfig->CanControllerConfigPtr[CntrlIndx].CanNodeAddress;
    /* Check if any of the Message stored to Dedicated Rx Buffer */
    /*[cover parentID={BB724744-3D24-49cd-B61C-1081F49E4FED}]
      Check if any of the Message stored to Dedicated Rx Buffer
      [/cover] */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->IR.B.DRX)
    {
        /*[cover parentID={FD1329C9-2BBF-483a-A187-46467202ECD1}]
      If current state is START Invoke receive handler function
      [/cover] */
      /* If current state is START Invoke receive handler function */
      if(CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CntrlIndx])
      {
        /* Call receive handler with buffer type as dedicated */
        Can_17_McmCan_lReceiveHandler(CntrlIndx,CAN_17_MCMCAN_ONE, \
          CanCoreState,CanConfig);
      }
      /* Reset flag for next message reception */
      NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_DRX_BIT;
    }
  }
  /* [cover parentID={072E300A-20F6-49a4-A2E0-78FF0BF320BD}]
  [/cover] */
  /* [cover parentID={B9BEDA0A-3510-428d-ADD3-371A5DAF6F46}]
  [/cover] */
}
#endif /* #if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON) */

#if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON)
/*******************************************************************************
** Traceability   : [cover parentID={ADE7805B-51A9-4d63-8F4E-91F628C4625C}]   **
**                                                                            **
** Syntax           : void Can_17_McmCan_IsrRxFIFOHandler                     **
**                    (                                                       **
**                      const uint8 HwKernelId                                **
**                      const uint8 NodeIdIndex                               **
**                    )                                                       **
**                                                                            **
** Description      : This is the interrupt service routine for checking      **
**                    Received messaged via RXFIFO                            **
**                    This function shall checks the CAN Controller FIFO      **
**                    status calls appropriate handler function               **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : HwKernelId - Requested with associated kernelId         **
**                    NodeIdIndex - Requested with associated node id         **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : none                                                    **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_IsrRxFIFOHandler (const uint8 HwKernelId, \
                                       const uint8 NodeIdIndex)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 CntrlIndx;
  uint8 CoreIndex;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* Local copy of the core specific configuration */
  CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
  /* Local copy of the core specific global states */
  CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
  /* Retrive core specific controller index */
  CntrlIndx = Can_17_McmCan_kGblConfigPtr->CanPhyControllerIndexPtr[ \
    (CAN_17_MCMCAN_FOUR * HwKernelId) + NodeIdIndex].CanPCoreSpecContIndex;
  /* Check the controller mode is Interrupt or not */
  /*[cover parentID= {025B7A9D-6559-4d8c-BBA7-AE2C19C76739}]
      Check the controller mode is Interrupt or not
      [/cover] */
  if(CAN_17_MCMCAN_POLLING != \
        CanConfig->CanEventHandlingConfigPtr[CntrlIndx]. \
        CanEventType[CAN_17_MCMCAN_ONE])
  {
    /* Set with Node Register Start address */
    NodeRegAddressPtr = \
      CanConfig->CanControllerConfigPtr[CntrlIndx].CanNodeAddress;
    /* Check if any of the New message written to Rx FIFO 0 */
    /*[cover parentID= {F09D073D-1AA6-4b42-83F0-7C91C64B08C8}]
      Check if any of the New message written to Rx FIFO 0
      [/cover] */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->IR.B.RF0W)
    {
        /*[cover parentID= {AB57AAFD-A47C-4e6e-BD8C-1DBADF909240}]
      If current state is STARTED Invoke receive handler function
      [/cover] */
      /* If current state is STARTED Invoke receive handler function */
      if(CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CntrlIndx])
      {
        /* Call receive handler with buffer type as RXFIFO0 */
        Can_17_McmCan_lReceiveHandler(CntrlIndx,CAN_17_MCMCAN_TWO, \
          CanCoreState, CanConfig);
      }

      /* [cover parentID={072E300A-20F6-49a4-A2E0-78FF0BF320BD}]
      [/cover] */
      /* Reset flag for New message to RXFIFO0 */
      NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_RF0W_BIT;
    }
    /* Check if any of the New message written to Rx FIFO 1 */
    /*[cover parentID= {CDC83D92-70B2-41ac-AF14-868EA78E3632}]
      Check if any of the New message written to Rx FIFO 1
      [/cover] */
    if(CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->IR.B.RF1W)
    {
        /*[cover parentID= {A31629D4-9B4B-43ee-83AF-529B0FD2BBBA}]
      If current state is STARTED Invoke receive handler function
      [/cover] */
      /* If current state is STARTED Invoke receive handler function */
      if(CANIF_CS_STARTED == CanCoreState->CanControllerModePtr[CntrlIndx])
      {
        /* Call receive handler with buffer type as RXFIFO1 */
        Can_17_McmCan_lReceiveHandler(CntrlIndx,CAN_17_MCMCAN_THREE, \
          CanCoreState,CanConfig);
      }

