liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/src/Can_17_McmCan.c
      /*[cover parentID=  {64C5383C-F8D0-4e31-A430-9F4BE8D20605}]
      [/cover] */
      /* Reset flag for New message to RXFIFO1 */

      NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_RF1W_BIT;
    }
  }
  /* [cover parentID={B80FE56D-D749-454d-AA35-DADAC2AC75F8}]
  [/cover] */
}
#endif /* #if(CAN_17_MCMCAN_RX_INTERRUPT_PROCESSING == STD_ON) */

#if(CAN_17_MCMCAN_BO_INTERRUPT_PROCESSING == STD_ON)
/*******************************************************************************
** Traceability   : [cover parentID={7F1E55A5-7758-442f-8BF8-2A8C1F035412}]   **
**                                                                            **
**  Syntax           : void Can_17_McmCan_IsrBusOffHandler                    **
**                    (                                                       **
**                      const uint8 HwKernelId                                **
**                      const uint8 NodeIdIndex                               **
**                    )                                                       **
**                                                                            **
**  Description      : - This is the interrupt service routine for BusOff     **
**                    handling                                                **
**                    This function will checks any of the CAN Controller     **
**                    associated with Can Module is on BusOff state then      **
**                    calls handler function with controller information      **
**  [/cover]                                                                  **
**                                                                            **
**  Service ID       : NA                                                     **
**                                                                            **
**  Sync/Async       : Synchronous                                            **
**                                                                            **
**  Reentrancy       : Non-Reentrant                                          **
**                                                                            **
**  Parameters (in)  : HwKernelId - Requested with associated kernelId        **
**                     NodeIdIndex - Requested with associated node id        **
**                                                                            **
**  Parameters (out) : none                                                   **
**                                                                            **
**  Return value     : none                                                   **
**                                                                            **
*******************************************************************************/
void Can_17_McmCan_IsrBusOffHandler (const uint8 HwKernelId, \
                                            const uint8 NodeIdIndex)
{
  volatile Ifx_CAN_N *NodeRegAddressPtr;
  uint8 CntrlIndx;
  uint8 CoreIndex;
  const Can_17_McmCan_CoreStatesType* CanCoreState;
  const Can_17_McmCan_CoreConfigType* CanConfig;

  /* Get core id which is executing currently */
  CoreIndex = CAN_17_MCMCAN_GETCOREID;
  /* Local copy of the core specific configuration */
  CanConfig = Can_17_McmCan_kGblConfigPtr->CanCoreConfigPtr[CoreIndex];
  /* Local copy of the core specific global states */
  CanCoreState = Can_17_McmCan_GblCoreState[CoreIndex];
  /* Retrive core specific controller index */
  CntrlIndx = Can_17_McmCan_kGblConfigPtr->CanPhyControllerIndexPtr[ \
    (CAN_17_MCMCAN_FOUR * HwKernelId) + NodeIdIndex].CanPCoreSpecContIndex;
  /* Check the BusOff for the controller mode is Interrupt or not */
  /* [cover parentID={DE031008-3078-4193-8F5F-44BF79E0C8F3}]
      Check the BusOff for the controller mode is Interrupt or not
      [/cover] */
  if(CAN_17_MCMCAN_POLLING != \
    CanConfig->CanEventHandlingConfigPtr[CntrlIndx]. \
       CanEventType[CAN_17_MCMCAN_TWO])
  {
    /* Set with Node Register Start address */
    NodeRegAddressPtr = \
        CanConfig->CanControllerConfigPtr[CntrlIndx].CanNodeAddress;
    /* [cover parentID={67FB7A19-A0C2-4f20-B7CA-C939C08D02E5}]
      Check if BusOff status is changed
    [/cover] */
    if( CAN_17_MCMCAN_BIT_SET_VAL == NodeRegAddressPtr->IR.B.BO)
    {

      #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
      if((TRUE != CanCoreState->CanIcomEnableStatusPtr[CntrlIndx])|| \
         (FALSE != CanCoreState->CanIcomConfgBOStatusPtr[CntrlIndx]))
      {
        /* If current state is STARTED
        Invoke BusOff handler function */
        Can_17_McmCan_lBusOffHandler(CntrlIndx,CanCoreState,CanConfig);
        /* [cover parentID={4FE04C6B-A812-4cbd-A335-628767BC288D}]
        [/cover] */
        /* [cover parentID={64006E0F-D702-4ca2-BC41-C5011F6A4713}]
        [/cover] */
        /* Reset BO flag */
        NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_BO_BIT;
      }
      #else /* #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */
      /* If current state is STARTED Invoke BusOff handler function */
      Can_17_McmCan_lBusOffHandler(CntrlIndx,CanCoreState,CanConfig);
      /* [cover parentID={B0977C05-ED20-4272-9A62-12151CB559C2}]
      Reset the Bus off flag
      [/cover] */
      /* Reset BO flag */
      NodeRegAddressPtr->IR.U = CAN_17_MCMCAN_CLEAR_IE_BO_BIT;
      #endif /* #if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON) */
    }
  }
}
#endif /* #if(CAN_17_MCMCAN_BO_INTERRUPT_PROCESSING == STD_ON) */
#define CAN_17_MCMCAN_STOP_SEC_CODE_QM_GLOBAL
/*[cover parentID={566ED99C-0D96-46ac-97BF-E97B04E2C700}]
[/cover] */
/*[cover parentID={4579FE20-92DA-4848-93DB-7AD4FD35DD50}]
[/cover] */
/*[cover parentID={5713A17A-3FA1-427f-A0B6-89125A17689A}]
[/cover] */
/*[cover parentID={E4047F9A-8865-4b2c-9D3C-385479854EAD}]
[/cover] */
/*[cover parentID={EA0715EE-3E3C-4aac-A42E-4B5CFC96CEED}]
[/cover] */
/*[cover parentID={A4F3B858-B167-4b5c-AB7F-390C5F5D2185}]
[/cover] */
/* MISRA2012_RULE_20_1_JUSTIFICATION: Memmap header usage as per Autosar
guideline. */
/* MISRA2012_RULE_4_10_JUSTIFICATION: Memmap header is repeatedly included
without safegaurd. It complies to Autosar guidelines. */
#include "Can_17_McmCan_MemMap.h"
